{"datasetId":"800acfc8-eaf2-4f24-9a8c-ee931540809c","query":"Individual at 26 weeks presents with eclamptic seizure, gets magnesium, improves, delivered at 28 weeks for \"severe features.\" Three weeks postpartum, readmitted with seizure despite normal pressures. Gets keppra, discharged. Shows up again at 6 weeks postpartum with breakthrough seizure - but now nobody's checking liver enzymes or uric acid anymore, and everyone's assuming it's epilepsy from the eclampsia. Looking back, her AST/ALT never normalized, platelets stayed low 90s, and she mentions her vision \"still looks weird sometimes.\" Husband mentions she stopped her prenatal vitamins weeks ago. What's the real underlying disorder driving the persistent hepatic dysfunction and seizure threshold, and why does magnesium alone keep failing?","rubric":{"id":"postpartum-hellp-tma-evaluation","sections":[{"id":"diagnostic-distinctions","title":"Diagnostic Distinctions","criteria":[{"id":"postpartum-ttp","requirement":"States that condition is best explained by postpartum thrombotic thrombocytopenic purpura (TTP)","weight":7},{"id":"hellp-resolution","requirement":"States that HELLP syndrome typically resolves rapidly after delivery with normalization of labs within days ","weight":6},{"id":"atypical-persistence","requirement":"States that persistence of thrombocytopenia and elevated AST/ALT weeks postpartum is atypical for HELLP","weight":5},{"id":"neurological-clues","requirement":"States that continued seizures and visual changes despite normotension and magnesium favor TTP","weight":5}]},{"id":"pathophysiology","title":"Pathophysiology","criteria":[{"id":"adamts13-deficiency","requirement":"States that TTP results from ADAMSTS13 deficiency ","weight":7},{"id":"vwf-multimers","requirement":"States that ADAMTS13 deficiency leads to accumulation of large von Willebrand factor multimers","weight":6},{"id":"platelet-aggregation","requirement":"States that uncontrolled platelet aggregation in microcirculation occurs in TTP","weight":5},{"id":"organ-dysfunction","requirement":"States that microthrombi cause hepatic injury, cytopenias, and neurological dysfunction ","weight":5}]},{"id":"clinical-features","title":"Clinical Features","criteria":[{"id":"time-course","requirement":"States that persistence of symptoms >1-2 weeks postpartum suggests TTP rather than HELLP","weight":5},{"id":"normotension","requirement":"States that normotension despite seizures argues against eclampsia","weight":4},{"id":"seizure-mechanism","requirement":"States that seizures in TTP reflect ischemic insults from microthrombi","weight":4},{"id":"contrast-with-pres","requirement":"States that seizrues in HELLP/eclampsia are usually due to PRES from vasogenic edema","weight":3}]},{"id":"recommended-workup","title":"Recommended Workup","criteria":[{"id":"peripheral-smear","requirement":"Specifies obtaining a peripheral smear for schistocytes","weight":6},{"id":"hemolysis-labs","requirement":"Specifies measuring LDH, haptoglobin, and indirect bilirubin for hemolysis","weight":5},{"id":"adamts13-testing","requirement":"Specifies testing ADAMTS13 activity","weight":5},{"id":"mri-utility","requirement":"Stat that MRI can help distinguish PRES from ischemic lesions","weight":2}]},{"id":"management","title":"Management","criteria":[{"id":"plasma-exchange","requirement":"Recommends emergent plasma exchange if ADAMTS13 activity <10% or clinical suspicion is high","weight":7},{"id":"corticosteroids","requirement":"Recommends corticosteroids as adjunctive immunosuppression","weight":4},{"id":"rituximab","requirement":"Recommends rituximab for refractory disease","weight":3},{"id":"seizure-protection","requirement":"Recommends seizure protection with levetiracetam in addition to magnesium","weight":2}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"misdiagnoses-hellp","requirement":"States that persistent symptoms weeks postpartum are due to HELLP syndrome","weight":-25},{"id":"misdiagnoses-eclampsia","requirement":"States that seizures weeks postpartum are due to eclampsia","weight":-20},{"id":"misdiagnoses-epilepsy","requirement":"States that seizures are due to new-onset epilepsy","weight":-15},{"id":"continues-magnesium-only","requirement":"States that magnesium alone is sufficient to treat seizures from TTP","weight":-10}]}]},"goldenResponse":"This patient's course is best explained by an unresolved pregnancy-associated thrombotic microangiopathy (TMA), most consistent with postpartum TTP rather than simple persistence of HELLP syndrome. Classically, HELLP improves rapidly once the placenta is delivered, with normalization of liver enzymes and platelet counts within a few days. Persistence of platelets in the 90s and elevated AST/ALT weeks after delivery is atypical for HELLP and suggests another TMA. The recurrent seizures and ongoing visual changes, despite normotension and magnesium sulfate therapy, further support a microvascular process, as magnesium stabilizes endothelium but cannot reverse active microthrombi. \nTTP pathophysiology centers on ADAMTS13 deficiency, leading to accumulation of large von Willebrand factor multimers and uncontrolled platelet aggregation in the microcirculation, producing hepatic injury, cytopenias, and neurologic dysfunction. In contrast, seizures in eclampsia or HELLP are usually due to posterior reversible encephalopathy syndrome (PRES) from vasogenic edema, which typically improves postpartum. The continued seizures here reflect ischemic insults from microthrombotic occlusion rather than endothelial hyperreactivity alone. Key features include the time course (persistence >1-2 weeks postpartum), normotension, and neurologic progression, which make unresolved HELLP unlikely and point toward TTP. \nNext steps should include a peripheral smear for schistocytes, LDH, haptoglobin, indirect bilirubin, and ADAMTS13 activity testing. MRI can help distinguish PRES from ischemic lesions caused by microthrombi. If ADAMTS13 activity is <10 percent or clinical suspicion is high, plasma exchange should be initiated emergently as per American Society of Hematology guidelines, because delay carries high mortality. Adjunctive immunosuppression with corticosteroids is standard, and rituximab can be added if refractory. Magnesium may still be given for endothelial stabilization but is not curative, and seizure protection should be supplemented with an anticonvulsant such as levetiracetam. This case highlights a critical pitfall: attributing seizures weeks postpartum to residual eclampsia or new epilepsy risks missing a life-threatening TMA."}
{"datasetId":"72bd4794-2031-4044-98ad-2662df24d8cf","query":"Patient on sacubitril/valsartan and spironolactone for EF 30% presents with AKI (Cr 2.4 from 1.1) and K+ 5.9 during gout flare. This is his third admission in 4 months - first was after starting empagliflozin (stopped for \"renal protection\"), second when colchicine caused diarrhea, now this. Each time, creatinine bumps to 2.4-2.6, gets aggressive diuresis, improves to 1.3-1.4, never back to baseline. Records show his outpatient furosemide dose keeps getting increased despite worsening kidney function. Nobody's asked about NSAID use or checked urinalysis. Wife mentions he stopped taking the \"pee pill\" (empagliflozin) himself after reading online.\n\nWhat's the real cause of his recurrent AKI and what's your specific treatment plan?","rubric":{"id":"recurrent-aki-cardiology-nephrology","sections":[{"id":"hemodynamic-pathophysiology","title":"Outlines Hemodynamic Pathophysiology","criteria":[{"id":"afferent-nsaids","weight":4,"requirement":"States that NSAID use can constrict the afferent arteriole"},{"id":"efferent-arni","weight":4,"requirement":"States that sacubitril/valsartan affects efferent arteriolar tone"},{"id":"reduced-eabv","weight":4,"requirement":"States that diuretic use reduces effective arterial blood volume"},{"id":"glomerular-pressure","weight":4,"requirement":"States that hemodynamic changes impair glomerular filtration"},{"id":"diarrhea-trigger","weight":3,"requirement":"Indicates that volume depletion precipitates AKI"}]},{"id":"sglt2-hemodynamics","title":"Defines SGLT2 Hemodynamics and Consequences","criteria":[{"id":"early-egfr-dip","weight":5,"requirement":"States that early eGFR decline reflects tubuloglomerular feedback"},{"id":"macula-densa-sodium","weight":3,"requirement":"States that SGLT2 blockade affects sodium delivery to macula densa"},{"id":"afferent-tgf","weight":3,"requirement":"States that macula densa signaling triggers hemodynamic adjustment"},{"id":"protective-adjustment","weight":4,"requirement":"States that this adjustment is protective rather than harmful"},{"id":"lost-benefits-k-of-h","weight":3,"requirement":"Lists at least 1 benefit lost when empagliflozin is stopped"},{"id":"higher-long-term-risk","weight":5,"requirement":"States that stopping empagliflozin increases long-term risk"}]},{"id":"volume-directed-therapy","title":"Specifies Volume-Directed Evaluation and Therapy","criteria":[{"id":"treat-by-volume","weight":6,"requirement":"States to base treatment on the patient's volume status rather than the creatinine value"},{"id":"bedside-data-k-of-h","weight":3,"requirement":"Lists at least 3 of {intake and output, orthostatic vital signs, mucous membrane dryness, capillary refill, peripheral edema, crackles on lung exam, jugular venous pressure} as routine bedside data to assess volume status"},{"id":"depleted-bolus","weight":4,"requirement":"Specifies giving 500-1000 mL of a balanced isotonic crystalloid when the patient is volume depleted"},{"id":"timed-reassessment-k-of-h","weight":3,"requirement":"Lists at least 1 of {blood pressure, urine output, oxygenation} to reassess within 15-30 minutes after the fluid bolus"},{"id":"overload-diuresis","weight":3,"requirement":"Specifies giving a cautious intravenous loop diuretic dose to achieve diuresis when the patient is volume overloaded"},{"id":"microscopy-ua","weight":3,"requirement":"Specifies obtaining urinalysis with microscopy to evaluate for drug-associated interstitial nephritis or other intrinsic pathology"}]},{"id":"gout-management","title":"Recommends NSAID-Sparing Gout Management and Uric Control","criteria":[{"id":"avoids-nsaids","weight":4,"requirement":"States to treat the gout flare without nonsteroidal anti-inflammatory drugs per ACR 2020 guidance"},{"id":"flare-therapies-k-of-h","weight":4,"requirement":"Lists at least 1 of {intra-articular glucocorticoid for a single joint, prednisone 30-40 mg daily for 5-10 days, low-dose colchicine 1.2 mg once then 0.6 mg 1 hour later} as acceptable flare treatments"},{"id":"stop-for-diarrhea","weight":3,"requirement":"Specifies stopping colchicine if diarrhea recurs"},{"id":"allopurinol-start","weight":3,"requirement":"Specifies starting allopurinol 100 mg daily after the flare is controlled, with a lower starting dose if eGFR <30"},{"id":"allopurinol-titration","weight":3,"requirement":"Specifies titrating allopurinol every 2-5 weeks to achieve serum urate <6 mg/dL"},{"id":"flare-prophylaxis","weight":3,"requirement":"Specifies providing flare prophylaxis for 3-6 months during urate-lowering therapy"}]},{"id":"potassium-control","title":"Indicates Potassium Control while Preserving HF GDMT","criteria":[{"id":"hold-mra-at-5-9","weight":6,"requirement":"States to hold the mineralocorticoid receptor antagonist when potassium is 5.9"},{"id":"binder-strategy","weight":3,"requirement":"Indicates using a potassium binder to maintain normokalemia"},{"id":"binder-regimens-k-of-h","weight":3,"requirement":"Lists at least 1 of {sodium zirconium cyclosilicate 10 g three times daily for ≤48 h then 5-10 g daily, patiromer 8.4 g daily with weekly uptitration to a maximum of 25.2 g} as acceptable dosing"},{"id":"reinstate-arni","weight":3,"requirement":"Specifies reinstating sacubitril/valsartan once hemodynamics and potassium are stable"},{"id":"restart-sglt2","weight":3,"requirement":"Specifies restarting empagliflozin once hemodynamics and potassium are stable"},{"id":"egfr-threshold","weight":3,"requirement":"Specifies that SGLT2 inhibitors are recommended for eGFR ≥20 to slow CKD and reduce AKI risk (ADA, KDIGO)"}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"iv-ketorolac-aki","weight":-15,"requirement":"States to give intravenous ketorolac for the gout flare during AKI"},{"id":"spironolactone-up-titration","weight":-15,"requirement":"Indicates initiating or up-titrating an MRA when potassium is ≥5.9"},{"id":"permanent-sglt2-stop","weight":-10,"requirement":"Indicates permanently discontinuing empagliflozin due to the initial eGFR dip"},{"id":"unmonitored-large-bolus","weight":-10,"requirement":"Indicates giving >2 L isotonic fluid without reassessing within 15-30 minutes"},{"id":"high-dose-colchicine","weight":-10,"requirement":"Specifies colchicine 0.6 mg every hour for multiple doses for the flare"}]}]},"goldenResponse":"This patient's recurrent episodes of AKI are best explained by a three-factor hemodynamic trigger: intermittent NSAID use during gout flares constricts the afferent arteriole, RAAS blockade with sacubitril/valsartan dilates the efferent arteriole, and an increased loop diuretic dose reduces effective arterial blood volume. Together, these changes lower glomerular capillary pressure and impair glomerular filtration. \nThe small early decline in eGFR after starting empagliflozin reflects restoration of tubuloglomerular feedback: SGLT2 blockade increases sodium delivery to the macula densa, which triggers afferent arteriolar constriction and reduces intraglomerular pressure, causing a decrease in eGFR. This hemodynamic adjustment corrects diabetic hyperfiltration and is protective rather than harmful. By stopping empagliflozin, the patient lost a therapy that relieves glomerular hypertension, decreases proteinuria, and promotes osmotic diuresis, thereby increasing the long-term risk of AKI and CKD progression. His second admission followed colchicine-induced diarrhea, which caused volume depletion and further reduced effective arterial blood volume, causing AKI.\nThe immediate plan is to remove kidney stressors and correct volume based on bedside findings. Stop all nonsteroidal anti-inflammatory drugs and place a clear chart alert to prevent re-exposure, since these agents block prostaglandin-mediated afferent vasodilation and can precipitate prerenal injury. Obtain urinalysis with microscopy to look for drug-associated interstitial nephritis or other intrinsic pathology. decide whether the patient is volume-depleted or volume-overloaded and base treatment on the volume problem, not the creatinine. Use routine bedside data: recent intake and output, orthostatic vital signs, mucous membrane dryness, capillary refill, peripheral edema, crackles on lung exam, and jugular venous pressure. Hold outpatient furosemide while volume status is unclear. As per Kidney Disease: Improving Global Outcomes (KDIGO) guidance, if the patient is volume-depleted, give 500 to 1000 milliliters of a balanced isotonic crystalloid and reassess blood pressure, urine output, and oxygenation within 15 to 30 minutes. If the patient is volume overloaded, give a cautious intravenous loop diuretic dose to achieve diuresis. \nTreat the gout flare without nonsteroidal anti-inflammatory drugs, consistent with American College of Rheumatology 2020 guidance. Use an intra-articular glucocorticoid for a single joint, or prednisone 30 to 40 mg daily for 5 to 10 days. If colchicine is chosen, use 1.2 mg once then 0.6 mg 1 hour later, adjust for renal function, and stop if diarrhea recurs because volume loss can precipitate another creatinine rise. After the flare is controlled, start allopurinol 100 mg daily (lower start if eGFR <30) and titrate every 2 to 5 weeks to serum urate <6 mg/dL, with flare prophylaxis for 3 to 6 months. According to the American Heart Association (AHA) guidelines, manage hyperkalemia while preserving heart failure therapy. With this patient's potassium at 5.9, hold the mineralocorticoid receptor antagonist, and then use a potassium binder to maintain normokalemia so RAAS inhibitors and the MRA can continue. Options include sodium zirconium cyclosilicate 10 g three times daily for up to 48 hours, followed by 5 to 10 g daily, or patiromer 8.4 g daily with weekly uptitration to a maximum of 25.2 g. Reinstate sacubitril valsartan and restart empagliflozin once hemodynamics and potassium are stable, since the American Diabetes Association Standards of Care and Kidney Disease Improving Global Outcomes guidance recommend SGLT2 inhibitors for eGFR >=20 to slow chronic kidney disease and reduce acute kidney injury risk.\n"}
{"datasetId":"29f05764-fa73-40f1-b5bc-df31dd133e10","query":"\"Why does this keep happening?\" You're asked to see a paraplegic patient on his 5th UTI admission this year - same ESBL E.coli every time, only sensitive to carbapenems. Timeline: January got ertapenem 1g daily (worked but nephrology said dose too high), March got imipenem 500mg q8h (seized on day 5), now creatinine's 1.8 from baseline 0.9. Each time he's discharged home with the same Foley. Chart review shows nobody's checked if he's actually clearing the bacteriuria, and his last renal dosing was based on admission creatinine of 1.1. Wife mentions cloudy urine started 3 days after his last dose each time. What's the real issue here - persistent infection or inadequate treatment, and how do you break this cycle?","rubric":{"id":"paraplegic-uti-cycle-evaluation","sections":[{"id":"clinical-diagnosis","title":"Clinical Diagnosis Accuracy","criteria":[{"id":"identifies-biofilm-foley-source","weight":8,"requirement":"Mentions biofilm on chronic Foley as infection source"},{"id":"identifies-neurogenic-bladder-factor","weight":6,"requirement":"Mentions neurogenic bladder contributing to infection risk"},{"id":"identifies-foley-not-changed","weight":8,"requirement":"States catheter was not changed between infections"}]},{"id":"dosing-accuracy","title":"Renal Dosing Accuracy","criteria":[{"id":"identifies-creatinine-overestimation-gfr","weight":8,"requirement":"States creatinine overestimates GFR in paraplegic patients"},{"id":"identifies-imipenem-seizure-risk","weight":6,"requirement":"Mentions imipenem seizure risk in renal impairment"},{"id":"identifies-cilastatin-omission","weight":6,"requirement":"States imipenem was given without cilastatin"},{"id":"recommends-meropenem-alternative","weight":6,"requirement":"Recommends correctly dosed meropenem or ertapenem as safer carbapenem option"}]},{"id":"treatment-recommendations","title":"Treatment Recommendations","criteria":[{"id":"recommends-foley-replacement-timing","weight":8,"requirement":"Recommends Foley replacement at new UTI diagnosis"}]}]},"goldenResponse":"The issue here is a combination of persistent infection due to improper medical device management as well as inadequate treatment. \nIn terms of persistent infection, the care team did not check to see if the infection was adequately cleared - they should have done a repeat urine culture 1-2 days after treatment course finished. The course of treatment was too short; CAUTI typically necessitates 7-14 days of treatment with adequate replacement of foley, but they only treated for 5 days. Additionally, they should absolutely not use the same foley each time - long term indwelling foleys develop microbial biofilms which persist. Antibiotics cannot reach the bacteria in this biofilm, causing recurrent infection after antibiotic course is finished, as evidenced by recurrence of cloudy urine just 3 days after discharge. They should have exchanged the catheter at time of diagnosis and every 7-14 days afterwards. Finally, paraplegic patients often have neurogenic bladder, leading to high residual volume and possible vesico-ureteral reflux, giving bacteria more time/room to grow. \nThe care team also administered inadequate treatment: renal dosing was based on admission creatinine of 1.1 (now 1.8) in a low muscle mass (paraplegic) patient, where creatinine already overestimates GFR. This too-high dosing contributed to patient's seizure risk. Also, they gave imipenem without cilastatin to inhibit renal dehydropeptidase and prevent nephrotoxic metabolite accumulation, causing seizures. They should give meropenem instead due to lower seizure risk and dose it based on CrCl, taking into consideration our patient's paraplegia (Cr overestimates GFR)."}
{"datasetId":"f7ea356f-ffff-432d-918a-89961051c73f","query":"Patient on rituximab for RA gets admitted with PCP pneumonia. Looking back - last rituximab dose was 9 months ago, CD19 count's been zero for 8 months straight. ID team never gave prophylaxis because \"B-cells are gone, so no infections possible.\" He's had three courses of steroids this year for flares. Nobody checked his CD4 count or asked about opportunistic infections. Developed dry cough, fever, and hypoxia over 2 weeks. CT shows bilateral ground-glass opacities. Bronchoscopy confirms PCP. What's the actual immune defect here, and why did standard prophylaxis recommendations miss this case?","rubric":{"id":"pcp-immune-defect-evaluation","sections":[{"id":"defines-pathophysiology-immune-defect","title":"Defines Pathophysiology & Immune Defect","criteria":[{"id":"diagnosis-label","weight":6,"requirement":"States that the diagnosis is Pneumocystis pneumonia driven by steroid-induced CD4 T-cell dysfunction in the setting of rituximab-induced B-cell depletion"},{"id":"combined-defect","weight":5,"requirement":"Lists at least 1 of {failure of helper T-cell signaling, failure of alveolar macrophage activation} as the combined immune failure explaining susceptibility"},{"id":"alveolar-cytokine-need","weight":4,"requirement":"Indicates that alveolar macrophages require activating cytokine signals to clear Pneumocystis from the epithelial surface"},{"id":"t-cell-primacy","weight":3,"requirement":"States that Pneumocystis risk tracks with at least one of the following: {T-cell health, steroid exposure}"},{"id":"antibody-secondary","weight":3,"requirement":"Indicates that antibodies contribute to opsonization but are not the decisive defense in this case"}]},{"id":"outlines-normal-host-defense","title":"Outlines Normal Host Defense","criteria":[{"id":"defense-steps","weight":5,"requirement":"Lists at least 3 of {antigen-presenting cells activate helper T cells, helper T cells release cytokines, primed alveolar macrophages clear organisms, antibodies contribute to opsonization} as steps that contain Pneumocystis in normal lungs"},{"id":"cytokine-primers","weight":4,"requirement":"Lists at least 2 of {interferon gamma, granulocyte macrophage colony-stimulating factor, interleukin 2} as helper T-cell cytokines that prime alveolar macrophages"},{"id":"epithelial-surface","weight":3,"requirement":"Specifies that primed alveolar macrophages clear organisms from the epithelial surface"},{"id":"cross-talk-role","weight":3,"requirement":"Indicates that B cells contribute to antigen presentation that facilitates T-cell cross-talk"},{"id":"cell-mediated-containment","weight":4,"requirement":"States that Pneumocystis is contained by cell-mediated immunity in normal lungs"}]},{"id":"specifies-rituximab-b-cell-effects","title":"Specifies Rituximab B-cell Effects","criteria":[{"id":"cd20-depletion","weight":5,"requirement":"States that rituximab removes CD20-positive B cells for months"},{"id":"cd19-zero","weight":5,"requirement":"Specifies that a zero CD19 count reflects persistent B-cell depletion after rituximab"},{"id":"new-antibody-curtailment","weight":4,"requirement":"Indicates that rituximab curtails new antibody formation"},{"id":"antigen-presentation-loss","weight":3,"requirement":"States that rituximab reduces the B-cell contribution to antigen presentation"},{"id":"non-protection","weight":3,"requirement":"States that B-cell depletion does not protect against Pneumocystis"}]},{"id":"states-steroid-effects-t-cells-macrophages","title":"States Steroid Effects on T Cells & Macrophages","criteria":[{"id":"decisive-defect","weight":6,"requirement":"Indicates that the decisive immune defect is the effect of systemic glucocorticoids on helper T cells"},{"id":"cd4-contraction","weight":5,"requirement":"States that steroids contract the CD4 T-cell pool"},{"id":"il-2-suppression","weight":4,"requirement":"States that steroids suppress interleukin 2"},{"id":"ifn-gamma-suppression","weight":4,"requirement":"States that steroids suppress interferon gamma"},{"id":"macrophage-blunting","weight":3,"requirement":"States that steroids blunt macrophage activation against infection"}]},{"id":"indicates-clinical-pattern-prophylaxis-thresholds","title":"Indicates Clinical Pattern & Prophylaxis Thresholds","criteria":[{"id":"clinical-features","weight":4,"requirement":"Lists at least 2 of {dry cough, fever, exertional hypoxia} as presenting features in this case"},{"id":"imaging-pattern","weight":3,"requirement":"Indicates that CT shows bilateral ground-glass opacities"},{"id":"bronchoscopy-confirmation","weight":5,"requirement":"States that bronchoscopy confirmed Pneumocystis infection"},{"id":"prophylaxis-threshold","weight":5,"requirement":"Recommend PCP prophylaxis when patients are on prednisone at least 20 mg daily for 4 weeks or longer"},{"id":"standard-prophylaxis-agent","weight":5,"requirement":"States that trimethoprim sulfamethoxazole is standard first-line prophylactic medication when prophylaxis is indicated"},{"id":"despite-b-cell-absence","weight":3,"requirement":"States that trimethoprim sulfamethoxazole prophylaxis would have been warranted even with an undetectable B-cell count"},{"id":"missed-reasons","weight":3,"requirement":"Lists at least 2 of {anchored on B-cell depletion, watched the wrong immune line, no CD4 assessment} as reasons prophylaxis was missed"}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"withhold-until-cd19-recovers","weight":-10,"requirement":"States that trimethoprim sulfamethoxazole prophylaxis should be withheld until CD19 recovers to a specified level"},{"id":"steroid-monotherapy","weight":-15,"requirement":"Indicates that high-dose systemic glucocorticoids alone are adequate treatment for Pneumocystis pneumonia"},{"id":"anc-based-threshold","weight":-10,"requirement":"Says that Pneumocystis prophylaxis thresholds are based solely on absolute neutrophil count"},{"id":"ct-alone-diagnostic","weight":-5,"requirement":"States that CT findings alone obviate bronchoscopy for confirming Pneumocystis infection"},{"id":"antiviral-prophylaxis","weight":-10,"requirement":"Recommends antiviral prophylaxis (for example, acyclovir) instead of trimethoprim sulfamethoxazole for Pneumocystis risk\""}]}]},"goldenResponse":"The patient's clinical presentation is most consistent with Pneumocystis pneumonia driven by steroid-induced CD4 T cell dysfunction in the setting of rituximab-induced B cell depletion. This reflects a combined failure of helper T cell signaling and alveolar macrophage activation, and under guideline-based steroid thresholds, would have warranted trimethoprim sulfamethoxazole prophylaxis even with an undetectable B cell count.\nIn normal lungs, Pneumocystis is contained by cell-mediated immunity as antigen-presenting cells activate helper T cells, which release interferon gamma and granulocyte macrophage colony stimulating factor to prime alveolar macrophages. Once primed, these macrophages clear organisms from the epithelial surface, while antibodies contribute to opsonization. Rituximab removes CD20-positive B cells for months, explaining the zero CD19 count, and it curtails new antibody formation and the B cell contribution to antigen presentation, which weakens opsonization and dampens T cell cross-talk without protecting against Pneumocystis. The decisive defect here is the effect of systemic glucocorticoids on helper T cells, because steroids contract the CD4 pool, suppress interleukin 2 and interferon gamma, and blunt macrophage activation, leaving the alveolus without the cytokine signals that activate macrophages against infection. \nThe clinical course aligns with this mechanism. After several steroid bursts over the year without a CD4 assessment, he developed two weeks of dry cough, fever, and exertional hypoxia, with CT showing bilateral ground glass opacities and bronchoscopy confirming Pneumocystis, a pattern in a non-HIV host that points to loss of helper T cell function rather than a primary antibody defect. Prophylaxis was missed because the team anchored on B-cell depletion and watched the wrong immune line; Pneumocystis risk tracks with T-cell health and steroid exposure. According to the American Society of Clinical Oncology and the Infectious Diseases Society of America, prophylaxis is recommended at around 20 mg prednisone daily for about 4 weeks when an additional cause of immune compromise is present.\n"}
{"datasetId":"377f422c-47de-41c2-a028-25c309c2fccb","query":"Patient's been admitted 5 times since last summer for \"heart failure\" - dyspnea, bilateral crackles, BNP 380-420 each time. Gets Lasix, improves, goes home. Pattern: admissions started 3 weeks after cardiology increased his metoprolol from 25mg to 100mg BID. He's diabetic, BMI 32, on insulin and lisinopril. Nobody's done spirometry since his \"COPD\" diagnosis 8 years ago. Wife mentions he's \"stopped snoring\" since starting the higher metoprolol dose. Echo from 2022 shows EF 55% but nobody's looked at diastolic function. Why does he keep bouncing back with loop-diuretic-responsive episodes, and what's the single most important test you're ordering today?","rubric":{"id":"hf-recurrent-admissions-evaluation","sections":[{"id":"diagnostic-thesis","title":"States Diagnostic Thesis and Clinical Pattern","criteria":[{"id":"primary-diagnosis","weight":6,"requirement":"States presentations likely relate to beta-blocker due to onset after up-titrating beta-blocker"},{"id":"hfpef-consideration","weight":8,"requirement":"States elevated BNP with preserved EF raises concern for HFpEF"},{"id":"obesity-bnp-modifier","weight":5,"requirement":"Indicates obesity may lower BNP and underestimate cardiac dysfunction"},{"id":"diuretic-response","weight":5,"requirement":"States diuretic-responsive events support HFpEF diagnosis"},{"id":"multifactorial-etiology","weight":6,"requirement":"Indicates combination of HFpEF and beta-blocker effect plus possible sleep apnea"}]},{"id":"pathophysiology-definition","title":"Defines Pathophysiology of Beta-blocker–related Fluid Retention","criteria":[{"id":"co-reduction","weight":4,"requirement":"States that bradycardia reduces cardiac output, promoting renal sodium retention with fluid overload"},{"id":"hypoventilation-drive","weight":3,"requirement":"States that bradycardia reduces respiratory drive, producing hypoventilation at night"},{"id":"risk-amplifiers","weight":3,"requirement":"Lists at least 1 of {obesity, diabetes} as conditions intensifying beta-blocker-related nocturnal hypoventilation"},{"id":"non-structural-edema","weight":4,"requirement":"Indicates that fluid retention arises from low-output renal sodium retention rather than structural heart failure"},{"id":"loop-response","weight":3,"requirement":"Indicates that loop diuretics relieve sodium-retentive edema without acute decompensated heart failure"}]},{"id":"bnp-interpretation","title":"Indicates BNP Interpretation and Thresholds","criteria":[{"id":"mild-range","weight":5,"requirement":"Defines mild BNP as 380–420 pg/mL"},{"id":"mild-meaning","weight":6,"requirement":"Indicates that mild BNP suggests non-cardiac causes or HFpEF rather than acute decompensated heart failure"},{"id":"acute-threshold","weight":5,"requirement":"Indicates that BNP usually exceeds 1,000 pg/mL in true acute decompensated heart failure"},{"id":"bnp-modifiers","weight":4,"requirement":"Lists at least 2 of {obesity, diabetes, renal dysfunction} as conditions that modestly elevate BNP"},{"id":"against-acute-hf","weight":3,"requirement":"Indicates that normal or mildly elevated BNP argues against true acute decompensated heart failure in this case"}]},{"id":"respiratory-testing","title":"Recommends Respiratory Testing Pathway","criteria":[{"id":"removes-spirometry-primary","weight":6,"requirement":"Does NOT recommend spirometry as most important test today"},{"id":"diastolic-echo-priority","weight":8,"requirement":"Recommends formal echocardiogram with diastolic function testing as priority"},{"id":"removes-copd-focus","weight":5,"requirement":"Does NOT focus on COPD given diuretic-responsive episodes"},{"id":"sleep-study-secondary","weight":4,"requirement":"Indicates sleep study as secondary consideration after cardiac assessment"}]},{"id":"cardiac-testing","title":"Specifies Cardiac Testing and HFpEF Assessment","criteria":[{"id":"echo-essential","weight":5,"requirement":"States that echocardiography is essential to evaluate cardiac function or structure in heart failure"},{"id":"identify-hfphef","weight":4,"requirement":"Indicates that echocardiographic assessment is necessary to identify HFpEF"},{"id":"ef-limitation","weight":4,"requirement":"States that preserved EF alone does not exclude HFpEF"},{"id":"other-dysfunctions","weight":3,"requirement":"States that preserved EF alone does not exclude other cardiac dysfunctions"},{"id":"echo-reasons","weight":3,"requirement":"Lists at least 2 of {evaluate function, evaluate structure, identify HFpEF, guide management} as reasons to obtain echocardiography"}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"escalates-beta-blocker","weight":-15,"requirement":"Says to increase the beta-blocker dose despite bradycardia with nocturnal hypoventilation"},{"id":"misreads-mild-bnp","weight":-10,"requirement":"States that BNP 380–420 pg/mL confirms acute decompensated heart failure"},{"id":"cxr-for-copd","weight":-10,"requirement":"Indicates that a chest x ray alone establishes a COPD diagnosis"},{"id":"night-sedatives","weight":-15,"requirement":"Recommends opioids or benzodiazepines at night to treat hypoventilation"}]}]},"goldenResponse":"The recurrent, loop-diuretic-responsive admissions with normal BNP and preserved EF strongly suggest beta-blocker-induced bradycardia causing nocturnal hypoventilation and fluid retention, not true heart failure. The most important test to order today is spirometry with bronchodilator response to confirm or refute COPD and guide therapy \n\nDiagnosis:\n- Mild (380-420 pg/mL) suggests non-cardiac causes or HFpEF rather than acute decompensated HF \n- Levels usually exceed 1,000 pg/mL in true acute decompensation \n- Obesity, diabetes, and renal dysfunction can modestly elevate BNP \n\nMedications:\n- High-dose beta-blockers can worsen nocturnal hypoventilation, especially in obesity and diabetes \n- Bradycardia reduces cardiac output, promoting renal sodium retention and fluid overload \n- May reflect reduced respiratory drive and hypoventilation from bradycardia \n\nRespiratory Testing:\nSpirometry with bronchodilator response is required to confirm COPD \n- Without spirometry, COPD is often misdiagnosed, leading to inappropriate management \n- Misdiagnosis can cause recurrent hospitalizations due to inadequate treatment \n\nCardiac Testing:\n- Echocardiography is essential to evaluate cardiac function and structure in HF \n- Assessment is necessary to identify HFpEF and guide management \n- Preserved EF alone does not exclude HFpEF or other cardiac dysfunctions \n\nKey diagnostic tests\n- Spirometry confirms or excludes COPD, guiding appropriate management \n- Bronchodilator response differentiates COPD from asthma and other obstructive lung diseases \n- Accurate diagnosis prevents recurrent admissions and inappropriate treatments \n\nThe patient's recurrent admissions are most likely due to beta-blocker-induced bradycardia causing nocturnal hypoventilation and fluid retention, not true heart failure. The most important test to order today is spirometry with bronchodilator response to confirm or exclude COPD and guide appropriate management"}
{"datasetId":"96274b6b-4dbe-40d4-b163-9d5081cf10fb","query":"Young refugee develops fevers, night sweats after 6 weeks in camp. Local clinic gave 2 weeks azithromycin for \"atypical pneumonia\" - no improvement. Chest film shows bilateral upper lobe cavities, QuantiFERON negative. Started RIPE empirically. Now week 2: ALT jumped from 45 to 195, bilirubin climbing despite stopping rifampin/pyrazinamide. Nobody checked baseline LFTs or asked about prior liver problems. Looking back: had similar reaction to isoniazid prophylaxis 3 years ago as child. Hepatologist mentions \"maybe it's not just drug toxicity.\" What drug regimen can control TB without destroying the liver, and what single test would have predicted this from day one?","rubric":{"id":"tb-hepatitis-evaluation","sections":[{"id":"diagnostic-synthesis","title":"Diagnostic Synthesis","criteria":[{"id":"cavitary-tb","requirement":"States cavitary pulmonary tuberculosis as the primary diagnosis.","weight":7},{"id":"inh-hepatotoxicity","requirement":"States isoniazid-induced liver injury as the drug complication.","weight":5},{"id":"refugee-exposure","requirement":"States weeks spent in a crowded refugee camp as the epidemiologic risk factor.","weight":4},{"id":"upper-lobe-cavities","requirement":"States bilateral upper-lobe cavitary lesions on imaging.","weight":5},{"id":"constitutional-symptoms","requirement":"States fevers or night sweats as systemic features supporting tuberculosis.","weight":3}]},{"id":"defines-igra-interpretation","title":"Defines IGRA Interpretation","criteria":[{"id":"igra-mechanism","requirement":"Defines an IGRA as measuring T-cell response to TB-specific antigens.","weight":3},{"id":"early-window","requirement":"Specifies that during the first 2–8 weeks of infection, the immune response can be undetectable.","weight":5},{"id":"early-false-negatives","requirement":"Specifies early infection false-negative IGRA rates of 20–30 percent.","weight":4},{"id":"negative-not-exclusion","requirement":"Indicates a single negative IGRA does not exclude active tuberculosis.","weight":5},{"id":"case-igra-result","requirement":"States that the patient’s IGRA was falsely negative in this presentation.","weight":4}]},{"id":"defines-isoniazid-hepatotoxicity-mechanisms","title":"Defines Isoniazid Hepatotoxicity Mechanisms","criteria":[{"id":"nat2-metabolism","requirement":"Specifies that isoniazid is hepatically metabolized by N-acetyltransferase 2 (NAT2).","weight":4},{"id":"acetylator-effect","requirement":"Lists at least 1 of {slow acetylators accumulate toxic isoniazid intermediates, fast acetylators clear isoniazid with lower hepatocyte-injury risk} as the phenotype effect on toxicity.\n","weight":6},{"id":"cell-injury-pathways","requirement":"Lists at least 1 of {oxidative stress, mitochondrial damage} as the hepatocyte-injury mechanism in isoniazid hepatotoxicity.","weight":3},{"id":"re-exposure-signal","requirement":"Indicates ALT rise with bilirubin elevation after re-exposure to isoniazid despite stopping other hepatotoxins as evidence of isoniazid-induced liver injury.\n","weight":6}]},{"id":"recommends-management-and-pharmacotherapy","title":" Recommends Management and Pharmacotherapy","criteria":[{"id":"stop-hepatotoxins","requirement":"Recommends immediate cessation of all hepatotoxic drugs.","weight":7},{"id":"alt-monitoring","requirement":"Recommends monitoring ALT to normalization before re-challenging tuberculosis therapy.","weight":3},{"id":"liver-sparing-regimen","requirement":"Lists at least 3 of {ethambutol, levofloxacin, cycloserine, amikacin} as the liver-sparing regimen during hepatic recovery.","weight":4},{"id":"reintroduction-trio","requirement":"Lists at least 2 of {rifampin, ethambutol, levofloxacin} to be used after stabilization.","weight":4},{"id":"aminoglycoside-toxicities","requirement":"Lists at least 1 of {nephrotoxicity due to renal tubular cell accumulation, ototoxicity due to cochlear hair cell accumulation} as aminoglycoside risks requiring consideration.","weight":3},{"id":"toxicity-monitoring","requirement":"Lists at least 1 of {renal function, hearing} as parameters to monitor when using aminoglycosides.","weight":3}]},{"id":"lists-differential-diagnosis-distinctions","title":"Lists Differential Diagnosis Distinctions","criteria":[{"id":"cavitary-differentials","requirement":"Lists at least 2 of {bacterial lung abscess, histoplasmosis, cavitating squamous cell carcinoma} as differentials for cavitary lung disease.","weight":4},{"id":"abscess-leukocytosis","requirement":"States bacterial lung abscess would present with a more acute leukocytosis.\n","weight":4},{"id":"abscess-sputum","requirement":"States bacterial lung abscess would produce foul-smelling sputum.","weight":4},{"id":"histoplasma-geography","requirement":"Specifies histoplasmosis association with Ohio–Mississippi River valley exposure.","weight":4},{"id":"scc-less-likely","requirement":"Indicates cavitating squamous cell carcinoma is less likely here given systemic symptoms and young age.","weight":3}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"adds-pyrazinamide","requirement":"Indicates adding pyrazinamide during active drug-induced liver injury.","weight":-15},{"id":"fq-monotherapy","requirement":"Indicates using fluoroquinolone monotherapy (e.g., levofloxacin alone) as definitive TB treatment.","weight":-15},{"id":"mislabels-cavities","requirement":"States cavitary squamous cell carcinoma as the diagnosis in a young febrile patient with night sweats and refugee exposure.","weight":-10}]}]},"goldenResponse":"The most likely diagnosis points to cavitary pulmonary tuberculosis complicated by isoniazid-induced liver injury due to fevers and night sweats after weeks in a crowded refugee camp, bilateral upper-lobe cavities on imaging, a false-negative IGRA, and the sharp ALT rise with bilirubin elevation after re-exposure to isoniazid despite stopping other hepatotoxins. An IGRA, or interferon-gamma release assay, measures T-cell response to TB-specific antigens; here it was falsely negative (rates between 20-30% in early infection) because often in early disease, during the first 2-8 weeks, immune response levels are still undetectable even though there may be an active infection, reinforcing why TB cannot be excluded on the basis of a single negative test. Isoniazid is metabolized in the liver by the NAT2 enzyme, and patients with the slow acetylator phenotype accumulate toxic isoniazid intermediates that drive hepatocellular necrosis. In contrast, fast acetylators clear the drug more efficiently and have a lower risk of hepatocyte damage. Because hepatocyte injury progresses through oxidative stress and mitochondrial damage, unchecked exposure can evolve into acute liver failure, coagulopathy, and even death. Other differentials include bacterial lung abscess (would have presented with a more acute leukocytosis and foul sputum and potential X-ray finding), an endemic fungal infection such as histoplasmosis (Ohio-Mississippi valley exposure), and malignancy such as cavitating squamous cell carcinoma (less likely given systemic symptoms and young age).\nThe best immediate step is to stop all hepatotoxic drugs. In addition, monitor hepatic lab values such as ALT or INR until normalization before carefully re-challenging with TB pharmacologic therapy. A liver-sparing regimen while the liver recovers includes ethambutol, a fluoroquinolone such as levofloxacin, cycloserine, and an aminoglycoside such as amikacin. Renal function and hearing should be considered because aminoglycosides are nephrotoxic and ototoxic due to accumulation in renal tubular cells and cochlear hair cells. After patient stabilization, rifampin can be cautiously reintroduced with ethambutol and levofloxacin for a prolonged course of 12-18 months while permanently avoiding isoniazid. The key takeaway is that this is likely cavitary TB with isoniazid hepatitis in the setting of a slow acetylator, highlighting the importance of NAT2 genotyping, early LFT monitoring, and liver-sparing regimens to prevent irreversible hepatic injury."}
{"datasetId":"3a64443f-7438-4588-921c-ec7304f06656","query":"A 32-year-old woman with a history of deep vein thrombosis has been maintained on warfarin for 3 years with therapeutic INRs ranging 2.8–3.1. Over the past 4 months, she has developed recurrent episodes of left leg swelling, most recently 1 week ago, which improve with compression but are accompanied by persistently elevated D-dimer values of 800–1200 ng/mL FEU. She began combined oral contraceptives 7 months ago for menorrhagia, which had worsened while on warfarin. Review of prior records shows her first DVT occurred 2 weeks after warfarin initiation for atrial fibrillation, described at the time as a “paradoxical thrombosis.” She is known to be heterozygous for factor V Leiden. On exam today, temperature is 36.8°C, heart rate 84/min, blood pressure 118/72 mmHg, respiratory rate 14/min, and oxygen saturation 99% on room air. The left leg is mildly edematous with surrounding erythema and tenderness to palpation. What is the underlying explanation for her recurrent leg symptoms despite therapeutic warfarin, and what is the most appropriate management?","rubric":{"id":"warfarin-failure-clinical-evaluation","sections":[{"id":"defines-diagnosis-and-genetic-basis","title":"Defines Diagnosis and Genetic Basis","criteria":[{"id":"diagnosis-label","requirement":"States that the diagnosis is paradoxical hypercoagulability from warfarin exacerbating an underlying protein C deficiency in a heterozygous factor V Leiden patient.","weight":7},{"id":"arg506gln","requirement":"Defines factor V Leiden as the Arg506Gln substitution in factor V that confers resistance to activated protein C.","weight":6},{"id":"apc-resistance","requirement":"Indicates that activated protein C resistance does at least one of the following: {prolongs factor V cofactor activity, increases thrombosis potential even in heterozygotes}.","weight":5},{"id":"early-clot","requirement":"Specifies that a first clot occurring about 2 weeks after starting warfarin supports protein C pathway failure.","weight":5},{"id":"supportive-signs","requirement":"Lists at least 2 of {recurrent leg swelling with INR 2.8 to 3.1, D dimer 800 to 1200 ng per mL FEU, initiation of estrogen containing oral contraceptives} as supportive diagnostic features.","weight":5}]},{"id":"outlines-protein-c-pathway-and-warfarin-dynamics","title":"Outlines Protein C Pathway and Warfarin Dynamics","criteria":[{"id":"thrombomodulin","requirement":"States that thrombin bound to thrombomodulin activates protein C.","weight":6},{"id":"protein-s-complex","requirement":"States that activated protein C complexes with protein S.","weight":4},{"id":"va-inactivation","requirement":"States that activated protein C inactivates factor Va.","weight":4},{"id":"viiia-inactivation","requirement":"States that activated protein C inactivates factor VIIIa.","weight":4},{"id":"x-acceleration","requirement":"Defines that loss of this brake leaves V and VIII active longer and accelerates factor X activation which increases coagulation.","weight":6},{"id":"warfarin-kinetics","requirement":"Lists at least 2 of {protein C half life about 6 hours, factors II IX and X half life 40 to 72 hours, earliest effect is a fall in endogenous protein C and protein S} as warfarin kinetics that worsen thrombosis risk.","weight":4},{"id":"inr-normal","requirement":"States that normal INR in someone not on anticoagulation is 0.8 to 1.2.","weight":3},{"id":"vte-target","requirement":"Specifies that the usual target INR for treatment of venous thrombosis is 2.0 to 3.0.","weight":5},{"id":"therapeutic-inr","requirement":"States that a normal or therapeutic INR does not rule out thrombosis when protein C is low or factor V is resistant to activated protein C.","weight":5},{"id":"d-dimer-normal","requirement":"Specifies that normal D dimer is less than 500 ng per mL FEU.","weight":5},{"id":"pe-red-flags","requirement":"Lists at least 1 of {dyspnea, chest pain} as a red flag for pulmonary embolism.","weight":4},{"id":"aps-clues","requirement":"Lists at least 1 of {arterial events, pregnancy morbidity} as typical features of antiphospholipid syndrome on the differential.","weight":5}]},{"id":"specifies-management-and-follow-up","title":"Specifies Management and Follow Up","criteria":[{"id":"stop-estrogen","requirement":"Recommends immediate cessation of estrogen containing oral contraceptives.","weight":6},{"id":"estrogen-effects","requirement":"Lists at least 2 of {increases hepatic fibrinogen production, increases vitamin K dependent factors II VII IX X, lowers antithrombin levels} as estrogen prothrombotic effects.","weight":4},{"id":"switch-agent","requirement":"Recommends transition from warfarin to at least 1 of {therapeutic low molecular weight heparin, a direct oral anticoagulant}.","weight":3},{"id":"risk","requirement":"Indicates that long term recurrence risk is high","weight":3}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"critesays-to-raise-inr-target","requirement":"Indicates escalation of warfarin dosing to target INR above 3.5 to overcome recurrent venous thrombosis in this scenario.","weight":-15},{"id":"says-inr-excludes-pe","requirement":"Indicates that a therapeutic INR excludes pulmonary embolism and justifies deferring urgent evaluation.","weight":-15},{"id":"aps-with-steroids","requirement":"States that this presentation warrants antiphospholipid syndrome treatment with high dose glucocorticoids as primary therapy.","weight":-10},{"id":"says-give-vitamin-k-first","requirement":"States that vitamin K loading to normalize INR is indicated before imaging for suspected pulmonary embolism in a stable patient.","weight":-10}]}]},"goldenResponse":"The most likely diagnosis points to paradoxical hypercoagulability from warfarin exacerbating an underlying protein C deficiency in a patient with heterozygous factor V Leiden. Factor V Leiden is an Arg506Gln substitution in factor V that makes it resistant to inactivation by activated protein C, prolonging factor V cofactor activity and increasing thrombosis potential even in heterozygotes. Signs and symptoms that support this diagnosis are recurrent leg swelling despite INR 2.8-3.1, a first clot 2 weeks after starting warfarin, persistently high D dimer 800-1200 ng per mL FEU, and new estrogen-containing oral contraceptives.\nThrombin bound to thrombomodulin activates protein C, and activated protein C complexes with protein S to inactivate factors Va and VIIIa; loss of this brake leaves V and VIII active longer, which accelerates factor X activation and overall increases coagulation or thrombosis. Warfarin worsens this because warfarin impairs protein C production by the liver, and protein C half-life is about 6 hours versus 40-72 hours for factors II, IX, and X, so the earliest effect is a drop in endogenous anticoagulation from lack of protein C and S. Antiphospholipid syndrome is a differential to consider but would usually bring arterial events or pregnancy morbidity; malignancy associated thrombosis is possible yet there is a clear temporal link to estrogen and warfarin dynamics in this clinical vingette.\nThe best next step is to stop estrogen immediately (estrogen is prothrombotic because it stimulates hepatic production of fibrinogen and vitamin K-dependent factors (II, VII, IX, X) while lowering antithrombin levels), transition from warfarin to therapeutic low molecular weight heparin or a direct oral anticoagulant, and later reassess native protein C and S after being warfarin-free. A red flag to be aware of is the presence of dyspnea or chest pain suggesting pulmonary embolism, which would prompt immediate parenteral anticoagulation and imaging. INR is a standardized prothrombin time that reflects the activity of vitamin K-dependent factors II, VII, and X. In someone not on anticoagulation, a normal INR is 0.8 to 1.2. For treatment of venous thrombosis, the usual target INR is 2.0 to 3.0, and in certain situations use 2.5 to 3.5. An INR above 3.5 increases bleeding risk. An INR below 2.0 means inadequate anticoagulation, but a normal or even therapeutic INR does not rule out thrombosis when protein C is low or when factor V is resistant to activated protein C. D-dimer normally is less than 500 and persistent elevation signals ongoing fibrin turnover. Long-term recurrence risk is high, so indefinite anticoagulation and pregnancy counseling are appropriate. Key takeaway: recurrent VTE on therapeutic INR with early thrombosis after warfarin initiation should trigger suspicion for protein C pathway failure or potential factor V Leiden mutation, and management centers on stopping estrogen and choosing an anticoagulant that does not depress protein C."}
{"datasetId":"dfd2991f-9cc2-485c-8e66-d0d5671f33bb","query":"A 16-year-old boy with ulcerative colitis began sulfasalazine 8 weeks ago after a rapid dose escalation to 3 g daily. Soon after, he developed easy bruising and progressive fatigue when walking to class, followed by persistent fever up to 39°C last week that did not respond to acetaminophen. On admission, his temperature is 39.1°C, heart rate 112/min, blood pressure 98/64 mmHg, respiratory rate 20/min, and oxygen saturation 96% on room air. Laboratory evaluation shows pancytopenia, and bone marrow biopsy demonstrates profoundly hypocellular marrow without malignant infiltration. The gastroenterology team is considering restarting biologics for his UC flare, but this has been deferred due to severe cytopenias.\n\nLabs show the following:\n WBC 2.8 ×10³/µL\n ANC 500/µL\n Hemoglobin 7.2 g/dL\n Hematocrit 21%\n Platelets 25,000/µL\n Reticulocyte count 0.1%\n Na 138 mmol/L\n K 4.1 mmol/L\n Cl 102 mmol/L\n HCO₃ 24 mmol/L\n BUN 12 mg/dL\n Creatinine 0.8 mg/dL\n Glucose 92 mg/dL\n AST 22 U/L\n ALT 18 U/L\n Alkaline phosphatase 110 U/L\n Total bilirubin 0.7 mg/dL\n\nWhat is the underlying mechanism causing this patient’s bone marrow failure and how should it be managed while addressing his ulcerative colitis?","rubric":{"id":"sulfasalazine-aplastic-anemia-evaluation","sections":[{"id":"pathophysiology-drug-mechanism","title":"Pathophysiology & Drug Mechanism","criteria":[{"id":"split-products","requirement":"Lists at least 1 of {5-aminosalicylic acid \\[5-ASA], sulfapyridine} as sulfasalazine split products in the colon.","weight":4},{"id":"nat2-acetylation","requirement":"Specifies that sulfapyridine undergoes hepatic N-acetyltransferase 2 (NAT2) acetylation.","weight":3},{"id":"slow-acetylators","requirement":"Indicates that slow NAT2 acetylators accumulate toxic sulfapyridine intermediates.","weight":7},{"id":"progenitor-injury","requirement":"States that toxic intermediates directly injure marrow progenitors.","weight":4},{"id":"hsc-effectors","requirement":"Lists at least 1 of {autoreactive T cells, toxic drug metabolites} as effectors targeting hematopoietic stem cells.","weight":4}]},{"id":"diagnostic-standards-key-labs","title":" Diagnostic Standards & Key Labs","criteria":[{"id":"case-cytopenias","requirement":"Lists at least 3 of {ANC 500/µL, platelets 25,000/µL, hemoglobin 7.2 g/dL, reticulocyte count 0.1%} as this case’s cytopenias signaling diminshed/absent marrow response.","weight":5},{"id":"hypocellular-biopsy","requirement":"Indicates bone marrow biopsy shows a hypocellular space.","weight":6},{"id":"camitta-severe","requirement":"Specifies severe aplastic anemia by Camitta criteria as ANC < 500/µL, platelets < 20,000/µL, reticulocytes < 1%.","weight":7},{"id":"bleeding-threshold","requirement":"Specifies hemorrhage risk is particularly high when platelets fall < 10,000/µL.","weight":4},{"id":"normal-ranges","requirement":"Lists at least 2 of {ANC > 1,500/µL, platelets 150,000–450,000/µL, hemoglobin 12–16 g/dL in adolescents} as normal hematologic values.","weight":4}]},{"id":"immediate-supportive-management","title":" Immediate & Supportive Management","criteria":[{"id":"drug-withdrawal","requirement":"Recommends immediate cessation of sulfasalazine.","weight":7},{"id":"rbc-transfusion","requirement":"Specifies red cell transfusion when hemoglobin is < 7–8 g/dL.","weight":4},{"id":"platelet-transfusion","requirement":"Specifies platelet transfusion when platelets are < 10,000/µL.","weight":4},{"id":"neutropenic-precautions","requirement":"Indicates neutropenic precautions when ANC is ≤ 500/µL.","weight":4},{"id":"febrile-neutropenia","requirement":"States that persistent fever with neutropenia requires urgent broad-spectrum antibiotics.","weight":5},{"id":"cbc-monitoring","requirement":"Specifies CBC monitoring every 2–3 days early in recovery.","weight":3}]},{"id":"definitive-therapy-uc-strategy-prognosis","title":"Definitive Therapy, UC Strategy & Prognosis","criteria":[{"id":"atg-plus-cyclosporine","requirement":"Recommends immunosuppression with at least one of {antithymocyte globulin, cyclosporine.}","weight":7},{"id":"hsct-curative","requirement":"States that hematopoietic stem cell transplant is curative in eligible patients.","weight":6},{"id":"uc-pivot","requirement":"Specifies future ulcerative colitis therapy should pivot to non-myelotoxic biologics such as infliximab.","weight":3},{"id":"avoid-thiopurines","requirement":"States to avoid thiopurines due to further marrow suppression.","weight":4},{"id":"avoid-sulfa-rechallenge","requirement":"Lists at least 1 of {sulfasalazine, other sulfa drugs} as agents that must not be reintroduced due to recurrence risk.","weight":5},{"id":"short-term-threats","requirement":"Lists at least 1 of {infection, hemorrhage} as leading short-term threats to prognosis.","weight":4}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"rechallenge-sulfa","requirement":"Indicates rechallenge with sulfasalazine or other sulfa drugs to confirm causality.","weight":-15},{"id":"delay-platelets","requirement":"Says to delay platelet transfusion until platelets < 5,000/µL in this setting.","weight":-10},{"id":"marrow-hypercellular","requirement":"Says aplastic anemia shows a hypercellular marrow with increased blasts.","weight":-15},{"id":"steroids","requirement":"States corticosteroid monotherapy replaces antithymocyte globulin plus cyclosporine as definitive therapy.","weight":-10}]}]},"goldenResponse":"The most likely diagnosis for this patient is aplastic anemia due to sulfasalazine exposure. This diagnosis is supported by the triad of pancytopenia with ANC 500, platelets 25,000, hemoglobin 7.2, and a reticulocyte count of 0.1%. In addition, the finding of bone marrow biopsy showing an empty cellular space further supports this diagnosis. The pathophysiology of patients with aplastic anemia involves autoreactive T cells or toxic drug metabolites targetting hematopoietic stem cells, reducing all three main cell lines. \n\nSulfasalazine is a prodrug split in the colon into 5-ASA and sulfapyridine. Sulfapyridine undergoes hepatic NAT2 acetylation, and in slow acetylators, toxic intermediates accumulate and directly injure marrow progenitors. This explains why therapeutic dosing can still cause marrow failure. The camitta criteria defines severe aplastic anemia as an ANC below 500, platelets under 20,000, and a reticulocyte count less than 1%. In contrast, normal values include an ANC level of above 1,500 per mcL, platelets between 150,000 and 450,000/mcL, and hemoglobin of 12-16 g/dL in adolescents. Hemorrhage risk is high with significant thrombocytopenia, especially when platelets fall below 10,000/mcL. Differentials to consider include acute leukemia, although less likely because the marrow shows hypocellularity rather than elevated blasts.\n\nStop sulfasalazine immediately. Provide supportive transfusions such as when red cells reach a threshold of hemoglobin is below 7 to 8 g/dL and platelets when the count is under 10,000/mcL. It is recommended to institute neutropenic precautions once the ANC is 500/mcL or lower to reduce life-threatening infection risk. Treat any persistent fever in the setting of neutropenia as an emergency and begin broad spectrum antibiotics without delay. During early recovery, check a CBC every 2-3 days to observe for signs of improvement. For definitive therapy, consider utilizing antithymocyte globulin with cyclosporine, often adding eltrombopag to stimulate platelet production. Hematopoietic stem cell transplantation is curative for selected candidates. For ulcerative colitis control, pivot to a nonmyelotoxic biologic such as infliximab, and avoid thiopurines that further suppress the marrow. Do not re-expose the patient to sulfasalazine or other sulfa drugs because recurrence of aplastic anemia is a substantial risk. Prognosis hinges on marrow recovery, with infection and bleeding as the principal early threats. Sulfasalazine can cause severe marrow failure through toxic metabolite accumulation in susceptible individuals; management centers on drug withdrawal, careful supportive care, timely immunosuppression, and transplantation when indicated."}
{"datasetId":"3031794f-2dba-4f1c-9140-332be7bbd1e4","query":"A 70-year-old man is admitted for the third time in the past 6 months with worsening shortness of breath. His wife notes he now sleeps in a recliner and requires three pillows at night. He denies wheezing during these episodes. Each episode has been marked by crackles extending to the mid-lungs, and his BNP has consistently been between 380 and 420 pg/mL. He improves with intravenous furosemide and systemic prednisone, but symptoms recur within four weeks. His medications include empagliflozin, started 8 months ago, and metoprolol, which was increased from 25 mg to 100 mg twice daily 7 months ago. His last echocardiogram 3 years ago showed an ejection fraction of 55%. On admission, temperature is 36.8°C, heart rate 96/min, blood pressure 108/64 mmHg, respiratory rate 22/min, and oxygen saturation 90% on room air. What is the most likely diagnosis in this patient, and why has his condition repeatedly been misdiagnosed as a pulmonary etiology?","rubric":{"id":"hfpef-diagnosis-evaluation","sections":[{"id":"defines-pathophysiology","title":"Defines Pathophysiology","criteria":[{"id":"ef-range","requirement":"Defines normal left ventricular ejection fraction as 55–70 %.","weight":4},{"id":"contractility-falls","requirement":"States that in HFrEF, myocardial contractility or ejection fraction falls/ is reduced.  ","weight":7},{"id":"raas-activation","requirement":"Indicates that the sympathetic RAAS becomes inappropriately activated in HFrEF.","weight":6},{"id":"fluidleak-effects","requirement":"Lists at least 1 of {retained salt and water, pulmonary capillary leak} as downstream effects of neurohormonal activation.","weight":4},{"id":"1-suppression","requirement":"Specifies that quadrupling metoprolol acutely suppresses β1 inotropy or promotes fluid backup.","weight":5}]},{"id":"lists-clinical-features","title":"Lists Clinical Features","criteria":[{"id":"crackles-resolve","requirement":"States that mid-lung crackles go away after IV furosemide.","weight":5},{"id":"bnp-400","requirement":"Specifies BNP is 400 pg/mL with normal < 100 pg/mL, indicating ventricular stretch due to volume overload.","weight":6},{"id":"orthopneareadmits","requirement":"Lists at least 1 of {3-pillow orthopnea, readmissions every four weeks} as features of decompensated heart failure.","weight":4},{"id":"likely-edema","requirement":"Indicates that peripheral edema would likely be present even if not documented in the vignette.","weight":2},{"id":"lasix-signal","requirement":"States that recurrent “lung” crises that wane with Lasix signals an unrecognized failing heart.","weight":5}]},{"id":"specifies-diagnostics-imaging","title":"Specifies Diagnostics & Imaging","criteria":[{"id":"urgent-tte","requirement":"Recommends an urgent transthoracic echocardiogram.","weight":7},{"id":"efwma-confirm","requirement":"Lists at least 1 of {EF < 55 %, new wall-motion defect} as confirming reduced ejection fraction.","weight":6},{"id":"delay-consequence","requirement":"States that echo complacency delayed recognition of progressive systolic decline.","weight":5}]},{"id":"recommends-management","title":"Recommends Management","criteria":[{"id":"o2icu-steps","requirement":"Lists at least 1 of {oxygen therapy, ICU consideration} as immediate supportive measures.","weight":4},{"id":"blocker-taper","requirement":"Recommends cautious temporary downtitration of the β-blocker","weight":6},{"id":"maintain-sglt2","requirement":"Specifies that empagliflozin (Jardiance) should be maintained.","weight":5},{"id":"sglt2-benefits","requirement":"Lists at least 2 of {osmotic diuresis, improved myocardial energetics, lower preload, lower afterload, fewer deaths, fewer readmissions} as stated benefits of empagliflozin.","weight":4}]},{"id":"outlines-differentials-pitfalls","title":"Outlines Differentials & Pitfalls","criteria":[{"id":"against-copd","requirement":"Indicates COPD flare is less likely because the patient lacks wheezing or sputum production.","weight":5},{"id":"stop-prednisone","requirement":"Recommends discontinuing systemic prednisone to avoid further fluid retention.","weight":4},{"id":"hfpef-bnp","requirement":"Indicates that in HFpEF, BNP would likely be lower due to preserved contractility.","weight":3}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"mislabels-copd","requirement":"States COPD exacerbation is the primary diagnosis.","weight":-15},{"id":"home-oxygen-only","requirement":"States home oxygen alone is sufficient in hypoxemic decompensated heart failure without in hospital therapy.","weight":-15},{"id":"nsaid-for-pain","requirement":"Indicates NSAID therapy for analgesia in volume overloaded HFrEF.","weight":-10}]}]},"goldenResponse":"The most likely diagnosis points to newly decompensated heart failure with reduced ejection fraction (HFrEF), given the 3-pillow orthopnea, mid-lung crackles that go away after IV furosemide (Lasix), readmissions every four weeks, and a BNP of 400 pg/mL (normal < 100) indicating ventricular stretch due to volume overload. In HFrEF, contractility falls below the normal EF of 55-70 %, stroke volume decreases, and the sympathetic RAAS becomes inappropriately activated, leading to retained salt and water, driving pulmonary capillary leak and crackles. Metoprolol, quadrupled in December, acutely suppresses beta1 inotropy, further causing backup of fluid into lungs and the rest of the body; edema would also likely be present, although not indicated in this vignette. If a low output state or hypotension persists, a cautious temporary downtitration of the beta-blocker (avoiding sudden cessation), may be warranted. Empagliflozin (Jardiance) not only creates osmotic diuresis but also improves myocardial energetics and lowers preload and afterload, translating into fewer deaths and readmissions, so it should be maintained. COPD flare is less likely because the patient lacks wheezing, and steroids worsen congestion instead of improving it; systemic prednisone should therefore be discontinued to avoid further fluid retention. In addition, if the case were describing HFpEF, BNP would likely be lower due to appropriate contractility of ventricles in the preserved versus reduced ejection fraction state. Urgent transthoracic echo is essential: an EF < 55 % or new wall-motion defect confirms reduced ejection fraction. Reliance on a \"normal\" echo three years ago fostered echo complacency and delayed recognition of progressive systolic decline. Significant edema and crackles with hypoxemia warrant aggressive diuresis and oxygen therapy with consideration for placement in the ICU. A common pitfall is anchoring on \"COPD\" and skipping serial ventricular imaging. Takeaway: recurrent \"lung\" crises that wane with Lasix usually signal an unrecognized failing heart."}
{"datasetId":"b416b0e2-f63e-4071-8e02-fc4ca7a2e9e2","query":"A 72-year-old man is admitted for the fourth time in 8 months with recurrent hyponatremia. His wife reports he has become increasingly forgetful and drinks large amounts of water throughout the day. He has a history of mild hypertension treated with hydrochlorothiazide for many years and began sertraline 4 months ago for anxiety. On each admission, his serum sodium has fallen to 125–128 mmol/L, improved transiently with intravenous normal saline, and then dropped again after discharge. On this admission, his temperature is 36.9°C, heart rate 78/min, blood pressure 132/76 mmHg, respiratory rate 16/min, and oxygen saturation 98% on room air. Laboratory testing shows serum sodium of 126 mmol/L that rises to 132 mmol/L after 1 L of normal saline but falls back to 126 mmol/L the next morning. Review of prior labs shows urine sodium consistently less than 20 mmol/L. Serum osmolality and urine osmolality have not yet been obtained. What is the most likely diagnosis in this patient, and why does normal saline improve his sodium only transiently without correcting the underlying problem?","rubric":{"id":"hyponatremia-diagnosis-evaluation","sections":[{"id":"adh-physiology","title":"ADH Physiology","criteria":[{"id":"adh-triggers","requirement":"Lists at least 1 of {high serum osmolality, low effective arterial volume} as stimuli for ADH release.","weight":5},{"id":"v2-receptor","requirement":"States that ADH acts at the V2 receptor on the collecting ducts.","weight":6},{"id":"aquaporin-2","requirement":"Specifies that ADH inserts aquaporin 2 in the collecting duct.","weight":3},{"id":"siadh-persistence","requirement":"Indicates that in SIADH, ADH release persists despite low serum osmolality.","weight":4},{"id":"polydipsia-mechanism","requirement":"Defines primary polydipsia as excessive water intake that reduces ADH release.\n","weight":3}]},{"id":"sodium-diagnostics","title":"Sodium Diagnostics","criteria":[{"id":"urine-range","requirement":"Specifies normal urine osmolality as 50 to 1200 mOsm per kg.","weight":3},{"id":"siadh-osmolality","requirement":"States that SIADH produces urine osmolality greater than 100 mOsm per kg.","weight":6},{"id":"polydipsia-osmolality","requirement":"States that primary polydipsia produces urine osmolality less than 100 mOsm per kg.","weight":6},{"id":"low-urine-sodium","requirement":"Indicates that persistently less than 20 mEq per L urine sodium supports primary polydipsia in the vignette.","weight":4},{"id":"hyponatremia-cutoff","requirement":"Defines hyponatremia as serum sodium less than 136 mEq per L.","weight":3}]},{"id":"indicates-clinical-vignette-alignment","title":"Indicates Clinical Vignette Alignment","criteria":[{"id":"cognitive-effects","requirement":"Lists at least 1 of {forgetfulness, altered mental status} as cognitive changes from hyponatremia.","weight":4},{"id":"primary-diagnosis","requirement":"Indicates that the diagnosis in the vignette is primary polydipsia.","weight":5},{"id":"ns-effects","requirement":"Lists at least 2 of {normal saline provides 154 mEq sodium per liter, transiently raises serum sodium into 136 to 146 mEq per L, sodium falls again with continued excess water intake} as described effects of normal saline in this case.","weight":5},{"id":"normal-serum-range","requirement":"Specifies normal serum sodium range as 136 to 146 mEq per L.","weight":3}]},{"id":"recommends-diagnostic-approach-and-management","title":"Recommends Diagnostic Approach and Management","criteria":[{"id":"urine-osmolality-focus","requirement":"Outlines that differentiating SIADH from primary polydipsia requires assessing urine osmolality.","weight":4},{"id":"saline-band-aid","requirement":"Indicates that a normal saline bolus provides only a temporary effect because it does not address excessive water intake.","weight":4},{"id":"fluid-restriction","requirement":"Recommends restricting oral fluids to 800 to 1000 mL per day as a treatment option for primary polydipsia.","weight":6},{"id":"urine-concentration","requirement":"States that ADH concentrates urine. ","weight":3},{"id":"siadh-effects","requirement":"Lists at least 1 of {water moves from the tubule to the intravascular space, increased urine sodium concentration} as SIADH effects described.","weight":4}]},{"id":"molecular-targets","title":"Molecular Targets","criteria":[{"id":"ssris-cause-siadh","requirement":"Indicates that selective serotonin reuptake inhibitors can cause SIADH.","weight":5},{"id":"sertraline-class","requirement":"Specifies that sertraline is a selective serotonin reuptake inhibitor.","weight":4},{"id":"hctz-target","requirement":"Specifies that hydrochlorothiazide blocks the sodium chloride cotransporter in DCT.","weight":4},{"id":"hctz-site","requirement":"Indicates that the blocked sodium chloride cotransporter is in the distal convoluted tubule.","weight":3},{"id":"hctz-effects","requirement":"Lists at least 3 of {sodium loss, water loss, mild extracellular volume contraction, increased calcium reabsorption} as effects of hydrochlorothiazide.","weight":3}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"siadh-dilute-urine","requirement":"States that SIADH produces urine osmolality less than 100 mOsm per kg.","weight":-15},{"id":"encourage-free-water","requirement":"Indicates that unrestricted or increased free water intake is recommended for hyponatremia.","weight":-10},{"id":"treat-polydipsia-with-hypertonic","requirement":"Indicates that hypertonic saline is definitive therapy for primary polydipsia in this vignette.","weight":-10},{"id":"ssris-prevent-siadh","requirement":"Indicates that selective serotonin reuptake inhibitors prevent SIADH.","weight":-10}]}]},"goldenResponse":"Antidiuretic hormone (ADH) is a hormone released by the posterior pituitary gland that rises with high serum osmolality or low effective arterial volume and acts at the V2 receptor on the collecting ducts to insert aquaporin 2 in the collecting duct, concentrating urine and retaining free water. In the syndrome of inappropriate ADH (SIADH), there is a pathological cause provoking persistent ADH release, despite low serum osmolality. Thus, the urine osmolality increases more than 100 because water is moving from the nephron tubule back into the intravascular space, while sodium levels remain the same, causing increased urine sodium concentration. In contrast, primary polydipsia is seen when a patient drinks (usually water) excessively with little to no solute intake, thus decreasing the concentration of sodium in the intravascular space as well as in the nephron tubule. In addition, sertraline is part of the drug class known as serotonin reuptake inhibitors (SSRIs); they can notoriously cause SIADH in some patients. Hydrochlorothiazide (HCTZ) blocks the sodium chloride cotransporter in the distal convoluted tubule, causing sodium and water loss with mild extracellular volume contraction and increased calcium reabsorption. \nTo differentiate between primary polydipsia and SIADH, one should take a look at the urine osmolality due to the differences in pathophysiology. Normal urine osmolality ranges between 50-1200 mOsm/kg. In SIADH, the urine osmolality should be high due to ADH, causing water to move from the tubule to the intravascular space, leading to urine osmolalities usually greater than 100 mOsm/kg, and can reach even higher depending on the ADH drive. In primary polydipsia, usually the urine osmolality concentration is less than 100 mOsm/kg because the ADH mechanism is turned off as the body has \"too much\" water and does not need ADH to be released, thus increasing water content in the renal tubule and leading to lower urine osmolality. \nThe diagnosis in this vignette most likely points to primary polydipsia because the spouse reports the patient has episodes of constant water drinking, and the urine sodium is persistently below 20 mEq/L. Hyponatremia can also lead to cognitive changes such as forgetfulness or altered mental status. The hyponatremia (serum sodium <136 mEq/L) transiently improves with a bolus of normal saline but falls again, likely due to the patient continually drinking excess water. Giving the patient normal saline temporarily fixes this issue by providing 154 mEq of sodium per 1 liter of water to the patient, which increases the serum sodium concentration within a normal range (136-146 mEq/L). However, because the central problem is due to excessive water intake, the saline bolus will only provide a band-aid because it does not address the underlying pathophysiology. One treatment option is to restrict the patient's oral fluid intake to 800-1000 mL per day and observe for signs of improvement."}
{"datasetId":"b92f6999-2bb1-4317-950d-efb105b00d54","query":"A 64-year-old man with a history of bipolar disorder treated with lithium for 15 years is admitted after being found confused at home. On arrival, he is afebrile at 36.8 °C with heart rate 92/min, blood pressure 118/72 mmHg, respiratory rate 18/min, and oxygen saturation 97% on room air. Initial labs show serum sodium 108 mmol/L. He is started on 3% hypertonic saline at 100 mL/hr. Six hours later, his sodium rises to 128 mmol/L, at which point the infusion is stopped. The next morning he is unable to speak or swallow. Review of his chart reveals a longstanding baseline sodium of 125 to 130 mmol/L from chronic SIADH related to lithium use. His admission urine osmolality was >500 mOsm/kg, but this was not considered when calculating the safe rate of correction. What is the pathophysiology behind this patient’s new neurologic deficit, and how should hypertonic saline correction protocols account for chronic hyponatremia and persistent ADH activity?","rubric":{"id":"hyponatremia-ods-evaluation","sections":[{"id":"pathophysiology","title":"Pathophysiology","criteria":[{"id":"ods-mechanism","requirement":"Defines osmotic demyelination syndrome as demyelination from rapid rises in extracellular tonicity after chronic hyponatremia. ","weight":6},{"id":"brain-adaptation","requirement":"States that chronic hypo-osmolar adaptation involves extrusion of electrolytes and organic osmolytes by neurons. ","weight":5},{"id":"steps","requirement":"Lists at least 3 of {electrolyte extrusion, organic osmolyte loss, oligodendrocyte water efflux, myelin disruption} as steps in ODS pathophysiology. ","weight":5},{"id":"saidh-mechanisms","requirement":"Lists at least 2 of {V2 receptor activation, aquaporin-2 insertion, concentrated urine} as mechanisms sustaining hypotonicity in chronic SIADH. ","weight":3},{"id":"urine-osmolality-risk","requirement":"Specifies that urine osmolality > 500 mOsm/kg predicts poor free water clearance. ","weight":4},{"id":"chronic-hypotonicity","requirement":"States chronic SIADH from lithium sustained hypotonicity prior to overcorrection. ","weight":3}]},{"id":"clinical-features","title":"Clinical Features","criteria":[{"id":"rapid-overcorrection","requirement":"Defines overcorrection as sodium increase from 108 to 128 mEq/L within 6 hours on background 125-130 mEq/L chronic hyponatremia. ","weight":6},{"id":"bulbar-sign","requirement":"Indicates new bulbar dysfunction as a clinical sign consistent with central pontine myelinolysis.","weight":4},{"id":"differentials-listed","requirement":"Lists at least 1 of {stroke, lithium toxicity} as alternative diagnoses considered. ","weight":5}]},{"id":"diagnostic-tests","title":"Diagnostic Tests","criteria":[{"id":"best-next-test","requirement":"Recommends MRI brain with diffusion-weighted imaging as the best next test.","weight":6},{"id":"early-mri-caveat","requirement":"States early normal MRI within the first few weeks does not exclude the diagnosis. ","weight":4},{"id":"sodium-checks","requirement":"Specifies serum sodium checks every 2-4 hours during active correction. ","weight":5}]},{"id":"management-and-prevention","title":"Management and Prevention","criteria":[{"id":"correction-limit","requirement":"Specifies limiting sodium correction to 4-6 mEq/L per 24 hours in chronic hyponatremia. ","weight":6},{"id":"relowering-goal","requirement":"Specifies that the immediate re-lowering goal is to stabilize tonicity. ","weight":5}]},{"id":"prognosis","title":"Prognosis","criteria":[{"id":"adverse-outcomes","requirement":"Lists at least 2 of {quadriparesis, locked-in syndrome, death} as adverse outcomes associated with osmotic demyelination. ","weight":7},{"id":"tbw-pitfall","requirement":"States that relying only on total body water formulas is a pitfall because abrupt water diuresis can accelerate sodium rise beyond predictions. ","weight":5},{"id":"aquaresis-surge","requirement":"Indicates that resolution of SIADH can trigger abrupt water diuresis that drives rapid sodium increases. ","weight":4},{"id":"poor-prognosis","requirement":"States that overall prognosis after osmotic demyelination is poor. ","weight":4}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"thrombolysis","requirement":"Treats presumed stroke with thrombolysis (misdiagnosis).","weight":-10}]}]},"goldenResponse":"The most likely diagnosis points to osmotic demyelination syndrome, supported by the sodium jump from 108 to 128 within 6 hours on a background of chronic hyponatremia at 125-130, with new bulbar dysfunction consistent with central pontine myelinolysis. Other differentials to consider include brainstem stroke, though less likely because deterioration directly followed overcorrection rather than a focal vascular insult, and lithium toxicity, which usually manifests with tremor, ataxia, or GI upset at supratherapeutic levels, none of which are present here. In chronic SIADH from lithium, persistent vasopressin activity at V2 receptors drives aquaporin-2 insertion in the collecting duct, limiting free water excretion and sustaining hypotonicity. To adapt to this chronic hypo-osmolar state, brain cells undergo a fascinating phenomenon of extruding electrolytes and organic osmolytes, a process known as osmolyte extrusion, to prevent cerebral edema. This leaves the brain highly vulnerable to rapid rises in extracellular tonicity because the shrunken intracellular osmotic reserve cannot counter sudden osmotic shifts, so water rushes out of oligodendrocytes, disrupting myelin and producing demyelination. The markedly elevated urine osmolality (>500 mOsm/kg) is a key physiologic clue, as it indicates concentrated urine due to persistent ADH activity, predicting poor free water clearance and greater risk of rapid sodium swings once aquaresis occurs. \nThe best next test is an MRI brain with diffusion-weighted imaging, expected to show pontine lesions, although early normal imaging within the first few weeks does not exclude the diagnosis. Immediate bedside action is to stop correction and re-lower sodium with D5W and desmopressin, thereby stabilizing tonicity and preventing progression. A red flag here is bulbar dysfunction, which suggests imminent locked-in syndrome from brainstem demyelination. Prevention relies on limiting correction to no more than 4-6 mEq/L in 24 hours for chronic hyponatremia, as supported by current guidelines, since exceeding this threshold increases risk of osmotic demyelination. The most reliable method is a desmopressin clamp, fixing ADH activity while carefully titrating hypertonic saline to achieve predictable, slow rises in sodium. Sodium levels should be monitored every 2-4 hours during active correction to detect overcorrection early and guide adjustments in therapy. A common pitfall is calculating correction solely from total body water equations without accounting for abrupt water diuresis as SIADH resolves, which can accelerate sodium rise far beyond predictions. Prognosis after osmotic demyelination is poor, with risks of quadriparesis, locked-in syndrome, or death, underscoring why careful correction and vigilant monitoring of serum sodium and urine output are essential."}
{"datasetId":"04c9f941-60a3-4ec3-a42b-bf909014ecf8","query":"A 48-year-old man is admitted with nausea, weakness, and dizziness. On arrival, he is afebrile at 36.9 °C with heart rate 92/min, blood pressure 90/60 mmHg, respiratory rate 20/min, and oxygen saturation 97% on room air. Labs show sodium 127 mmol/L, potassium 5.3 mmol/L, glucose 68 mg/dL, and creatinine 1.0 mg/dL. He improves with intravenous fluids and is discharged on antibiotics for sinusitis. Three days later, he returns with a blood pressure 70/40 mmHg and altered mental status. Review of his history reveals that he has been taking hydrocortisone 15 mg daily for “adrenal fatigue” and fluconazole 200 mg daily, started 10 days earlier. No cortisol level or ACTH stimulation test was ever performed. His wife notes that he “always had this tan,” which she attributed to vacations. What is the most likely diagnosis in this patient, and what is the immediate management?","rubric":{"id":"adrenal-crisis-evaluation","sections":[{"id":"states-pathophysiology","title":"States Pathophysiology","criteria":[{"id":"cortisol-loss","requirement":"States chronic adrenal insufficiency causes loss of zona fasciculata cortisol production.","weight":6},{"id":"aldosterone-loss","requirement":"Specifies loss of zona glomerulosa aldosterone production in adrenal insufficiency.","weight":5},{"id":"melanocortin-rise","requirement":"Indicates cortisol deficiency removes negative feedback, increasing POMC derived melanocortins.","weight":4},{"id":"alpha-hyporeactivity","requirement":"Specifies cortisol deficiency blunts vascular alpha1 resposnes, producing hypotension refractory to fluids.","weight":3},{"id":"salt-wasting","requirement":"Indicates aldosterone loss causes renal salt wasting that leads to hypovolemia with hyponatremia.","weight":3}]},{"id":"clinical-presentation","title":"Clinical Presentation","criteria":[{"id":"hyperpigmentation-clue","requirement":"States longstanding hyperpigmentation signals chronic ACTH excess in primary adrenal insufficiency.","weight":6},{"id":"crisis-features","requirement":"Lists at least 3 of {profound hypotension, hyponatremia, altered mental status, longstanding hyperpigmentation} as findings supporting adrenal crisis.","weight":5},{"id":"precipitating-factors","requirement":"Lists at least 1 of {sinusitis infection, fluconazole interaction, insufficient stress-dose steroids} as triggers preceding crisis.","weight":4},{"id":"azole-enzymes","requirement":"Lists at least 1 of {adrenal CYP enzymes} as targets inhibited by fluconazole.","weight":3}]},{"id":"diagnostic-distinctions","title":"Diagnostic Distinctions","criteria":[{"id":"secondary-ai-pigment","requirement":"States secondary adrenal insufficiency shows no hyperpigmentation because ACTH is low.","weight":3},{"id":"sepsis-mismatch","requirement":"Indicates septic shock does not explain chronic hyperpigmentation in this patient.","weight":5},{"id":"sepsis-vitals","requirement":"Specifies absence of tachycardia and fever argues against septic shock.","weight":4},{"id":"differential-shock","requirement":"Includes consideration of cardiogenic, obstructive, or distributive shock in differential.","weight":4}]},{"id":"recommends-immediate-emergency-management","title":"Recommends Immediate Emergency Management","criteria":[{"id":"hydrocortisone-bolus","requirement":"Recommends hydrocortisone 100 mg IV immediately in suspected adrenal crisis.","weight":6},{"id":"post-bolus-schedule","requirement":"Lists at least 1 of {200 mg over 24 hours continuous infusion, 50 mg IV every 6 hours} as acceptable post bolus hydrocortisone dosing.","weight":5},{"id":"fluids","requirement":"Recommends IV fluids","weight":4},{"id":"hypoglycemia-protocol","requirement":"Lists at least 1 of {give 25 g IV dextrose, give oral glucose-containing food} when glucose is less than 70 mg per dL.","weight":3},{"id":"treat-before","requirement":"Indicates steroids are given before diagnostic confirmation when adrenal crisis is suspected.","weight":3}]},{"id":"management","title":"Management","criteria":[{"id":"icu-admission","requirement":"Recommends ICU admission to manage hemodynamic instability during adrenal crisis.","weight":6},{"id":"stop-fluconazole","requirement":"Specifies discontinuing fluconazole during adrenal crisis.","weight":2},{"id":"taper","requirement":"Specifies tapering to physiologic hydrocortisone when daily dose is reduced below mineralocorticoid equivalence.","weight":4},{"id":"add-fludrocortisone","requirement":"Indicates adding fludrocortisone when daily hydrocortisone is reduced below mineralocorticoid equivalence.","weight":4}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"delay-steroids","requirement":"States therapy should wait for lab confirmation before giving hydrocortisone.","weight":-20},{"id":"low-dose-steroid","requirement":"Indicates hydrocortisone 10 mg IV is adequate for adrenal crisis.","weight":-15},{"id":"fluconazole","requirement":"States that fluconazole should be continued during adrenal crisis.","weight":-2},{"id":"thyroid-first","requirement":"Recommends starting thyroid hormone for presumed myxedema coma.","weight":-10}]}]},"goldenResponse":"Acute adrenal crisis in the setting of primary adrenal insufficiency (Addison's disease) is most likely here, given profound hypotension, hyponatremia, altered mentation after sinusitis insult, and longstanding hyperpigmentation, which suggests chronic ACTH excess. Addison's disease is characterized by the autoimmune destruction of the adrenal cortex causing loss of zona fasciculata cortisol, zona glomerulosa aldosterone, and often zona reticularis androgens (gonadal androgen production intact): cortisol deficiency removes negative feedback to pituitary and hypothalamus, so POMC derived melanocortins rise and darken skin, and also blunts vascular alpha1 responses, so despite fluids the patient remains hypotensive. In addition, aldosterone loss causes renal salt wasting that leads to hypovolemia with hyponatremia.; adrenal androgens are clinically minor in men but contribute to fatigue in women.\nFluconazole can exacerbate a crisis because azole antifungals inhibit adrenal CYP enzymes (notably 11beta hydroxylase and 17alpha hydroxylase), and he failed to stress dose above 15 mg hydrocortisone during his infection, which together tipped him into adrenal crisis. Other diagnoses to consider are septic shock (but does not explain the \"always tan\" clue, nor does he exhibit tachycardia or fever), myxedema coma (typically bradycardic and hypothermic), and secondary adrenal insufficiency (no hyperpigmentation because ACTH is low).\nManagement of this patient's condition involves avoiding delay in therapy due to the severity of adrenal crisis. Give hydrocortisone 100 mg IV immediately followed by 200 mg over 24 hours as a continuous infusion or 50 mg IV every 6 hours. Begin aggressive normal saline for fluid resuscitation. Check glucose at the bedside, and for values less than 70 mg per dL give 25 g IV dextrose with reassessment every 15 to 30 minutes until stable. Obtain an ECG and follow potassium; for potassium 6.0 mmol per L or higher or any ECG changes, consider 1 g IV calcium gluconate over 5 to 10 minutes to lower hyperkalemia. Stop fluconazole, treat any suspected infection, and admit to ICU to address hemodynamic instability. Once stable, taper to physiologic hydrocortisone and add fludrocortisone when the daily hydrocortisone dose is reduced below mineralocorticoid equivalence. Key takeaway: in shock with hyponatremia and hyperpigmentation, presume adrenal crisis, give steroids first, and confirm afterward."}
{"datasetId":"74dbce10-c4e6-44f4-ad73-7df988e8ee4e","query":"28-year-old man keeps getting admitted with breakthrough alcohol withdrawal. Initial presentation: tremulous, HR 118, BP 158/94, temp 37.4°C. Started on haloperidol 2mg IV q6h with ondansetron 4mg IV q8h; Mg²⁺ 1.6 mg/dL despite replacement. QTc prolonged from 430 to 520 ms over 36 hours, culminating in polymorphic VT requiring defibrillation. Transferred to MICU where haloperidol was continued at same dose. Three days later, repeated episodes of torsades despite magnesium 2.1, K 4.2. Genetic testing shows CYP2D6 *4/*4 poor metabolizer. Patient works construction, lives in sober house after 3 prior detox admissions this year. Each previous withdrawal managed with benzodiazepines alone without cardiac events. Given the enzyme null variant and combined IKr blockade, what explains the threshold interaction between electrolyte replacement failure and active metabolite accumulation, and how should this guide antipsychotic selection for future withdrawal episodes?","rubric":{"id":"qt-prolongation-analysis","sections":[{"id":"threshold-mechanism","title":"QT Prolongation Threshold Mechanism","criteria":[{"id":"explains-cyp2d6-impact","weight":12,"requirement":"States CYP2D6 *4/*4 causes poor metabolism and drug accumulation"},{"id":"identifies-ikr-blockade","weight":10,"requirement":"Identifies haloperidol as IKr/hERG channel blocker"},{"id":"explains-electrolyte-interaction","weight":10,"requirement":"Mentions that hypomagnesemia/hypokalemia risks cardiac arrhythmia "},{"id":"includes-alcohol-electrolyte-link","weight":8,"requirement":"Explicitly states chronic alcohol use causes magnesium deficiency"},{"id":"explains-synergistic-effect","weight":8,"requirement":"Describes threshold interaction: drug accumulation + electrolyte depletion"}]},{"id":"drug-interactions","title":"Drug Interaction Analysis","criteria":[{"id":"mentions-ondansetron-qt","weight":6,"requirement":"Clearly identifies ondansetron as additional QT-prolonging agent"},{"id":"explains-drug-accumulation","weight":8,"requirement":"Explains continued haloperidol caused persistent elevated levels"},{"id":"mentions-combined-effect","weight":5,"requirement":"Describes synergistic effect of haloperidol + ondansetron accumulation"}]},{"id":"future-management","title":"Future Withdrawal Management","criteria":[{"id":"states-benzos-first-line","weight":15,"requirement":"Explicitly states benzodiazepines are first-line for alcohol withdrawal"},{"id":"recommends-haloperidol-avoidance","weight":12,"requirement":"Recommends avoiding haloperidol specifically"},{"id":"suggests-alternative-antipsychotics","weight":8,"requirement":"Suggests specific alternative antipsychotics with lower QT risk"}]},{"id":"clinical-accuracy","title":"Clinical Accuracy","criteria":[{"id":"correct-drug-order","weight":-20,"requirement":"Does not list antipsychotics before stating benzos are first-line"},{"id":"avoids-ondansetron-recommendation","weight":-8,"requirement":"Avoids recommending ondansetron in future episodes"}]}]},"goldenResponse":"Haloperidol is metabolized by CYP2D6, and so patients with poor metabolizing genotypes such as \\*4/\\*4 accumulate the drug and risk having supratherapeutic levels. The anti-psychotic is a known QT-prolongater by blocking delayed rectifier potassium current in the heart, and this patient's QTc over 500 greatly increased the risk of polymorphic VT (torsades de pointes). Odansetron is another drug that can precipitate torsades, but it is metabolized by other CYP enzymes and likely is not affected by this genetic variant. Chronic alcohol use furthermore risks electrolyte abnormalities, including hypomagnesemia and hypokalemia, which  potentiate arrhythmogenic risk by diminishing electrolyte necessary for maintaining cardiac currents - the combination of electrolyte imbalance and medication greatly increased the risk for torsades, even with eventual supplementation.\n\nThis patient should have all offending drugs such as haloperidol and odansetron stopped. Haloperidol + ondansetron accumulation have synergistic effects together. Chronic alcohol use causes magnesium deficiency as well. \n\nFor future withdrawal episodes, the primary medication for symptoms should be benzodiazepines (ie. Libirum), titrated based off of CIWA scores. Use of antipsychotics should be considered only as a last resort due to the side effect profile discussed, with alternatives such as quetiapine having less risk for QT-prolongation."}
{"datasetId":"51178aae-bfdd-4459-ac16-c00a52933193","query":"You're consulted on a 35-year-old woman with acute hepatic encephalopathy 7 days after adding rifampin 600mg daily to tacrolimus 8mg BID post-liver transplant. Tacrolimus trough rose from 9 to 38 ng/mL over this week. She presents with confusion and asterixis despite lactulose. Vitals: temp 37.1°C, HR 94, BP 112/68, RR 22, SpO2 96% RA. Labs: ammonia 142 µmol/L, ALT 89, AST 76, ALP 220, bilirubin 3.2 mg/dL, INR 1.4, Cr 0.8. Previous admission 2 months prior for similar symptoms after TMP-SMX was added, resolved with drug discontinuation. Biopsy shows canalicular cholestasis without rejection. Given the temporal relationship and pattern of neurotoxicity occurring specifically with dual OATP1B1/CYP3A5 inhibition, what explains the disproportionate CNS effects relative to the modest transaminitis, and how should tacrolimus levels be managed while addressing the encephalopathy?","rubric":{"id":"tacrolimus-neurotoxicity-evaluation","sections":[{"id":"baseline-disposition","title":"Defines Baseline Tacrolimus Disposition","criteria":[{"id":"hepatic-uptake","weight":5,"requirement":"Defines that tacrolimus first enters hepatocytes via organic anion transporting polypeptide OATP1B1 or OATP1B3 before metabolism"},{"id":"cyp3a-metabolism","weight":4,"requirement":"States that tacrolimus undergoes metabolism by at least one of the following: {cytochrome P450 3A4, 3A5 enzymes}"},{"id":"reservoirs","weight":3,"requirement":"Lists at least 1 of {plasma protein binding, red blood cell binding} as tacrolimus reservoirs that keep the unbound fraction small"},{"id":"unbound-bbb","weight":3,"requirement":"Indicates that only the unbound tacrolimus fraction crosses the blood-brain barrier"},{"id":"unbound-clearance","weight":3,"requirement":"Specifies that the unbound fraction determines how efficiently the liver clears tacrolimus"}]},{"id":"immediate-transporter-effect","title":"Indicates Rifampin's Immediate Transporter Effect","criteria":[{"id":"early-oatp-block","weight":7,"requirement":"States that rifampin's first effect occurs within hours as competitive inhibition of OATP-mediated hepatic uptake"},{"id":"plasma-rise","weight":5,"requirement":"Indicates that blocked hepatocyte uptake causes a sharp rise in plasma tacrolimus concentrations"},{"id":"free-fraction-increase","weight":4,"requirement":"Specifies that rifampin's transporter inhibition increases the circulating unbound tacrolimus fraction"},{"id":"bbb-penetration","weight":3,"requirement":"Indicates that a higher unbound fraction disproportionately enhances tacrolimus penetration across the blood-brain barrier"},{"id":"immediate-consequences","weight":3,"requirement":"Lists at least 2 of {plasma levels rise, free fraction increases, BBB penetration increases, hepatic clearance declines} as immediate consequences of OATP inhibition"}]},{"id":"delayed-enzyme-induction","title":"Defines Rifampin's Delayed Enzyme Induction and CNS Depot","criteria":[{"id":"induction-timeline","weight":7,"requirement":"Defines that CYP3A induction appears at 5-7 days with full effect at 1-2 weeks"},{"id":"transcription-factors","weight":4,"requirement":"Indicates that rifampin induces CYP3A via activation of nuclear transcription factors"},{"id":"early-toxicity","weight":3,"requirement":"States that neurotoxicity can emerge within the first week before induction increases clearance"},{"id":"cns-accumulation","weight":5,"requirement":"Indicates that tacrolimus accumulates in brain tissue and redistributes out slowly"},{"id":"timeline-anchors","weight":3,"requirement":"Lists at least 2 of {hours for transporter inhibition, 5-7 days for induction onset, 1-2 weeks for full induction} as the time sequence of rifampin effects"}]},{"id":"clinical-correlates","title":"Specifies Clinical and Laboratory Correlates","criteria":[{"id":"toxicity-over-failure","weight":5,"requirement":"States that the pattern favors tacrolimus neurotoxicity rather than primary hepatic failure"},{"id":"preserved-synthesis","weight":5,"requirement":"Specifies that at least one of the following: {near-normal INR, albumin} indicate preserved hepatic production capacity"},{"id":"mild-cholestasis","weight":3,"requirement":"Indicates that only mild cholestasis is present"},{"id":"trough-spike","weight":3,"requirement":"Specifies that tacrolimus troughs can spike from 9 to 38 ng/mL within the first week"},{"id":"supportive-features","weight":3,"requirement":"Lists at least 2 of {encephalopathy, asterixis, symptom onset within first week, trough spike 9-38 ng/mL, mild cholestasis, near-normal INR, near-normal albumin} as features supporting tacrolimus neurotoxicity"}]},{"id":"management-recommendations","title":"Recommends Management and Monitoring","criteria":[{"id":"hold-tacrolimus","weight":7,"requirement":"Recommends holding tacrolimus until trough <10 ng/mL while neurologic symptoms improve"},{"id":"stop-rifampin","weight":5,"requirement":"Indicates discontinuation of rifampin due to major calcineurin inhibitor interaction risk"},{"id":"alternative-antibiotic","weight":4,"requirement":"Specifies replacing rifampin with an alternative antibiotic"},{"id":"reduced-reinitiation","weight":4,"requirement":"Recommends restarting tacrolimus at a reduced dose after improvement"},{"id":"bridging-options","weight":3,"requirement":"Lists at least 1 of {mycophenolate, low-dose steroids} as acceptable bridging while tacrolimus is held"},{"id":"frequent-troughs","weight":3,"requirement":"Specifies daily or near-daily tacrolimus trough monitoring during dose adjustment"}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"immediate-induction-claim","weight":-15,"requirement":"States that rifampin immediately induces CYP3A on day 1"},{"id":"continue-rifampin","weight":-15,"requirement":"Indicates continuing rifampin despite tacrolimus neurotoxicity"},{"id":"dose-escalation","weight":-10,"requirement":"Recommends increasing tacrolimus dosing to counter rifampin while encephalopathy is present"},{"id":"mislabels-etiology","weight":-10,"requirement":"Says primary hepatic failure explains encephalopathy in this vignette"}]}]},"goldenResponse":"This patient's acute encephalopathy is best explained by tacrolimus neurotoxicity triggered by rifampin's unusual time-dependent effects on hepatic uptake and metabolism of tacrolimus. Under normal physiology, tacrolimus is cleared by first entering hepatocytes through organic anion transporting polypeptide (OATP1B1/1B3) carriers, then undergoing metabolism by cytochrome P450 3A4/5 enzymes. Tacrolimus is largely bound to proteins and red blood cells, so only a small amount remains free in the blood. This unbound fraction is what crosses the blood-brain barrier and also determines how efficiently the liver can clear the drug. When rifampin is taken, the first effect appears within hours as competitive inhibition of the OATP transporter protein. Hepatocytes cannot uptake tacrolimus, so plasma levels rise sharply, and more importantly, the circulating free fraction increases, which disproportionately enhances tacrolimus penetration across the blood-brain barrier. This explains why neurotoxicity can emerge within the first week, with troughs spiking from 9 to 38 ng/mL despite only mild liver injury. \nThe second effect of rifampin, induction of CYP3A enzymes via activation of nuclear transcription factors, a process that can take 5-7 days to appear, with full effect at 1-2 weeks. By the time delayed CYP induction starts to accelerate clearance, the patient has already accumulated high levels of tacrolimus in brain tissue, and this redistribution out of the CNS occurs slowly, so neurologic symptoms can persist even as serum levels begin to decline. This sequence explains why the patient developed encephalopathy and asterixis despite only mild cholestasis, with near-normal INR and albumin indicating preserved liver production capacity, which points to drug toxicity rather than primary hepatic failure. \nAccording to the American Society of Transplantation and the American Association for the Study of Liver Diseases, the next step is to hold tacrolimus until troughs fall below 10 ng/mL and neurologic symptoms improve, then restart at a reduced dose with daily or near-daily trough monitoring. Rifampin should be discontinued and replaced with an alternative antibiotic, since both AST and Infectious Diseases Society of America guidelines note its major calcineurin inhibitor interaction risk as exemplified in this case. Supportive therapy with lactulose can continue for ammonia control, but the primary driver is tacrolimus accumulation, not hepatic detoxification failure. If immunosuppression must be maintained during the hold, bridging with mycophenolate or low-dose steroids is appropriate in coordination with the transplant team. This careful adjustment balances the need for graft protection with the immediate priority of reversing neurotoxicity caused by the time-dependent \"double hit\" of rifampin on tacrolimus disposition.\n"}
{"datasetId":"95c0af6e-2968-4fd3-b26d-d50d9870717d","query":"You're asked to see a 34-year-old woman at 28 weeks gestation for her third admission this pregnancy. She works as a night-shift ICU nurse and has had escalating hypertension over 6 weeks despite labetalol 200mg BID and nifedipine XL 60mg daily. Current presentation: BP 168/104, platelets 88,000/μL, AST 112 IU/L, LDH 450 U/L, proteinuria 3.4g/24h. Fetal ultrasound shows IUGR <5th percentile with reversed end-diastolic flow. First admission at 22 weeks was for \"labile hypertension\" with BPs 140s-150s/90s attributed to work stress. Second admission at 25 weeks had platelets 95,000/μL, AST 89, creatinine 0.8 - discharged on increased labetalol with \"preeclampsia labs trending wrong direction.\" Between admissions, she missed OB appointments due to rotating shifts and childcare issues. Given the progressive thrombocytopenia, rising transaminases, and worsening fetal status despite maximal antihypertensives, what distinguishes evolving HELLP from severe preeclampsia with hepatic involvement, and how does this affect timing of delivery?","rubric":{"id":"hellp-preeclampsia-distinction","sections":[{"id":"diagnostic-criteria","title":"Diagnostic Accuracy","criteria":[{"id":"identifies-severe-preeclampsia-criteria","weight":8,"requirement":"States patient meets severe preeclampsia criteria"},{"id":"identifies-hellp-components","weight":6,"requirement":"Lists 3 HELLP components (Hemolysis, Elevated LFTs, Low Platelets)"},{"id":"recognizes-evolving-hellp","weight":6,"requirement":"Notes \"evolving HELLP\" status due to LDH 450 <600 U/L"},{"id":"platelet-threshold","weight":5,"requirement":"States platelets <100,000/μL meets HELLP platelet criterion"},{"id":"transaminase-threshold","weight":5,"requirement":"States AST >2× ULN meets LFT elevation criterion"},{"id":"distinguishes-spectrum","weight":10,"requirement":"States both diagnoses are spectrum disorders with similar management"},{"id":"incorrect-full-hellp-claim","weight":-20,"requirement":"Claims patient meets full HELLP criteria"}]},{"id":"delivery-timing","title":"Delivery Decision","criteria":[{"id":"immediate-delivery-indicated","weight":10,"requirement":"States immediate delivery is indicated given current status"},{"id":"fetal-indications","weight":6,"requirement":"Lists fetal criteria (reversed end-diastolic flow) as an indication for cesarean delivery"},{"id":"management-similarity","weight":8,"requirement":"States management identical regardless of diagnostic distinction"},{"id":"timing-difference-explained","weight":8,"requirement":"Explains difference exists only <34 weeks if no maternal or fetal compromise"}]},{"id":"pre-delivery-management","title":"Pre-Delivery Management","criteria":[{"id":"antihypertensive-specific","weight":6,"requirement":"Recommends IV labetalol or IV hydralazine for BP control"},{"id":"magnesium-prophylaxis","weight":6,"requirement":"States magnesium sulfate for eclampsia prophylaxis"},{"id":"betamethasone-qualified","weight":5,"requirement":"Mentions betamethasone only if won't delay delivery"},{"id":"cesarean-plan","weight":4,"requirement":"States cesarean preferred given fetal decompensation (reversed end-diastolic flow)"}]}]},"goldenResponse":"Our patient meets criteria for both evolving HELLP and severe preeclampsia with hepatic involvement, as evidenced by severe HTN (>160/>110) measured on 2 separate occasions atleast 4 hours apart, elevated liver enzymes (AST is >2x upper limit of normal), low platelets <100,000, and almost meets criteria for hemolysis (doesn't quite meet ACOG guidelines of LDH>600, which is why we call it \"evolving\" HELLP and not full blown HELLP). These two pathologies are on the same spectrum of disease and as such are treated very similarly. For the purposes of our patient, this presentation necessitates immediate delivery (cesarean due to fetal decompensation) after stabilization. While arranging delivery start her on IV hydralazine or IV labetalol (if heart rate permits) for acute BP control. Also, administer magnesium sulfate and, if it will not delay delivery, betamethasone. \nThe only difference in delivery timing in these 2 pathologies, which doesn't apply to our patient, is for patients at less than 34 weeks gestation without signs of material or fetal compromise, where HELLP indicates delivery within 24 hours to give time for steroid administration, but in severe preeclampsia w/ hepatic involvement you have the option to expectantly manage in a tertiary center to gain time to 34 w (or lung maturity), with intensive maternal/fetal monitoring and delivery if any deterioration."}
{"datasetId":"c909a9c5-6d00-4be1-a4f8-96357b899e42","query":"This 29-year-old woman with ulcerative colitis has been on infliximab 5mg/kg every 8 weeks for 18 months. Initially achieved Mayo 0 remission for 8 months, then developed bloody diarrhea 6-8 times daily. Dose intensified to every 6 weeks 6 months ago with improvement to Mayo 1. Presented yesterday with 8-10 bloody stools daily, CRP 45 mg/L, calprotectin 1800 μg/g. Afebrile, hemodynamically stable. Infliximab trough <1 μg/mL, antibodies detected. Colonoscopy shows Mayo 3 disease to hepatic flexure. TPMT normal. Started adalimumab 160mg loading 2 weeks ago with no improvement. Previous vedolizumab trial failed due to primary non-response. What explains the persistent severe activity despite switching anti-TNF agents, and what should guide the next therapeutic choice given her immunogenicity profile and drug levels?","rubric":{"id":"uc-anti-tnf-failure-evaluation","sections":[{"id":"mechanism-explanation","title":"Mechanism of Anti-TNF Failure","criteria":[{"id":"explains-immunogenicity-link","weight":10,"requirement":"Explicitly links infliximab ADA to potential adalimumab failure"},{"id":"explains-inflammatory-burden","weight":6,"requirement":"Mentions high TNF-α load as factor reducing anti-TNF efficacy"},{"id":"mentions-insufficient-duration","weight":4,"requirement":"States 2 weeks may be insufficient for adalimumab response"},{"id":"explains-pharmacokinetics","weight":5,"requirement":"Explains subtherapeutic drug levels due to ADA or rapid clearance"}]},{"id":"therapeutic-decision-logic","title":"Therapeutic Decision Framework","criteria":[{"id":"tdm-guidance-stated","weight":12,"requirement":"Explicitly states TDM (adalimumab levels + ADA) should guide decision"},{"id":"considers-vedolizumab-failure","weight":4,"requirement":"Acknowledges vedolizumab primary non-response affects next choice"},{"id":"low-titers-ada-negative","requirement":"States that if adalimumab titers are low and ADA is negative, can increase dose and add a thiopurine or low-dose MTX to decrease immunogenicity","weight":3},{"id":"low-titers-ada-positive","requirement":"States that if adalimumab titers are low and ADA is positive, switch to a non-TNF inhibiting class agent","weight":3},{"id":"adequate-titers-ada-negative","requirement":"States that if adalimumab titers are adequate and ADA is negative, switch to a non-TNF inhibiting class agent","weight":3}]},{"id":"specific-recommendations","title":"Treatment Recommendations","criteria":[{"id":"recommends-ustekinumab","weight":8,"requirement":"Specifically recommends ustekinumab or IL-12 inhibitor or IL-23 inhibitor as next option"},{"id":"recommends-jak-inhibitor","weight":8,"requirement":"Specifically recommends tofacitinib or other JAK inhibitor as next option"},{"id":"considers-contraindications","weight":3,"requirement":"Mentions need to check TB/hepatitis for JAK inhibitors"}]}]},"goldenResponse":"Persistent severe immune activity:\nThe infliximab failed due to an immunogenic and pharmacokinetic failure, as supported by low IFX trough (\\<1 ug/mL) as well as +anti-IFX antibodies. Since she was successfully on the drug previously with good results, the drug likely still works, but is getting metabolized and cleared too quickly to work. Additionally, severe colitis causes increased Infliximab (and other monocloan antibody) clearance through high CRP levels, low albumin, and large areas of inflammation which act as a TNF \"sink\".\nThere are a couple of reasons why the new anti-TNF drug isn't showing the results we want. Anti-infliximab antibodies strongly predict development of antibodies to our second agent; this is a patient-specific propensity to immunogenicity, likely associated with her underlying autoimmune disorder. Additionally, adalimumab takes several weeks to months before effects start to show - this course is likely too short to tell if it is working effectively.\nNext therapeutic choice:\nBased on patient presentation, we have several choices in where to go from here. We can check serum adalimumab levels to see if the drug is being attacked by the immune system or if the levels are high and it just hasn't \"kicked in\" yet. We can also measure presence of anti-drug-antibodies (ADA) to guide our next steps.\nIf adalimumab trough is low and ADA negative: under-exposure, increase dose and add a thiopurine or low-dose MTX to suppress immunogenicity and raise trough levels.\nIf adalimumab trough is low and ADA+ : this is the same mechanism which led to failure of infliximab, switch to another class of drug (not anti-TNF).\nIf adalimumab trough is at therapeutic levels (7.5-10 ug/mL) and no ADA: the drug simply isn't working, switch to another class of drug\nOther drug options (not anti-TNF)\nBased on Mayo 3 disease, high CRP, nonresponse to vedolizumab, immunogenic phenotype, we could start the patient on a JAK inhibitor such as upadacitinib (not subject to ADA, works relatively quickly). We could also try an IL-12 or IL-23 inhibitor (e.g. ustekinumab, mirikizumab, risankizumab). These have low chance of ADA production but onset is slower than JAK inhibitors - attempt this class if patient has contraindications to JAK inhibitors (e.g. VTE risk, screen for TB/viral hepatitis; although patient was likely already screened if they were on a TNF inhibitor previously)."}
{"datasetId":"3fd49b1a-8b76-43fe-979e-07b42c22af4c","query":"You're asked to see a 52-year-old woman with rheumatoid arthritis who's had three ED visits in 2 months. She presents with bilateral leg pain and weakness for 3 days. History reveals she's on methotrexate 25mg weekly and prednisone 10mg daily. Labs show CK 12,000 U/L, AST 180 U/L, creatinine 2.1 mg/dL (baseline 0.8), urine dipstick 3+ blood with no RBCs. She completed a clarithromycin course for sinusitis 10 days ago. Methotrexate level is 0.8 μM (high). Vitals: temp 37.1°C, HR 88, BP 128/74, RR 20, SpO2 97% RA. Previous visits were for similar leg pain attributed to RA flare, treated with increased prednisone. She denies new medications or recent exercise. What explains the combination of severe myopathy, acute kidney injury, and elevated methotrexate level in this patient?","rubric":{"id":"clarithromycin-methotrexate-toxicity-analysis","sections":[{"id":"causal-mechanism-identification","title":"Primary Causal Mechanism Identification","criteria":[{"id":"identifies-clarithromycin-rhabdomyolysis","weight":15,"requirement":"States clarithromycin causes rhabdomyolysis as primary mechanism"},{"id":"explains-mitochondrial-damage","weight":12,"requirement":"Explains clarithromycin causes mitochondrial damage leading to myotoxicity"},{"id":"correct-sequencing","weight":10,"requirement":"States rhabdomyolysis → AKI → methotrexate accumulation sequence"}]},{"id":"drug-interaction-mechanisms","title":"Methotrexate Accumulation Mechanisms","criteria":[{"id":"mentions-oat-transporters","weight":10,"requirement":"Mentions OAT1/OAT3 or MRP2/MRP4 or BCRP transporter inhibition by clarithromycin"},{"id":"mentions-p-gp-inhibition","weight":8,"requirement":"Mentions clarithromycin's P-glycoprotein inhibition leading to MTX accumulation"},{"id":"explains-renal-clearance-reduction","weight":8,"requirement":"States clarithromycin reduces renal MTX clearance via transporter inhibition"}]},{"id":"pathophysiology-explanation","title":"Pathophysiology of Clinical Findings","criteria":[{"id":"explains-pigment-nephropathy","weight":12,"requirement":"Explains myoglobin release from rhabdomyolysis causes pigment nephropathy"}]},{"id":"factual-accuracy","title":"Factual Accuracy","criteria":[{"id":"incorrect-causal-attribution","weight":-25,"requirement":"Incorrectly attributes rhabdomyolysis primarily to methotrexate toxicity"},{"id":"incorrect-enzyme-claim","weight":-15,"requirement":"Incorrectly states CYP3A4 inhibition causes MTX accumulation"}]}]},"goldenResponse":"Clinical picture:\n\n* Macrolides have a known rare side effect of causing Rhabdomyolysis. This is classically associated with Azithromycin and Erythromycin, but rarely case reports identify the same presentation with Clarithromycin. This can be through 2 mechanisms, monotherapy can induce rhabdo by causing direct mitochondrial damage leading to myotoxicity. The other mechanism is that Clarithromycin is a potent CYP3A4 inhibitor - this enzyme is one of many that metabolize drugs for excretion, though this list of drugs does not include MTX. In rhabdo, muscle necrosis releases myoglobin and purines into the blood which, when it reaches the kidneys, causes tubular damage (pigment nephropathy) culminating as AKI. Since methotrexate is renally excreted, AKI results in reduced excretion and buildup of MTX to toxic levels in the blood.\n* Another component to the MTX toxicity is that Clarithromycin directly interacts with and inhibits the main renal tubular transporters which are responsible for MTX clearance. The most important transporters on the basolateral membrane for MTX clearance are OAT1/OAT3, and the ones on the apical membrane are MRP2/MRP4 and BCRP. Clarithromycin inhibits and competes with MTX at these transporters, reducing excretion.\n* Additionally, Clarithromycin is a P-gp inhibitor. Normally P-gp is a broad efflux pump found throughout the body which pumps many different kinds of medicines out of cells, including MTX. This adds another point of accumulation for MTX toxicity.\n* To summarize, this patient's clinical picture is most consistent with clarithromycin-associated rhabdomyolysis which led to pigment nephropathy. When we also consider clarithromycin's inhibition of MTX metabolism and renal excretion, this produces the triad of severe myopathy, AKI, and high MTX present in our patient."}
{"datasetId":"7bff3110-7229-4893-bb97-479ceb85125c","query":"A 34-year-old woman with ulcerative colitis on vedolizumab since diagnosis 18 months ago presents with her third C. difficile infection in 4 months. Each episode began 7-10 days after completing fidaxomicin 200mg BID for 10 days. Episodes present identically: 6-8 watery stools daily, cramping, no fever. First infection occurred after augmentin for sinusitis. Second and third episodes had no antibiotic exposure. She works as a preschool teacher where three children had confirmed C. diff. Vitals stable, temp 37.1°C, HR 88. Labs show WBC 12.8, creatinine 0.7, albumin 3.1, CRP 8.2. Stool toxin PCR positive, toxins A/B negative. Colonoscopy 2 weeks ago showed mild pancolitis. Fecal transplant referral made but delayed due to insurance. Vedolizumab continued per GI. Given the pattern of recurrence exactly 7-10 days post-fidaxomicin with ongoing vedolizumab, what explains treatment failure and what timing strategy should guide transplant referral?","rubric":{"id":"c-diff-recurrent-evaluation","sections":[{"id":"treatment-failure-explanation","title":"Explanation of Treatment Failure","criteria":[{"id":"identifies-spore-germination","weight":12,"requirement":"States C. diff spores germinate 7-10 days post-treatment which causes recurrence of symptoms"},{"id":"identifies-inadequate-antibiotic-duration","weight":10,"requirement":"States 10-day fidaxomicin course is insufficient for recurrent CDI"},{"id":"identifies-ibd-risk-factor","weight":8,"requirement":"Mentions IBD as risk factor via mucosal immunity impairment"},{"id":"identifies-vedolizumab-impact","weight":8,"requirement":"Addresses vedolizumab role in impaired immune clearance"},{"id":"identifies-exogenous-exposure","weight":6,"requirement":"Mentions preschool teacher role with exposure to C. diff infected children as ongoing spore source"},{"id":"explains-antibiotic-limitation","weight":8,"requirement":"States antibiotics treat active infection but do not fix underlying dysbiosis"}]},{"id":"alternative-treatment-options","title":"Alternative Treatment Recommendations","criteria":[{"id":"suggests-extended-fidaxomicin","weight":10,"requirement":"Recommends extended-pulsed fidaxomicin regimen \nOR Recommends vancomycin taper or pulsed regimen \nOR Suggests bezlotoxumab as adjunct therapy option"}]},{"id":"fmt-timing-strategy","title":"FMT Timing Strategy","criteria":[{"id":"identifies-vulnerable-window","weight":10,"requirement":"States FMT should occur 24-48 hours after antibiotic completion"},{"id":"addresses-high-risk-criteria","weight":6,"requirement":"Cites ≥2 recurrences as indication for immediate FMT"},{"id":"recommends-fmt-referral","weight":8,"requirement":"Recommends patient be referred for FMT evaluation given ≥3 recurrences"}]},{"id":"comprehensive-presentation","title":"Comprehensive Case Analysis","criteria":[{"id":"considers-multifactorial-etiology","weight":5,"requirement":"Acknowledges multiple contributing factors"}]}]},"goldenResponse":"Treatment Failure:\nThe treatment failure is due to an inadequate course of antibiotics - a 10 day course of fidaxomicin will kill most of the C. diff but it is spore-forming, and the spores are resistant to antibiotics, and persist for long times. The current course doesn't cover the post-therapy window when the spores become active again and produce more toxin (7-10 days after treatment).\nThis risk is even higher in IBD due to impaired mucosal immunity and secondary dysbiosis. Ongoing exposure to pathogens (preschool teacher) also surely doesn't help. Antibiotics can be used to treat active infection but do not fix underlying dysbiosis. \nThe vedolizumab is likely noncontributory, but you could make the argument that immunosuppressants also necessitate a more thorough course of antibiotics due to decreased natural immune activity.\nThey could have done extended-pulsed fidaxomicin (EPFX) (days 1-5 BID, then q48h to day 25) which specifically lowers recurrences by covering the post-therapy germination window of C. diff.\nTransplant referral timing strategy:\nWe should time the FMT to the vulnerable window; schedule FMT for \\~24 to 48 hours after the final antibiotic dose which lands before her usual relapse window from 7 to 10 days. If the C Diff does not respond to treatment (greater than or equal to 2 recurrences), then can initiate FMT within 2-5 days of starting therapy."}
{"datasetId":"57a9ea87-f35d-46fa-a316-c82dfd8fa8e8","query":"32-year-old woman keeps getting admitted for breakthrough seizures every 3-4 months despite therapeutic levetiracetam levels. Each cluster occurs mid-cycle, 10-14 days after menses, with 3-5 seizures over 48 hours. Initial seizure frequency improved with levetiracetam 1000mg BID started 18 months ago, but breakthrough episodes began 6 months later. Lamotrigine 200mg BID was added after third admission, then removed after Stevens-Johnson syndrome. Recent admission labs: sodium 139, K 4.2, creatinine 0.9, glucose 112, levetiracetam level 12.8 (therapeutic range 12-46). EEGs between admissions show left temporal sharp waves. Her cycles are irregular 24-35 days, and she notes increased premenstrual irritability since starting levetiracetam. On admission, vitals are afebrile with BP 118/74, HR 82, saturating well. Given seizure clustering specifically during ovulatory phase despite therapeutic levels, what hormonal mechanism explains the pharmacoresistance and how should her anticonvulsant regimen be adjusted?","rubric":{"id":"catamenial-epilepsy-evaluation","sections":[{"id":"pathophysiology-accuracy","title":"Hormonal Mechanism Identification","criteria":[{"id":"identifies-catamenial-pattern","weight":8,"requirement":"Explicitly identifies catamenial epilepsy pattern"},{"id":"estrogen-pro-convulsant","weight":8,"requirement":"States estrogen's pro-convulsant effects via increased neuronal excitability"},{"id":"progesterone-protective","weight":8,"requirement":"Mentions progesterone/allopregnanolone's protective GABAergic effects"},{"id":"mid-cycle-timing-mechanism","weight":6,"requirement":"Explains why seizures occur 10-14 days after menses (ovulatory phase with estrogen surge)"},{"id":"c2","requirement":"Mentions C2 or peri-ovulatory pattern subtype of catamenial epilepsy","weight":2}]},{"id":"treatment-recommendations","title":"Anticonvulsant Regimen Adjustment","criteria":[{"id":"intermittent-benzodiazepine","weight":10,"requirement":"Recommends intermittent benzodiazepines (clobazam/clonazepam/lorazepam) for mid-cycle up to 10 days"},{"id":"hormonal-suppression-option","weight":8,"requirement":"Suggests hormonal suppression (COC, depot, progesterone therapy) as alternative"},{"id":"maintains-current-aed","weight":5,"requirement":"Explicitly states to continue current levetiracetam at therapeutic dose"}]},{"id":"safety-considerations","title":"Safety and Contraindications","criteria":[{"id":"avoids-lamotrigine","weight":10,"requirement":"Explicitly states to avoid lamotrigine due to Stevens-Johnson syndrome history"},{"id":"maintains-current-aed","weight":5,"requirement":"Explicitly states to continue current levetiracetam at therapeutic dose"}]}]},"goldenResponse":"Seizure clustering during ovulatory phase:\nThis is catamenial epilepsy with a C2 pattern (periovulatory). Around 2 weeks after menses (midcycle), the estradiol surge isn't being counterbalanced by opposing progesterone. Estrogen is proepileptic via increased NMDA activity and decreased GABA activity; progesterone has the opposite effect, with its metabolite causing GABAergic activity. Normal electrolytes and breakthrough seizures despite therapeutic levels of Keppra and stable EEG suggest catamenial etiology rather than underdosing ASM.\nThe irregular cycles could possibly be from temporal-lobe seizures disrupting the HPO axis, worsening her PMS symptoms.\nAnticonvulsant regimen adjustments:\nBecause her seizures are related to mid-cycle estrogen surge, we could either anticipate the mid-cycle excitability, or prevent ovulation altogether. One proven pulse treatment is benzos timed with mid-cycle (e.g. Clobazem 10 mg BID starting 10 days after menses for 5-7 days. She should also keep a seizure-cycle diary to time pulses if using the benzodiazepine method. If she still experiences seizures after the first 2-3 cycles, we can try to stop ovulation entirely by adding a continuous combined OCP or a depo-provera injection. Continue Keppra at current dose, no change needed since it is already at therapeutic levels."}
{"datasetId":"ec604a68-eb65-4b8b-aa1d-47d7c04bf7dc","query":"Looking through records, this 34-year-old woman has had three admissions over 8 months for presumed lupus flare. First admission: rash, arthralgias, ANA 1:640, creatinine 1.4 mg/dL, started on prednisone 40mg daily plus mesalamine 800mg TID for colitis. Second admission 3 months later: creatinine 1.8, continued mesalamine, increased prednisone. Third admission: creatinine 2.3, fevers to 37.8°C, BP 148/92, urine eosinophils negative despite being checked 7 days into admission. Between admissions, creatinine improved to 1.2-1.5 but never normalized. Social history reveals she works as a kindergarten teacher with frequent infections prompting antibiotic courses. Labs during third admission show WBC 8.2 (eos 8%), CRP 12, complements normal, dsDNA negative, sed rate 45. Renal biopsy initially read as lupus nephritis but pathologist noted \"unusual tubular changes.\" Her creatinine remained elevated at 1.9 two weeks post-discharge despite prednisone taper. Given the persistent creatinine elevation with repeated mesalamine exposure and the negative urine eosinophils drawn late, what diagnosis explains this pattern and what management is indicated?","rubric":{"id":"mesalamine-ain-evaluation","sections":[{"id":"diagnosis-accuracy","title":"Diagnostic Accuracy","criteria":[{"id":"states-mesalamine-ain","weight":15,"requirement":"Explicitly states diagnosis as mesalamine-induced acute interstitial nephritis"},{"id":"explains-temporal-relationship","weight":8,"requirement":"Links creatinine rises to mesalamine exposure"},{"id":"excludes-lupus-nephritis","weight":8,"requirement":"States lupus nephritis unlikely due to normal complements and negative dsDNA"},{"id":"acknowledges-eosinophil-limitation","weight":5,"requirement":"States urine eosinophils is not sensitive or specific when checked after 48 hours"},{"id":"incorrect-primary-diagnosis","weight":-20,"requirement":"States lupus nephritis as primary explanation for patient presentation"}]},{"id":"management-accuracy","title":"Management Recommendations","criteria":[{"id":"immediate-mesalamine-cessation","weight":12,"requirement":"Explicitly states to discontinue mesalamine immediately"},{"id":"avoid-5-asa-derivatives","weight":8,"requirement":"States to avoid all 5-ASA derivatives"},{"id":"corticosteroid-dosing","weight":8,"requirement":"Provides specific prednisone dose between 0.5-1 mg/kg/day"},{"id":"alternative-colitis-therapy","weight":6,"requirement":"Suggests specific alternative treatments for colitis (biologics, budesonide)"},{"id":"monitoring-frequency","weight":5,"requirement":"Recommends monitoring for creatinine and urinalysis at least weekly"},{"id":"avoid-nephrotoxins","weight":6,"requirement":"Lists specific nephrotoxic drugs to avoid"},{"id":"incorrect-management","weight":-30,"requirement":"Recommends continuing mesalamine or escalating lupus treatment"},{"id":"corticosteroid-taper","weight":2,"requirement":"Mentions to eventually taper the steroid treatment after patient shows improvement"}]},{"id":"clinical-reasoning","title":"Clinical Reasoning Quality","criteria":[{"id":"addresses-crp-elevation","weight":4,"requirement":"Acknowledges elevated CRP (12) as inconsistent with SLE"}]}]},"goldenResponse":"The most likely diagnosis based on this patient's presentation is Mesalamine-induced acute interstitial nephritis, not lupus nephritis. Creatinine rises in response to restarting mesalamine during admissions. Renal biopsy was suspicious for tubular changes supporting AIN. Peripheral eosinophilia (8%) supports a hypersensitivity etiology. Urine eosinophils are neither specific nor sensitive for drug-induced AIN, and checking them day 7 further lowers yield. Lupus nephritis is made less likely by complement levels WNL and dsDNA negative with markedly elevated CRP (usually normal or only slightly elevated in SLE).\nThe appropriate changes in management include the following: \nConfirm AIN with UA, preferably within 2 days of starting the mesalamine (eosinophiluria most likely within 48 hours). \nPermanently stop Mesalamine and avoid all 5-ASA derivatives moving forward. Consult GI to replace with another appropriate agent for treating colitis aspects of IBD (e.g. budesonide MMX, biologics, etc.).\nTreat AIN with corticosteroids: use prednisone ~1 mg/kg/day (max 60 mg) for 1-2 weeks, then taper over 4-6 weeks based on the patient's Cr.\nAvoid other drugs which commonly cause AIN, including diuretics, rifampin, allopurinol, B-lactams and cephalosporins, PPIs, NSAIDs, and sulfa drugs. \nWeekly UA and Renal function panel to assess disease progression. \nReassess lupus diagnosis: for aforementioned reasons, lupus is a less likely culprit of the patient's colitis, consider other etiologies like IBD. \nRepeated Mesalamine-AID could lead to chronic tubular changes."}
{"datasetId":"4691d320-c8e4-4d21-8d01-fe3c632c230f","query":"A 47-year-old woman with lupus nephritis on prednisone 15mg daily presents with her third hospitalization in 4 months for nausea, fatigue, and orthostatic dizziness. Each admission began 1-2 weeks after starting tuberculosis treatment with rifampin, isoniazid, ethambutol, and pyrazinamide. Initial presentations showed Na 129 mEq/L, K 4.3, creatinine 1.2, glucose 89, morning cortisol 1.2 mcg/dL. She responded to stress-dose steroids with symptomatic improvement within 48 hours. After each discharge, prednisone was resumed at 15mg daily without stress dosing guidance. She works as a home health aide and missed several rheumatology appointments due to transportation issues. On this admission, temp 37.1°C, HR 102, BP 92/58, RR 20, SpO2 97% RA. Morning cortisol remains 1.4 mcg/dL despite 3 months of rifampin therapy. Given the temporal relationship between TB treatment initiation and recurrent adrenal crises, what explains her persistent cortisol suppression and how should her prednisone dosing be adjusted while continuing anti-tuberculous therapy?","rubric":{"id":"adrenal-crisis-rifampin-evaluation","sections":[{"id":"mechanism-and-pharmacokinetics","title":"Defines Mechanism & Pharmacokinetics","criteria":[{"id":"rifampin-induction-targets","weight":6,"requirement":"Lists at least 1 of {CYP3A4, UDP-glucuronosyltransferases, P-glycoprotein} as rifampin-induced systems that clear steroids"},{"id":"steroid-clearance","weight":5,"requirement":"States that rifampin accelerates clearance of steroid molecules"},{"id":"prednisone-half-life","weight":4,"requirement":"States that rifampin significantly reduces steroid half-life (does not require exact percentage)"},{"id":"prednisolone-half-life","weight":2,"requirement":"Indicates rifampin affects prednisolone metabolism"},{"id":"cortisol-half-life","weight":2,"requirement":"Indicates that rifampin affects cortisol metabolism"},{"id":"cortisol-excretion","weight":2,"requirement":"Indicates that rifampin affects cortisol clearance"}]},{"id":"hpa-axis-suppression","title":"Defines HPA Axis Suppression & Secondary AI","criteria":[{"id":"hpa-suppression","weight":6,"requirement":"Defines that chronic prednisone use suppresses the hypothalamic-pituitary-adrenal axis via negative feedback"},{"id":"replacement-clearance","weight":4,"requirement":"States that secondary adrenal insufficiency results when rifampin accelerates clearance of replacement steroids"},{"id":"despite-prednisone","weight":3,"requirement":"Specifies that adrenal insufficiency occurs despite ongoing prednisone therapy"}]},{"id":"clinical-syndrome","title":"Specifies Clinical Syndrome & Diagnostic Signals","criteria":[{"id":"characteristic-features","weight":5,"requirement":"Lists at least 3 of {fatigue, hypotension, hyponatremia, low morning cortisol} as features of the recurrent crises"},{"id":"rifampin-context","weight":3,"requirement":"Indicates that crises occur during rifampin therapy"},{"id":"rapid-response","weight":4,"requirement":"States that symptoms resolve rapidly with intravenous stress-dose steroids"},{"id":"recurrent-pattern","weight":3,"requirement":"Specifies that adrenal crises are recurrent in this patient"},{"id":"low-morning-cortisol","weight":3,"requirement":"Indicates that low morning cortisol is documented during crises"}]},{"id":"stress-dose-management","title":"Recommends Acute Stress-Dose Management","criteria":[{"id":"hydrocortisone-regimens","weight":3,"requirement":"Lists at least 1 of {50 mg q6 h, 50 mg q8 h, 100 mg q6 h, 100 mg q8 h} as acceptable stress-dose hydrocortisone regimens"},{"id":"intravenous-route","weight":3,"requirement":"Specifies that stress-dose hydrocortisone is given intravenously"},{"id":"prompt-initiation","weight":3,"requirement":"Indicates initiation of stress dosing promptly during acute illness"},{"id":"transition-plan","weight":3,"requirement":"States to taper back to the adjusted oral dose once stable"},{"id":"agent-selection","weight":3,"requirement":"Defines hydrocortisone as the agent used for stress dosing"}]},{"id":"chronic-dose-adjustment","title":"Recommends Chronic Dose Adjustment During Rifampin","criteria":[{"id":"required-escalation","weight":4,"requirement":"States that management requires doubling or tripling the daily glucocorticoid dose during rifampin therapy"},{"id":"dose-example","weight":4,"requirement":"Specifies increasing the maintenance dose from 15 mg to 30-45 mg daily "},{"id":"divided-doses","weight":3,"requirement":"Indicates that divided doses are preferred to stabilize plasma levels above the therapeutic range"},{"id":"during-rifampin","weight":3,"requirement":"Specifies maintaining the escalated dose for the duration of rifampin therapy"},{"id":"post-rifampin-taper","weight":3,"requirement":"States to taper prednisone back to the prior baseline after rifampin is discontinued"},{"id":"baseline-reference","weight":3,"requirement":"Specifies the example baseline prednisone dose as 15 mg daily"}]},{"id":"monitoring-education","title":"Outlines Monitoring, Education & Guideline Alignment","criteria":[{"id":"monitoring-targets","weight":3,"requirement":"Lists at least 2 of {blood pressure, electrolytes, morning cortisol, symptoms} as monitoring targets for titration"},{"id":"emergency-coverage","weight":3,"requirement":"Specifies education on the need for emergency steroid coverage during stressful periods"},{"id":"illness-insight","weight":2,"requirement":"Indicates education to ensure the patient understands the status of their illness"},{"id":"guideline-bodies","weight":3,"requirement":"Lists at least 1 of {Endocrine Society, European Society of Endocrinology} as organizations highlighting glucocorticoid dose escalation to prevent adrenal crisis in rifampin-treated patients"}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"delay-steroids","weight":-15,"requirement":"Indicates withholding stress-dose steroids in crisis until cortisol results return"},{"id":"reduce-during-rifampin","weight":-15,"requirement":"Recommends decreasing or stopping glucocorticoids during rifampin therapy"},{"id":"misstate-rifampin","weight":-10,"requirement":"Says rifampin inhibits CYP3A4 or reduces steroid clearance"},{"id":"fluids-only","weight":-10,"requirement":"States that hypotension in crisis should be managed with fluids only without steroids"},{"id":"primary-ai-only","weight":-10,"requirement":"Indicates primary adrenal insufficiency as the mechanism and recommends fludrocortisone alone"}]}]},"goldenResponse":"This patient's recurrent adrenal crises are best explained by rifampin-induced acceleration of glucocorticoid metabolism leading to inadequate systemic steroid levels despite ongoing prednisone therapy. Rifampin is a potent inducer of hepatic cytochrome P450 3A4, UDP-glucuronosyltransferases, and P-glycoprotein, all of which metabolize and clear steroid molecules. Pharmacokinetic studies show rifampin reduces the plasma half-life of prednisone and prednisolone by nearly 50 to 60 percent, while also shortening cortisol half-life and increasing urinary excretion. In a patient with chronic prednisone use, the hypothalamic-pituitary-adrenal axis is already suppressed, reducing the capacity for endogenous cortisol production due to chronic negative feedback. When rifampin accelerates clearance of both replacement and endogenous steroids, the net result is recurrent secondary adrenal insufficiency with characteristic fatigue, hypotension, hyponatremia, and low morning cortisol, all of which resolve rapidly with intravenous stress-dose steroids. \nManagement requires doubling or tripling the daily glucocorticoid dose during rifampin therapy, for example, increasing her maintenance from 15 mg to 30-45 mg daily, ideally in divided doses to stablize plasma levels above the therapeutic range. During acute illness, hydrocortisone stress dosing at 50-100 mg intravenously every 6-8 hours should be given promptly, with tapering back to the adjusted oral dose once stable. Patient education on sick day rules and the need for emergency steroid coverage is crucial to reduce recurrence so they understand the status of their illness and ensure appropriate steroid coverage during particularly stressful periods. After rifampin is discontinued, the prednisone dose should be carefully tapered back to her prior baseline to avoid overtreatment and iatrogenic Cushing features. Close monitoring of blood pressure, electrolytes, morning cortisol, and symptoms guides ongoing titration. Both the Endocrine Society and the European Society of Endocrinology highlight rifampin as a high-risk inducer of steroid metabolism and recommend proactive glucocorticoid dose escalation to prevent adrenal crisis in such patients.\n"}
{"datasetId":"dda59138-4be5-4e4c-a595-693581c2f99d","query":"This 19-year-old man developed respiratory failure from influenza pneumonia requiring VV ECMO. Propofol infusion at 50 mcg/kg/min was started for sedation. Day 3: temp 38.1°C, HR 110, BP 82/45, RR 28, SpO2 97% on ECMO. Labs showed sodium 138, K 5.2, Cl 98, HCO3 12, glucose 142, creatinine 1.4 (baseline 0.8). ABG revealed pH 7.28, pCO2 42, anion gap 28. CK 28,000 with CK-MM fraction 94%. Triglycerides reported as >2000 mg/dL with assay interference flag. Lactate 8.2. ECMO flows remained adequate. No urine obtained despite 2L fluid balance positive. Propofol was continued as team focused on ECMO complications. Given the anion gap acidosis and extreme CK elevation while on propofol, what mechanism explains this presentation and what immediate intervention is needed?","rubric":{"id":"pris-diagnosis-evaluation","sections":[{"id":"pathophysiology","title":"States Pathophysiology of PRIS","criteria":[{"id":"rc-inhibition","weight":3,"requirement":"States that propofol directly inhibits mitochondrial respiratory chain complexes."},{"id":"cpt-inhibition","weight":3,"requirement":"States that propofol inhibits carnitine palmitoyltransferase."},{"id":"oxphos-impairment","weight":3,"requirement":"Indicates that oxidative phosphorylation is impaired by propofol."},{"id":"fa-transport-block","weight":3,"requirement":"Indicates that fatty acid transport into mitochondria is impaired."},{"id":"energy-failure-sequelae","weight":3,"requirement":"Lists at least 2 of {lactate accumulation, adenosine triphosphate depletion in cardiac muscle, adenosine triphosphate depletion in skeletal muscle, cellular necrosis} as consequences of failed aerobic energy metabolism."},{"id":"tg-accumulation-mechanism","weight":3,"requirement":"Indicates that impaired fatty acid oxidation drives triglyceride accumulation."}]},{"id":"clinical-features","title":"Indicates Clinical and Laboratory Features","criteria":[{"id":"defining-pentad","weight":3,"requirement":"Lists at least 2 of {anion gap metabolic acidosis, rhabdomyolysis, hypertriglyceridemia, renal failure, hemodynamic collapse} as PRIS features."},{"id":"extreme-ck","weight":3,"requirement":"States that rhabdomyolysis explains extreme creatine kinase elevation."},{"id":"myoglobin-renal-injury","weight":3,"requirement":"States that rhabdomyolysis leads to myoglobin-mediated renal injury."},{"id":"tg-threshold","weight":3,"requirement":"Specifies that triglyceride accumulation can exceed 2000 mg/dL."},{"id":"lactic-acidosis","weight":3,"requirement":"Indicates that lactic acidosis is present in PRIS."},{"id":"cardiac-complications","weight":3,"requirement":"Lists at least 1 of {myocardial depression, arrhythmias} as cardiac manifestations needing attention."},{"id":"high-lethality","weight":3,"requirement":"Indicates that PRIS is rare but highly lethal."}]},{"id":"risk-factors","title":"Specifies Risk Factors and Exposure Thresholds","criteria":[{"id":"danger-exposure-reached","weight":3,"requirement":"Specifies that the patient received 50 mcg/kg/min for 72 hours, within a recognized danger range."},{"id":"rate-threshold","weight":4,"requirement":"Specifies that guidelines recommend avoiding propofol rates >4 mg/kg/h "},{"id":"duration-threshold","weight":4,"requirement":"Specifies that guidelines recommend avoiding propofol durations >48 hours."},{"id":"mortality-risk","weight":3,"requirement":"Indicates that continued propofol infusion dramatically increases mortality."},{"id":"high-risk-groups","weight":3,"requirement":"Lists at least 2 of {young patients, ECMO, catecholamine support} as high-risk populations for PRIS."},{"id":"prolonged-exposure-risk","weight":3,"requirement":"Indicates that prolonged propofol exposure increases PRIS risk."}]},{"id":"immediate-management","title":"Recommends Immediate and Supportive Management","criteria":[{"id":"immediate-cessation","weight":6,"requirement":"Specifies immediate discontinuation of propofol without taper as the single most important intervention."},{"id":"sedation-alternatives","weight":3,"requirement":"Lists at least 3 of {midazolam, dexmedetomidine, ketamine, opioid infusions} as alternatives after stopping propofol."},{"id":"rrt-comprehensive","weight":4,"requirement":"Recommends renal replacement therapy for refractory acidosis, hyperkalemia, and anuria."},{"id":"fluids","weight":3,"requirement":"Recommends aggressive hemodynamic stabilization with fluids."},{"id":"vasopressors","weight":3,"requirement":"Recommends vasopressors for hemodynamic stabilization."},{"id":"electrolyte-correction","weight":3,"requirement":"Recommends correction of electrolyte derangements."}]},{"id":"adjunct-management","title":"Outlines Adjuncts, Consultation, Documentation, and Monitoring","criteria":[{"id":"cardiology-consult","weight":3,"requirement":"Recommends cardiology involvement for myocardial depression or arrhythmias."},{"id":"adjunct-options","weight":3,"requirement":"Lists at least 1 of {glucose–insulin infusion, L-carnitine} as adjuncts described in early studies."},{"id":"contraindication-record","weight":3,"requirement":"Specifies documenting propofol as a contraindicated agent for future use."},{"id":"team-education","weight":3,"requirement":"Outlines educating the ICU team on routine monitoring during prolonged sedation."},{"id":"monitoring-targets","weight":3,"requirement":"Lists at least 2 of {lactate, triglycerides, creatine kinase} as labs to monitor during prolonged sedation."},{"id":"prevention-context","weight":3,"requirement":"Indicates that routine monitoring aims to prevent recurrence during prolonged sedation."},{"id":"organ-failure-warning","weight":3,"requirement":"Indicates that failure to recognize PRIS leads to rapid progression toward multi-organ failure."}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"lipid-emulsion-claim","weight":-10,"requirement":"States that intravenous lipid emulsion is primary therapy for PRIS."},{"id":"dantrolene-first-line","weight":-15,"requirement":"Indicates dantrolene as first-line treatment for suspected PRIS."},{"id":"triglyceride-only-focus","weight":-10,"requirement":"Says triglycerides >2000 mg/dL should be treated primarily with fibrates while leaving the sedative plan unchanged."},{"id":"ecmo-protection-claim","weight":-5,"requirement":"States that VV ECMO protects against PRIS cardiotoxicity, so cardiology involvement is unnecessary."},{"id":"sepsis-only-attribution","weight":-10,"requirement":"Indicates that lactic acidosis is due solely to sepsis, deferring any PRIS-directed management."}]}]},"goldenResponse":"This 19-year-old man on venovenous extracorporeal membrane oxygenation (VV ECMO) has developed a clinical syndrome most consistent with propofol infusion syndrome (PRIS), a rare but highly lethal complication characterized by anion gap metabolic acidosis, rhabdomyolysis, hypertriglyceridemia, renal failure, and hemodynamic collapse after prolonged propofol exposure. The pathophysiology lies in propofol's direct inhibition of mitochondrial respiratory chain complexes and carnitine palmitoyltransferase, which together impair both oxidative phosphorylation and fatty acid transport into mitochondria. The product of this impairment is failure of aerobic energy metabolism, leading to lactate accumulation, depletion of adenosine triphosphate in cardiac and skeletal muscle, and subsequent cellular necrosis.\nRhabdomyolysis accounts for the extreme creatine kinase elevation and myoglobin-mediated renal injury, while impaired fatty acid oxidation drives triglyceride accumulation beyond 2000 mg/dL. This mechanism explains the constellation of lactic acidosis, rhabdomyolysis, and hypertriglyceridemia.\nThe single most important intervention is the immediate discontinuation of propofol (without taper) as continued infusion dramatically increases mortality. This threshold is especially relevant given that the patient was within the recognized danger range of 50 mcg/kg/min for 72 hours, exceeding the Society of Critical Care Medicine (SCCM) and European Society of Anaesthesiology recommendations to avoid rates above 4 mg/kg/h (approximately 67 mcg/kg/min) or durations beyond 48 hours. After cessation, sedation must be transitioned to agents such as midazolam, dexmedetomidine, ketamine, or opioid infusions. Supportive measures include renal replacement therapy for refractory acidosis and hyperkalemia, aggressive hemodynamic stabilization with fluids and vasopressors, correction of electrolyte derangements, and cardiology involvement for myocardial depression or arrhythmias. Adjunctive therapies such as glucose-insulin infusions and L-carnitine have been described in some early studies. In conclusion, failure to recognize PRIS, especially in high-risk populations such as young patients on ECMO or catecholamine support, leads to rapid progression toward multi-organ failure. For this patient, documenting propofol as a contraindicated agent for future use and educating the ICU team on routine monitoring of lactate, triglycerides, and creatine kinase during prolonged sedation can help prevent recurrence. Renal replacement therapy can also be used for refractory acidosis, hyperkalemia, and anuria."}
{"datasetId":"e4d30f61-2045-4246-a69b-967c0c3cfd60","query":"You're asked to see a 54-year-old woman with jaundice and fatigue. Three months ago she completed pembrolizumab for stage III melanoma. ALT peaked at 850 U/L during cycle 3, attributed to autoimmune hepatitis flare when IgG4 came back elevated at 320 mg/dL. Liver biopsy showed interface hepatitis with plasma cell infiltrate. Prednisone 60mg daily achieved biochemical remission, but symptoms recurred during each taper attempt over 6 months. Currently on 20mg daily with ALT rising to 320 U/L despite azathioprine 150mg daily. Vitals show temp 37.2°C, HR 88, BP 118/76. Labs reveal AST 280, ALT 320, ALP 145, total bilirubin 4.2, direct 2.8. IgG now 2400 mg/dL. Review of original biopsy shows prominent eosinophils not noted initially. What explains the refractory course and progressive IgG4 elevation following immune checkpoint inhibitor exposure?","rubric":{"id":"icig-related-hepatitis-evaluation","sections":[{"id":"diagnostic-accuracy","title":"Diagnostic Accuracy and Pathophysiology","criteria":[{"id":"identifies-ici-triggered-igg4-rd","weight":10,"requirement":"States checkpoint inhibitor-triggered IgG4-related disease"},{"id":"explains-therapy-failure","weight":8,"requirement":"Explains that steroid tapers are associated with relapse in IgG4-RD"},{"id":"explains-ici-mechanism","weight":6,"requirement":"Explains that pembrolizumab up regulates the immune system, potentially triggering autoimmune diseases"},{"id":"cites-eosinophil-significance","weight":8,"requirement":"Links eosinophils to IgG4-RD histology"},{"id":"incorrect-primary-diagnosis","weight":5,"requirement":"Correctly identifies primary diagnosis as an error (e.g., AIH flare)"},{"id":"cites-plasma-cell-infiltration","requirement":"Links plama cell infiltrate on histopathology to strong likelihood for IgG4-RD","weight":8}]},{"id":"clinical-evidence","title":"Clinical Evidence Interpretation","criteria":[{"id":"igg4-level-significance","weight":8,"requirement":"States IgG4 >2 times the upper limit of normal as >90% specific for IgG4-RD"},{"id":"steroid-refractory-evidence","weight":6,"requirement":"Cites steroid taper failures as IgG4-RD evidence"}]},{"id":"therapeutic-recommendations","title":"Management Recommendations","criteria":[{"id":"rituximab-recommendation","weight":12,"requirement":"Recommends rituximab as first-line IgG4-RD therapy"},{"id":"provides-dosing-info","weight":5,"requirement":"States rituximab 1000mg every 15 days for 2 doses or 300 every 15 days for 2 doses"},{"id":"harmful-recommendation","weight":-100,"requirement":"Recommends stopping steroids abruptly or harmful changes"},{"id":"ruling-out-psc","requirement":"Recommends ordering ANA, AMA, ASMA, p-ANCA to decrease suspicion for other conditions including AIH and Primary Sclerosing Cholangitis","weight":4}]},{"id":"differential-diagnosis","title":"Differential Diagnosis Consideration","criteria":[{"id":"excludes-aih-primary","weight":4,"requirement":"States why pure AIH is unlikely given IgG4 levels "},{"id":"considers-ici-hepatitis","requirement":"Correctly includes ICI Hepatitis in the differential diagnosis","weight":4}]},{"id":"clarity-and-structure","title":"Communication Quality","criteria":[{"id":"clear-diagnosis-statement","weight":6,"requirement":"States unambiguous diagnostic conclusion"},{"id":"answers-primary-question","requirement":"Answers directly asked question unambiguously","weight":6}]}]},"goldenResponse":"This 54 year old patient's continued hepatitis after completing a course of pembrolizumab despite 6 months of prednisone therapy and AZT, along with her marked IgG elevation is most consistent with initial ICI-induced hepatitis turned ICI-induced IgG4-related disease. It is likely that the initial diagnosis of autoimmune hepatitis flare was incorrect. \n\nPembrolizumab is an immune checkpoint inhibitor used in the treatment of metastatic melanoma. One of the most common side effects is organ inflammation as a result of immune system regulation. Patients with pre-existing autoimmune diseases can see flares, and patients can have autoimmune diseases triggered. \n\nIn this patient, pembrolizumab likely triggered IgG4-related disease, a chronic immune mediated inflammatory condition that can involve many organs in the body, commonly the liver and biliary tract. This diagnosis is supported by:\n- Marked elevation of IgG4: At levels more than 2x the upper limit of normal, there is a >90% specificity for IgG4-RD\n- History of Pembrolizumab: Immune checkpoint inhibitors have been linked to inducing this disease\n- Refractory course: IgG4-RD has been shown to flare during tapers of prednisone\n- Pathology findings: Lymphoplasmacytic infiltrate with mild tissue eosinophilia is strongly suggestive of IgG4-RD\n\nNext steps: \n- Re-evaluate the pathology to identify storiform fibrosis and obliterative phlebitis if present\n- CT scan of abdomen to evaluate for multifocal biliary ductal dilatation and pancreatic ductal dilatation which is commonly seen in IgG4-RD and a differentiating feature from Primary Sclerosing Cholangitis\n- ANA, AMA, ASMA, p-ANCA to decrease clinical suspicion for AIH and Primary Sclerosing Cholangitis\n- Perform a comprehensive review of systems to rule out additional organ involvement\n- Initiate therapy with rituximab 1g IV every 15 days for 2 doses or inebilizumab 300mg IV every 15 days for 2 doses"}
{"datasetId":"45b75e39-3fc7-4ed6-b5c7-19cd125d822d","query":"Previously healthy 54-year-old woman returns to ED 72 hours after outpatient cardiac catheterization via radial access for chest pain evaluation. She developed nausea and fatigue 36 hours post-procedure, with mild confusion noted this morning. Vitals: afebrile, BP 95/58, HR 112, RR 26. Labs show sodium 132, K 4.8, chloride 98, bicarbonate 18, creatinine 2.2 (baseline 1.1), glucose 112. Venous lactate 4.2 mmol/L. She takes metformin 1000mg BID for diabetes diagnosed 8 years ago. Her eGFR was 62 ml/min/1.73m² pre-cath using CKD-EPI, though she's lost 25 pounds over 9 months. After last year's colonoscopy prep, her creatinine transiently rose to 1.4 then normalized. She received 1000mL saline and sodium bicarbonate 154mEq in 850mL D5W started 4 hours pre-procedure, continued for 6 hours post, with 600mg N-acetylcysteine. She works as a dental assistant, took ibuprofen for back pain twice daily this week. What explains her progressive lactic acidosis and renal failure despite standard prophylaxis?","rubric":{"id":"mala-diagnosis-evaluation","sections":[{"id":"defines-diagnosis-severity","title":"Defines Diagnosis and Severity","criteria":[{"id":"diagnosis-label","weight":6,"requirement":"States that the most likely cause is metformin associated lactic acidosis precipitated by acute kidney injury"},{"id":"egfr-threshold","weight":4,"requirement":"Defines that eGFR <30 mL/min indicates severe acute kidney injury"},{"id":"prophylaxis-context","weight":3,"requirement":"Indicates acidosis progressed despite standard contrast nephropathy prophylaxis"},{"id":"acidosis-hypotension","weight":3,"requirement":"Specifies hypotension is due to worsening acidosis"},{"id":"feature-set","weight":3,"requirement":"Lists at least 2 of {eGFR <30 mL/min, progressive lactic acidosis, hypotension, volume depletion, received standard prophylaxis}"}]},{"id":"defines-mechanisms-precipitants","title":"Defines Mechanisms and Precipitants","criteria":[{"id":"metformin-accumulation","weight":6,"requirement":"States metformin accumulation due to reduced renal clearance in AKI drives MALA"},{"id":"lactate-clearance","weight":4,"requirement":"Indicates impaired lactate clearance accelerates acidosis"},{"id":"risk-factor-trio","weight":4,"requirement":"Lists at least 2 of {chronic NSAID use, recent contrast administration, volume depletion}"},{"id":"contrast-trigger","weight":3,"requirement":"Specifies recent contrast administration precipitated AKI"},{"id":"nsaid-effect","weight":2,"requirement":"Specifies chronic NSAID use precipitated AKI"},{"id":"volume-loss","weight":2,"requirement":"Indicates volume depletion precipitated AKI"}]},{"id":"specifies-guideline-thresholds","title":"Specifies Guideline Thresholds","criteria":[{"id":"pericontrast-hold","weight":6,"requirement":"States current guidelines recommend holding metformin 48h before and after (must reference both) contrast exposure when eGFR is <45-59 mL/min"},{"id":"hold-timing","weight":3,"requirement":"Lists at least 1 of {48h before contrast, 48h after contrast} as elements of metformin hold window"},{"id":"critical-error","weight":5,"requirement":"Indicates continuing metformin during declining renal function is a critical error"},{"id":"contrast-linkage","weight":3,"requirement":"Specifies metformin hold recommendation applies in context of contrast exposure"},{"id":"prophylaxis-given","weight":3,"requirement":"Indicates standard prophylaxis for contrast nephropathy was provided"}]},{"id":"recommends-immediate-management","title":"Recommends Immediate Management","criteria":[{"id":"management-bundle","weight":6,"requirement":"Lists at least 2 of {discontinue metformin, discontinue NSAIDs, aggressive volume resuscitation after ruling out fluid overload}"},{"id":"early-hemodialysis","weight":6,"requirement":"Recommends early consideration of hemodialysis to perform at least one of the following: {remove metformin, correct acidosis}"},{"id":"early-rrt-outcomes","weight":5,"requirement":"Indicates early renal replacement therapy is associated with improved outcomes"},{"id":"overload-check","weight":3,"requirement":"Specifies fluid overload must be ruled out before aggressive volume resuscitation"},{"id":"volume-target","weight":3,"requirement":"Indicates volume resuscitation addresses persistent volume depletion"}]},{"id":"outlines-monitoring-escalation","title":"Outlines Monitoring and Escalation","criteria":[{"id":"serial-vbg","weight":6,"requirement":"Recommends serial venous blood gas monitoring to track acidosis"},{"id":"improvement-check","weight":3,"requirement":"Indicates monitoring assesses improvement of acidosis"},{"id":"worsening-check","weight":3,"requirement":"Indicates monitoring assesses worsening of acidosis"},{"id":"trend-escalation","weight":5,"requirement":"Specifies acidosis trends on VBG guide escalation of therapy"},{"id":"dialysis-goals","weight":3,"requirement":"Lists at least 1 of {remove metformin, correct acidosis} as therapeutic goals"}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"continue-metformin","weight":-15,"requirement":"States metformin should be continued despite eGFR <30 mL/min or progressive lactic acidosis"},{"id":"egfr-safe-claim","weight":-15,"requirement":"Indicates eGFR <30 mL/min is safe for ongoing metformin therapy"},{"id":"use-nsaids","weight":-10,"requirement":"Recommends NSAIDs during AKI with lactic acidosis"},{"id":"delay-dialysis","weight":-10,"requirement":"Says hemodialysis should be deferred until acidosis resolves without renal replacement therapy"},{"id":"sepsis-only-cause","weight":-5,"requirement":"States lactic acidosis is solely due to sepsis and dismisses MALA precipitated by AKI"}]}]},"goldenResponse":"This patient's eGFRis <30 ml/min indicating severe acute kidney injury. The most likely cause of her progressive lactic acidosis despite standard prophylaxis is metformin associated lactic acidosis (MALA) precipitated by acute kidney injury (AKI). Key contributing factors to this patient's AKI and development of MALA include chronic NSAID use, recent contrast administration, and volume depletion. These factors increase the risk for metformin accumulation and impaired lactate clearance, accelerating the acidosis. \n\nAlthough this patient received standard prophylaxis for contrast nephropathy, the continued use of metformin in the setting of declining renal function is a critical error. Current guidelines recommend holding metformin 48 hours before and after contrast exposure when eGFR is <45-59 ml/min. Her hypotension is likely due to worsening acidosis and persistent volume depletion. Immediate management should include discontinuation of metformin and NSAIDs, aggressive volume resuscitation after ruling out fluid overload, and early consideration of hemodialysis to remove metformin and correct acidosis. Early renal replacement therapy is associated with improved outcomes. Additional, management steps should include serial venous blood gas monitoring to assess for improvement or worsening of acidosis that can guide the escalation of therapy. \n"}
{"datasetId":"60bbdbe4-9db1-400f-94c1-acd1cdd0097a","query":"You're consulted on a 52-year-old man with his third admission for acute pancreatitis in 8 months. Each episode began 48-72 hours after starting capecitabine cycles for metastatic colorectal cancer. Previous admissions: lipase peaked at 890 and 1200 U/L, AST 45-52 U/L, total bilirubin 2.8-3.1 mg/dL with indirect fraction 85%. CT showed peripancreatic stranding without necrosis. He improved with bowel rest, IV fluids, and was discharged after 5-7 days. His oncologist reduced capecitabine from 2000mg to 1500mg BID after second episode, added ursodiol \"for Gilbert's syndrome\" based on intermittent jaundice with normal LFTs between cycles. Family history: brother had severe 5-FU toxicity requiring ICU admission. Current admission: temp 37.6°C, HR 102, BP 118/74, lipase 1100 U/L, bilirubin 3.4 mg/dL, otherwise stable. He's a chemical engineer worried about losing his job due to repeated hospitalizations. Given the temporal relationship between capecitabine and pancreatitis with hyperbilirubinemia, what genetic testing should guide future chemotherapy selection?","rubric":{"id":"dpyd-genetic-testing-evaluation","sections":[{"id":"primary-genetic-testing","title":"Primary DPYD Testing Recommendations","criteria":[{"id":"identifies-dpyd-primary","weight":12,"requirement":"Explicitly identifies DPYD genotyping as primary test"},{"id":"lists-dpyd-variant-2a","weight":5,"requirement":"Lists DPYD*2A (c.1905+1G>A) variant as needing testing "},{"id":"lists-dpyd-variant-13","weight":5,"requirement":"Lists DPYD*13 (c.1679T>G) variant as needing testing "},{"id":"lists-dpyd-variant-2846","weight":5,"requirement":"Lists c.2846A>T variant as needing testing "},{"id":"lists-dpyd-variant-hapb3","weight":5,"requirement":"Lists c.1236G>A (HapB3) variant as needing testing "},{"id":"explains-dpyd-enzyme","weight":3,"requirement":"States DPYD encodes DPD enzyme that metabolizes fluoropyrimidines"},{"id":"links-dpyd-to-toxicity","weight":12,"requirement":"Links DPYD deficiency to 5-FU/capecitabine toxicity"},{"id":"mentions-family-history-relevance","weight":8,"requirement":"States family history of 5-FU toxicity suggests inherited DPYD deficiency"}]},{"id":"testing-methodology","title":"Testing Specificity and Guidelines","criteria":[{"id":"cites-cpic-or-guidelines","weight":3,"requirement":"References CPIC, DPWG, or ESMO guidelines"},{"id":"explains-dose-reduction-option","weight":10,"requirement":"States DPYD variants may require dose reduction"},{"id":"explains-avoidance-option","weight":10,"requirement":"States DPYD variants may require complete avoidance"},{"id":"dose-reduction","requirement":"Specifies that dose reduction for intermediate metabolizers is 25-50%","weight":3},{"id":"intermediate-metabolizer","requirement":"Defines intermediate metabolizer as heterozygous for DPYD variant ","weight":3},{"id":"poor-metabolizer","requirement":"Defines poor metabolizer as homozygous for DPYD variant ","weight":3},{"id":"other-markers","requirement":"Mentions TYMS, MTHFR, or CDA as other pharmacogenetic markers of fluoropyridine toxicity","weight":3},{"id":"not-actionable","requirement":"Clarifies that these other markers are not considered actionable ","weight":3}]},{"id":"clinical-interpretation","title":"Clinical Context and Next Steps","criteria":[{"id":"addresses-hyperbilirubinemia-cause","weight":5,"requirement":"States hyperbilirubinemia is likely 5-FU toxicity"},{"id":"stop-capecitabine","weight":8,"requirement":"Explains that due to toxicity, regardless of DPYD testing capecitabine should be stopped "},{"id":"5-fu","requirement":"Explains that 5-FU could be considered depending on DPYD testing","weight":3},{"id":"ugt1a1","requirement":"Mentions UGT1A1 genotyping for consideration of irinotecan","weight":5}]},{"id":"accuracy-penalties","title":"Accuracy Corrections","criteria":[{"id":"incorrect-folfoxiri-description","weight":-15,"requirement":"States FOLFOXIRI is non-fluoropyrimidine regimen"},{"id":"discontinuation-only","requirement":"Only mentions discontinuation as general actionable result of DPYD testing, without mentioning dose reduction ","weight":-10}]}]},"goldenResponse":"This patient's recurrent pancreatitis is likely due to capecitabine. Although pancreatitis is a rare adverse effect of capecitabine, the reproducible onset 2-3 days after each cycle strongly supports causality. The strong family history suggests a heritable pharmacogenomic abnormality, further reinforcing the need for DPYD testing. His hyperbilirubinemia is more consistent with drug-induced toxicity, though Gilbert's syndrome could coexist and should not be assumed to explain recurrent episodes\n\nTo confirm this hypothesis, DPYD genotyping should be ordered. DPYD is the gene that encodes DPD, the rate limiting enzyme for fluoropyridine catabolism. Testing should include the four main DPYD variants: c1905+1G>A (rs3918290), c.1679T>G (rs55886062), c.2846A>T (rs67376798), and c.1236G>A (rs75017182, HapB3), as these are the variants most strongly associated with life-threatening adverse events. While TYMS and other pharmacogenetic markers such as MTHFR and CDA have been associated with increased fluoropyridine toxicity, their predictive value is lower and are not considered actionable.\n\nPer CPIC guidelines, testing results can inform dose adjustments or drug avoidance. Patients who are heterozygous for DPYD decreased/no function variants are categorized as intermediate metabolizers and should receive 25-50% dose reductions of fluoropyridines. Patients who are homozygous for such variants are considered poor metabolizers and should generally avoid fluoropyridines due to high risk of severe toxicities. \n\nHowever, even if this patient's DPYD testing were to be normal, capecitabine should be discontinued due to recurrent pancreatitis. It is still possible for normal metabolizers to experience side effects, and given the palliative nature of his treatment, therapy should be switched. If he is a normal or intermediate metabolizer, non-capecitabine containing regimens such as FOLFOX or FOLFIRI plus a targeted agent depending on additional mutational testing and right vs left-sidedness of his primary tumor should be considered. If switching to irinotecan-based therapy, UGT1A1 genotyping should also be obtained, as decreased function variants such as *28, 6 increase the risk of neutropenia and diarrhea."}
{"datasetId":"4c15a151-2668-4858-b177-34b2b7f14d67","query":"You're asked to see a 67-year-old woman with paroxysmal AF on rivaroxaban 20mg daily who presents with sudden onset severe abdominal pain 18 hours after her last dose. Three prior admissions over 8 months for similar presentations, each time improving after bowel rest and supportive care, with discharge on same anticoagulation. Vitals: temp 37.8°C, HR 104 irregular, BP 92/58, RR 28, SpO2 94%. Lactate 3.8 mmol/L, WBC 14.2, Hgb 11.8, creatinine 1.1, rivaroxaban level 312 ng/mL drawn 2 hours after symptom onset. CT angiography shows segmental SMA occlusion with bowel wall thickening. INR 1.4, PTT 32. Previous admissions documented \"therapeutic anticoagulation\" but no rivaroxaban levels drawn. Given peak rivaroxaban level exceeding expected therapeutic range and recurrent thrombotic events, what explains this apparent treatment failure and how should immediate anticoagulation be managed?","rubric":{"id":"anticoagulation-failure-evaluation","sections":[{"id":"mechanism-explanation","title":"Treatment Failure Mechanism Explanation","criteria":[{"id":"explains-adequate-absorption","weight":8,"requirement":"States rivaroxaban level 312 ng/mL indicates adequate drug absorption"},{"id":"identifies-pharmacodynamic-failure","weight":10,"requirement":"Explains why high rivaroxaban level does not guarantee antithrombotic efficacy"},{"id":"mentions-antiphospholipid-syndrome","weight":12,"requirement":"Explicitly identifies antiphospholipid syndrome as possible cause"},{"id":"distinguishes-dosing-vs-resistance","weight":8,"requirement":"Differentiates between underdosing and functional resistance"},{"id":"emphasizes-arterial-thrombosis","weight":6,"requirement":"Highlights arterial thrombosis as key indicator for APS evaluation"},{"id":"lists-alternative-mechanisms","weight":5,"requirement":"Lists 2+ potential causes (malignancy, MPN, interactions)"}]},{"id":"immediate-management","title":"Immediate Anticoagulation Management","criteria":[{"id":"discontinue-rivaroxaban","weight":8,"requirement":"Explicitly states to stop rivaroxaban immediately"},{"id":"initiate-iv-ufh","weight":10,"requirement":"Recommends starting IV unfractionated heparin"},{"id":"provides-ufh-dosing","weight":8,"requirement":"Provides specific UFH dosing (80 U/kg bolus + 18 U/kg/h)"},{"id":"states-ufh-target","weight":8,"requirement":"States aPTT target range (60-80 seconds or 1.5-2.5x control)"},{"id":"mentions-ufh-reversibility","weight":6,"requirement":"Notes UFH advantage of rapid reversibility with protamine"},{"id":"explains-surgical-readiness","weight":6,"requirement":"Discusses UFH dual benefit for surgical readiness and rapid reversal"},{"id":"addresses-surgical-timing","weight":6,"requirement":"Discusses need for urgent surgical consultation for SMA occlusion"}]},{"id":"long-term-strategy","title":"Long-term Anticoagulation Plan","criteria":[{"id":"transition-to-warfarin","weight":10,"requirement":"Recommends transitioning to warfarin for long-term therapy"},{"id":"warfarin-target-inr","weight":8,"requirement":"Specifies INR target range (2.5-3.5 for APS or 2-3 for AF)"},{"id":"states-warfarin-preference","weight":8,"requirement":"Explicitly states warfarin is preferred over DOACs for APS"},{"id":"contraindicates-rivaroxaban","weight":8,"requirement":"States rivaroxaban should not be restarted"},{"id":"recommends-aspirin-addition","weight":4,"requirement":"Mentions adding low-dose aspirin if APS confirmed"},{"id":"addresses-bridging-strategy","weight":6,"requirement":"Discusses perioperative anticoagulation bridging after revascularization"}]},{"id":"diagnostic-workup","title":"Diagnostic Workup Recommendations","criteria":[{"id":"orders-aps-testing","weight":10,"requirement":"Orders antiphospholipid antibody panel (LA, aCL, anti-β2GPI)"},{"id":"mentions-repeat-testing","weight":4,"requirement":"Notes APS testing should be repeated after 12 weeks"},{"id":"orders-malignancy-screen","weight":6,"requirement":"Recommends malignancy screening (CT, tumor markers)"},{"id":"orders-mpn-panel","weight":4,"requirement":"Mentions JAK2/MPL mutation testing for myeloproliferative neoplasm"},{"id":"addresses-ddi-screening","weight":3,"requirement":"Discusses checking for drug-drug interactions affecting rivaroxaban"}]},{"id":"clinical-priorities","title":"Clinical Priority Recognition","criteria":[{"id":"recognizes-urgent-surgery","weight":8,"requirement":"Acknowledges need for urgent surgical evaluation given lactate 3.8"},{"id":"addresses-hemodynamic-instability","weight":6,"requirement":"Notes significance of BP 92/58 and need for resuscitation"},{"id":"prioritizes-revascularization","weight":6,"requirement":"Discusses catheter-directed thrombolysis or thrombectomy options"},{"id":"mentions-bleeding-risk-assessment","weight":4,"requirement":"Addresses bleeding risk with anticoagulation in acute SMA occlusion"}]},{"id":"evidence-quality","title":"Evidence and Guideline References","criteria":[{"id":"cites-guidelines","weight":6,"requirement":"References specific guidelines (ACCP, ISTH, EULAR, ESC)"},{"id":"mentions-aps-criteria","weight":4,"requirement":"References Sydney criteria for APS diagnosis"},{"id":"provides-citations","weight":3,"requirement":"Includes specific citations or references to support recommendations"}]},{"id":"safety-considerations","title":"Safety and Accuracy","criteria":[{"id":"incorrect-mechanism","weight":-20,"requirement":"Provides incorrect explanation for anticoagulation failure"},{"id":"dangerous-recommendation","weight":-100,"requirement":"Recommends dangerous medication dosing or contraindicated therapy"},{"id":"omits-critical-intervention","weight":-15,"requirement":"Fails to recommend stopping rivaroxaban or starting UFH"}]}]},"goldenResponse":"This 67-year-old woman with paroxysmal atrial fibrillation on rivaroxaban 20 mg daily presents with recurrent embolic mesenteric ischemia, complicated by a superior mesenteric artery occlusion and lactic acidosis. Her rivaroxaban plasma level of 312 ng/mL, drawn 18 hours after the last dose and two hours after symptom onset, is notably supratherapeutic compared to the expected elderly peak range of 193-264 ng/mL. This pharmacokinetic profile excludes underdosing or nonadherence, and instead demonstrates adequate, even excessive, systemic exposure.\n\nInitial treatment involves unfractionated heparin (UFH) at a dose of 80 U/kg bolus followed by a continuous infusion of 18 U/kg/h, with the goal of maintaining an activated partial thromboplastin time (aPTT) in the therapeutic range of 60-80 seconds or 1.5 to 2.5 times the control value. If APS is confirmed, low-dose aspirin may be added. Other considerations include planning for perioperative anticoagulation bridging following revascularization and screening for JAK2 and MPL mutations to rule out a myeloproliferative neoplasm. It is also important to check for potential drug-drug interactions that could affect medications such as rivaroxaban. UFH has an advantage of being rapid reversed with protamine.\n\nBased on the Sydney criteria for diagnosis, an antiphospholipid antibody panel including lupus anticoagulant (LA), anticardiolipin (aCL) antibodies, and anti-beta2 glycoprotein I (anti-beta2GPI) antibodies should be ordered. The significance of this testing is underscored by the recommendation to repeat it after 12 weeks to confirm a persistent positive result. Additionally, given the patient's low blood pressure of 92/58 mmHg, prompt resuscitation is necessary. Other considerations in management include the possibility of catheter-directed thrombolysis or thrombectomy, as well as malignancy screening with imaging such as a CT scan and the use of tumor markers.\n\n\n\nSince high DOAC levels are typically linked to bleeding rather than clotting, the persistence of arterial thrombosis in this context indicates pharmacodynamic failure or an underlying hypercoagulable state. Antiphospholipid syndrome is the most established scenario in which DOACs fail, particularly for arterial events, as supported by the International Society on Thrombosis and Hemostasis recommendations. Other possibilities include occult malignancy or myeloproliferative neoplasm. Atherosclerotic in-situ thrombosis is possible but less consistent with her recurrent embolic pattern.\nThe immediate management of acute mesenteric ischemia in this patient requires discontinuation of rivaroxaban and prompt initiation of intravenous unfractionated heparin, as recommended by the American College of Chest Physicians, given its rapid titratability and reversibility. Urgent endovascular revascularization should be pursued as the first-line intervention in the absence of peritonitis or bowel necrosis, with surgical exploration reserved for cases of suspected or confirmed necrosis. If urgent intervention is required and the bleeding risk is high, rivaroxaban reversal with andexanet alfa is preferred, with 4-factor prothrombin complex concentrate as a second-line agent if andexanet is unavailable. Supportive care measures include aggressive fluid resuscitation to optimize visceral perfusion, initiation of broad-spectrum antibiotics to reduce the risk of sepsis, and close monitoring of hemodynamics and lactate levels. Early multidisciplinary involvement, including vascular surgery, interventional radiology, gastroenterology, and critical car,e is essential. Long-term secondary prevention requires discontinuation of direct oral anticoagulant therapy if antiphospholipid antibody syndrome is confirmed, with transition to warfarin in accordance with EULAR and European Society of Cardiology guidelines. INR targets are  2.5-3.5 for APS or 2-3 for AF per these guidelines."}
{"datasetId":"622d6dc0-d5ac-4824-8670-828126e90ec6","query":"You're asked to see a 61-year-old man on hemodialysis for 4 years with recurrent hyperkalemia. Over 6 months, he had six ED visits with K 5.8-6.4 mEq/L despite thrice-weekly dialysis. Each time, pre-dialysis labs showed K 5.9-6.2, post-dialysis 3.8-4.1. His dry weight was decreased from 72kg to 68kg over this period for \"fluid control.\" Medications include lisinopril 10mg daily (continued from pre-dialysis days), carvedilol 12.5mg BID, sevelamer 800mg TID, and sodium polystyrene as needed. Notably, lisinopril dose was never adjusted when dry weight decreased. Recent Kt/V averaged 1.6, urea reduction ratio 72%. Between episodes, he reports muscle cramps and post-dialysis fatigue requiring 2-hour naps. Last admission showed Na 138, K 6.1, Cr 8.9, glucose 102, bicarbonate 22. What explains the persistent hyperkalemia despite adequate dialysis clearances, and what medication adjustment is most critical?","rubric":{"id":"esrd-hyperkalemia-evaluation","sections":[{"id":"clinical-mechanism-explanation","title":"Physiologic Mechanism Explanation","criteria":[{"id":"identifies-acei-hyperkalemia","weight":12,"requirement":"Identifies lisinopril (ACE inhibitor) as causing hyperkalemia via aldosterone suppression"},{"id":"explains-colonic-k-excretion","weight":4,"requirement":"Explains colonic potassium excretion as major extra-renal pathway in ESRD"},{"id":"aldosterone-mechanism","weight":8,"requirement":"States that aldosterone stimulates colonic (and renal) K+ excretion"},{"id":"volume-distribution-effect","weight":6,"requirement":"Mentions dry weight loss leading to higher ACEi concentration"},{"id":"acidosis-contribution","weight":2,"requirement":"Mentions mild metabolic acidosis as contributing factor"},{"id":"extrarenal-k-secretion","requirement":"Explains that in ESRD most K excretion is done via extrarenal mechanisms","weight":6}]},{"id":"treatment-rationale","title":"Medication Adjustment Priority","criteria":[{"id":"primary-adjustment-lisinopril","weight":15,"requirement":"States lisinopril discontinuation as most critical adjustment"},{"id":"provides-alternative-meds","weight":10,"requirement":"Provides specific non-RAS blocking alternatives (amlodipine, hydralazine)"}]},{"id":"clinical-reasoning-depth","title":"Clinical Reasoning Completeness","criteria":[{"id":"interdialytic-accumulation","weight":6,"requirement":"Explains that the dialysis is working effectively using Kt/V and URR"}]}]},"goldenResponse":"Although dialysis' clearance is adequate as evidenced by (Kt/V of 1.6, URR 72%) and K+ returning to WNL after treatments, the K+ rises to unhealthy levels between the TIW treatments, indicating persistent hyperkalemia. Based on the patients labs and current medication regimen, the most likely culprit is ACE-i induced reduced aldosterone secretion leading to reduced colonic excretion of K+ between dialysis treatments: In kidney failure, the primary mechanism of K+ excretion in the body shifts from the kidneys to the colon, and colonic K+ excretion's strongest physiologic regulator is aldosterone. Our patient's lisinopril dose was not readjusted after a drop in dry weight, leading to elevated plasma concentrations of the drug. Since our relatively high-dose lisinopril is inhibiting aldosterone production, the major stimulus for K+ excretion is missing, leading to accumulation of K+ between dialysis treatments. There is some small residual kidney function, and renal excretion of K+ is also inhibited by aldosterone. Aldosterone stimulates colonic (and renal) K+ excretion. Borderline metabolic acidosis (HCO3 of 22) could also contribute to this hyperkalemia, although the effect is likely minimal in this patient.\n\n\nThe most critical medication adjustment to make in our patient is immediate discontinuation of lisinopril as hyperkalemia can be fatal, if BP control is still warranted consider replacement with a non-RAS-blocking antihypertensive agent that won't cause K+ buildup, such as a dihydropyridine CCB (e.g. amlodipine) or direct vasodilator (e.g. hydralazine)."}
{"datasetId":"d7eea46c-2a90-4feb-85ca-051971898e70","query":"52-year-old woman brought in by EMS with confusion and polyuria over 3 weeks. Three months prior, underwent total parathyroidectomy for Ca 12.8 mg/dL with PTH 92 pg/mL. Intraoperative PTH dropped appropriately. Post-op Ca normalized to 9.2 mg/dL, PTH became undetectable. Two weeks ago, repeat Ca 11.6 mg/dL, PTH <3 pg/mL. Symptoms began after starting 30mg cinacalcet daily by endocrinology. Vitals afebrile, BP 108/72. Current labs: Ca 12.9, albumin 3.8, creatinine 1.3 (baseline 0.9), 25-OH vitamin D 28, 1,25-OH vitamin D 92, PTHrp pending. Phosphorus 2.1, magnesium 1.9. MEN1 genetic testing negative. Recent bone scan showed diffuse uptake. Given undetectable PTH post-parathyroidectomy and rising calcium with cinacalcet, what explains persistent hypercalcemia and what test clarifies the mechanism?","rubric":{"id":"post-parathyroidectomy-hypercalcemia-evaluation","sections":[{"id":"pathophysiology-identification","title":"Pathophysiology Identification","criteria":[{"id":"rules-out-pth-mechanism","weight":12,"requirement":"States undetectable PTH or ineffectiveness of Cinacalcet rules out PTH-dependent mechanism"},{"id":"identifies-vitamin-d-mechanism","weight":12,"requirement":"Identifies elevated 1,25-OH vitamin D as evidence of extrarenal 1-α-hydroxylase activity"},{"id":"explains-cinacalcet-ineffectiveness","weight":8,"requirement":"Explains why cinacalcet is ineffective (PTH already suppressed)"},{"id":"distinguishes-pthrp-mechanism","weight":8,"requirement":"Explains PTHrp mechanism would suppress 1,25-OH vitamin D production"}]},{"id":"differential-diagnosis","title":"Differential Diagnosis","criteria":[{"id":"includes-granulomatous-disease","weight":8,"requirement":"Mentions granulomatous disease or sarcoidosis as possible etiology"},{"id":"includes-lymphoma","weight":8,"requirement":"Mentions lymphoma or lymphoproliferative disorder as possible etiology"}]},{"id":"diagnostic-clarification","title":"Diagnostic Clarification Test","criteria":[{"id":"suggests-appropriate-imaging","weight":10,"requirement":"Recommends CT chest/abdomen/pelvis for evaluation"},{"id":"includes-biopsy-recommendation","weight":8,"requirement":"Recommends biopsy of active sites identified on imaging"}]},{"id":"incorrect-statements","title":"Accuracy Penalties","criteria":[{"id":"claims-1-25-d-diagnostic-alone","weight":-15,"requirement":"States elevated 1,25-OH vitamin D alone is diagnostic for granulomatous disease"},{"id":"suggests-inappropriate-test","weight":-8,"requirement":"Recommends PTHrp as the primary clarifying test mechanism"}]}]},"goldenResponse":"Hypercalcemia s/p parathyroidectomy unresponsive to Cinacalcet with near-undetectable PTH suggests PTH-independent mechanism of hypercalcemia. Additionally, elevated 1-25 OH2 D3 with low-normal 25-OH D3 suggests that there is either overproduction of 1-25 OH2 D3 due to increased 1-a-hydroxylase activity (granulomatous disease vs. lymphoma) or decreased breakdown of 1-25 OH2 D3 (CYP24A1 deficiency). PTHrP-secreting tumor is less likely since our patient has elevated 1-25 OH2 D3 and 1-a-hydroxylase activity is normally inhibited in hypercalcemia with no PTH-induced stimulation. Reduced catabolism of VitD is made less likely by acuity of patient's presentation (symptoms over 3 weeks), since CYP24A1 deficiency is a genetic condition which is unlikely to present acutely later in life. \n\nTaking all of this into account, the most likely etiology of the patient's persistent hypercalcemia is increased 1-a-hydroxylase activity by extrarenal activated macrophages: granulomatous disease (sarcoidosis, fungal infection, etc.) vs. lymphoma.\n\nThe most appropriate next test to clarify the mechanism of hypercalcemia (granulomatous disease vs. lymphoma) would be CT chest/abdomen/pelvis. This is by itself not quite diagnostic, but we can follow up with tissue biopsy of observed active sites to rule in either granulomatous disease (non-caseating granulomas with or without organisms on culture) or rule in lymphoma by observing malignant lymphoid cells after immunophenotyping."}
{"datasetId":"b41f34ef-8494-4dba-af5a-d971fae7edb9","query":"You're consulted on a 29-year-old woman with her fifth DKA admission in 8 months. She manages type 1 diabetes with an insulin pump for 14 years. Each admission follows identical pattern: nausea and vomiting for 12-18 hours, pump occlusion alarms overnight, arrival with glucose 380-420 mg/dL, pH 7.15-7.22, beta-hydroxybutyrate 4.2-5.8 mmol/L. Despite pump alarms, she delays ER visits due to rotating 24-hour shifts as a pediatric ICU nurse. Labs show sodium 134, potassium 4.8, creatinine 1.0 on arrival. Pump sites rotated every 3 days per protocol, but she admits using abdomen exclusively for 2 years due to lipodystrophy on thighs/arms. During last admission, interstitial insulin levels were therapeutic but intravascular levels undetectable. She's discharged on identical basal rates each time. Given persistent occlusion alarms despite proper rotation and the pharmacokinetic disconnect, what explains recurrent DKA and how should her pump management be modified?","rubric":{"id":"dka-recurrence-evaluation","sections":[{"id":"pathophysiology-causation","title":"States Pathophysiology & Causation","criteria":[{"id":"primary-cause","weight":6,"requirement":"States that recurrent DKA results from functional insulin delivery failure due to abdominal lipohypertrophy"},{"id":"normal-diffusion","weight":3,"requirement":"Specifies under normal circumstances, subcutaneous insulin diffuses into local capillaries"},{"id":"single-site-trauma","weight":4,"requirement":"Indicates that chronic use of one abdominal site causes repeated tissue trauma that promotes lipohypertrophy"},{"id":"reduced-perfusion","weight":4,"requirement":"States that lipohypertrophy reduces tissue perfusion at the infusion site"},{"id":"impaired-diffusion","weight":4,"requirement":"States that fibrosis at the infusion site impairs insulin diffusion capacity"},{"id":"therapeutic-interstitial","weight":4,"requirement":"States that therapeutic interstitial insulin concentrations occur near the cannula in affected tissue"},{"id":"systemic-deficiency","weight":5,"requirement":"Indicates that plasma insulin remains undetectable, producing a systemic insulin deficiency"}]},{"id":"diagnostic-reasoning","title":"Indicates Diagnostic Reasoning & Differentiation","criteria":[{"id":"alarm-back-pressure","weight":5,"requirement":"States that repeated occlusion alarms reflect back-pressure against resistant/fibrotic tissue"},{"id":"mechanical-occlusion-unlikely","weight":4,"requirement":"Indicates that mechanical occlusion is unlikely because alarms resolve when new sites are used"},{"id":"nonadherence-less-likely","weight":4,"requirement":"Indicates that nonadherence is less likely than delivery failure due to a reproducible physiologic pattern"},{"id":"reproducible-features","weight":4,"requirement":"Lists at least 2 of {recurrent occlusion alarms, recurring laboratory pattern, consistent site-use reports} as reproducible features arguing against nonadherence"},{"id":"functional-failure-definition","weight":3,"requirement":"Defines functional insulin delivery failure as inadequate systemic absorption despite an operational pump"}]},{"id":"evaluation-confirmation","title":"Outlines Evaluation & Confirmation","criteria":[{"id":"exam-mapping","weight":4,"requirement":"Outlines careful mapping of lipohypertrophy on physical examination"},{"id":"ultrasound-if-needed","weight":3,"requirement":"Specifies that ultrasound is used if physical examination requires confirmation of lipohypertrophy"},{"id":"supervised-infusion","weight":6,"requirement":"States that a supervised absorption test is performed to evaluate delivery"},{"id":"non-abdominal-test-site","weight":3,"requirement":"Specifies use of a non-abdominal site for the supervised absorption test"},{"id":"restoration-confirmation","weight":3,"requirement":"Indicates that restoration of systemic absorption is confirmed by the supervised non-abdominal infusion"}]},{"id":"management-rotation","title":"Specifies Management & Rotation Protocol","criteria":[{"id":"avoid-abdomen-6-9-months","weight":4,"requirement":"Specifies avoiding the abdominal insulin injection site for at least 6 to 9 months"},{"id":"rotation-sites","weight":3,"requirement":"Lists at least 2 of {buttocks, thighs, flanks, arms} as acceptable rotation locations"},{"id":"site-spacing","weight":4,"requirement":"Specifies spacing of 1 to 2 cm between consecutive insertion points at a given region"},{"id":"set-change-interval","weight":3,"requirement":"Lists at least 1 of {48 hours, 72 hours} as acceptable set-change intervals within the 48-72-hour range"},{"id":"hardware-options","weight":3,"requirement":"Lists at least 1 of {steel sets, straight Teflon sets} as hardware adjustments to improve delivery at new sites"},{"id":"cannula-length-selection","weight":5,"requirement":"Specifies selecting cannula lengths appropriate for the new rotation sites to optimize delivery"}]},{"id":"safety-nets-backup","title":"Defines Safety Nets & Backup Rules","criteria":[{"id":"untethered-dose","weight":5,"requirement":"Defines an untethered regimen with 25-50% of basal insulin delivered by injection"},{"id":"untethered-risk-reduction","weight":4,"requirement":"States that an untethered regimen reduces risk of rapid DKA during pump failure"},{"id":"immediate-injection-gt250","weight":3,"requirement":"Specifies immediate insulin injection when glucose is persistently above 250 mg/dL"},{"id":"immediate-site-change-gt250","weight":3,"requirement":"Specifies immediate infusion-site change when glucose is persistently above 250 mg/dL"},{"id":"urgent-evaluation-triggers","weight":3,"requirement":"Lists at least 1 of {ketones ≥ 1.5 mmol/L, vomiting} as triggers for urgent evaluation"}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"basal-escalation-fibrosis","weight":-15,"requirement":"States that escalating basal rates is the correct method to force insulin through fibrotic tissue"},{"id":"replace-pump-first","weight":-15,"requirement":"States that pump replacement should occur before any site evaluation or supervised infusion"},{"id":"withhold-basal","weight":-25,"requirement":"Recommends withholding all basal insulin during troubleshooting"},{"id":"home-care-vomiting","weight":-20,"requirement":"States that vomiting during suspected DKA can be managed at home without urgent evaluation"}]}]},"goldenResponse":"This 29-year-old woman's recurrent DKA is best explained by functional insulin delivery failure related to abdominal lipohypertrophy rather than mechanical pump malfunction or nonadherence. Under normal circumstances, insulin infused into subcutaneous tissue diffuses into capillaries and enters systemic circulation. With chronic use of a single site, however, repeated trauma and exposure to high local insulin levels promote lipohypertrophy and fibrosis, which reduce tissue perfusion and impair insulin diffusion capacity. This leads to a disconnect: therapeutic interstitial concentrations are present where the cannula rests, yet plasma insulin levels remain undetectable, producing a systemic deficiency. The repeated occlusion alarms are not evidence of hardware failure but reflect back-pressure against resistant, fibrotic tissue. Mechanical occlusion is unlikely since alarms resolve when new sites are used, and nonadherence is less likely because the patient consistently presents with the same pattern of alarms, lab findings, and reported site use, which supports a reproducible physiologic problem rather than missed doses. \nThe diagnostic approach should include careful mapping of lipohypertrophy on physical exam, with ultrasound if needed, and a supervised infusion at a non-abdominal site to confirm restoration of systemic absorption. Management requires avoiding the abdominal insulin injection site for at least 6 to 9 months, instituting strict site rotation across buttocks, thighs, flanks, or arms with spacing of 1 to 2 cm and set changes every 48 to 72 hours. Hardware adjustments, such as steel or straight Teflon sets and appropriate cannula lengths for new sites, can improve delivery. A temporary \"untethered\" regimen with 25-50% of basal insulin given by injection provides a safety net. This approach ensures that even if the pump fails, the patient still has baseline insulin on board to reduce the risk of rapid DKA. Clear backup rules should be emphasized, including immediate injection and site change for glucose persistently above 250 mg/dL, and urgent evaluation if ketones are 1.5 mmol/L or higher or if vomiting occurs. \n"}
{"datasetId":"d4590215-a892-494f-8811-c31b8ec982a5","query":"67-year-old man keeps getting admitted for hyponatremia over 8 months following kidney transplant. First admission: sodium 128 mEq/L, K 4.2, creatinine 1.1, glucose 102. Discharged after correction to 135 in 24 hours. Second admission 3 months later: sodium 126, developed altered mental status after correction to 138 in 12 hours. Third admission 2 months ago: sodium 124, corrected to 131 over 2 days then discharged. Current admission: sodium 127, K 4.8, creatinine 1.3, glucose 95. Medications include trimethoprim-sulfamethoxazole double strength daily, tacrolimus, mycophenolate, prednisone 5mg, amlodipine 5mg, and omeprazole 20mg. Previous workups showed normal cortisol, TSH, and volume status. Urine sodium 45 mEq/L, osmolality 380 mOsm/kg. Given the recurrent pattern and medication regimen, what explains persistent hyponatremia and how should correction rate be managed considering prior neurologic complication?","rubric":{"id":"post-transplant-hyponatremia-evaluation","sections":[{"id":"pathophysiology","title":"Pathophysiology","criteria":[{"id":"tacrolimus-tubular-effect","weight":9,"requirement":"States that tacrolimus impairs kidney tubule water handling, creating an SIADH-like physiology"},{"id":"trimethoprim-sodium-effect","weight":5,"requirement":"Mentions that trimethoprim blocks distal nephron sodium channels, leading to renal sodium wasting, relative potassium retention, and hyponatremia"},{"id":"drug-interaction","weight":5,"requirement":"States that recurrent hyponatremia after kidney transplant is best explained by the interaction of both tacrolimus and trimethoprim"},{"id":"electrolyte-free-water-retention","weight":4,"requirement":"States that disruption of renal balance causes retention of electrolyte-free water, lowering plasma sodium despite clinical euvolemia"},{"id":"exclusion-endocrine-causes","weight":3,"requirement":"States that both normal thyroid and adrenal function argue against endocrine causes of hyponatremia"}]},{"id":"clinical-features-risks","title":"Clinical Features and Risks","criteria":[{"id":"high-urine-sodium","weight":5,"requirement":"Lists high urine sodium as a laboratory finding consistent with SIADH-like physiology"},{"id":"concentrated-urine","weight":5,"requirement":"Lists concentrated urine as a laboratory finding supporting SIADH-like physiology"},{"id":"neurologic-symptoms","weight":4,"requirement":"Defines that neurologic symptoms developed during overly rapid (>8 mmol/L in 24 hours) sodium correction"},{"id":"brain-osmolyte-adaptation","weight":4,"requirement":"States that chronic hyponatremia leads to reduced intracellular osmolytes in the brain"},{"id":"osmotic-demyelination-mechanism","weight":3,"requirement":"States that rapid correction of chronic hyponatremia causes osmotic water efflux from neurons, precipitating osmotic demyelination"}]},{"id":"diagnostics-distinctions","title":"Diagnostics and Distinctions","criteria":[{"id":"rule-out-thyroid-adrenal","weight":5,"requirement":"Lists normal thyroid and adrenal function as evidence against endocrine causes of hyponatremia"},{"id":"siadh-mimic","weight":4,"requirement":"States that tacrolimus produces a laboratory picture mimicking SIADH"},{"id":"trimethoprim-potassium-effect","weight":3,"requirement":"States that trimethoprim causes relative potassium retention due to sodium channel blockade"},{"id":"medication-induced-etiology","weight":3,"requirement":"States that at least one of the following: {elevated urine sodium, concentrated urine} indicate a drug-induced SIADH-like cause of hyponatremia"},{"id":"chronic-hyponatremia-context","weight":3,"requirement":"States that risk of osmotic demyelination is greatest when correcting chronic hyponatremia"}]},{"id":"management","title":"Management","criteria":[{"id":"stop-trimethoprim-sulfamethoxazole","weight":7,"requirement":"Recommends that trimethoprim-sulfamethoxazole should be stopped due to its role in driving SIADH physiology"},{"id":"prophylaxis-substitution","weight":6,"requirement":"Lists at least 2 of {atovaquone, dapsone after G6PD testing, inhaled pentamidine} as alternative prophylactic agents"},{"id":"correction-limits","weight":6,"requirement":"Recommends that sodium correction should be limited to at least one of the following: {≤8 mmol/L in 24 hours (Endocrine Society) or ≤10 mmol/L (European)}"},{"id":"monitoring-frequency","weight":5,"requirement":"States that serum sodium should be checked every 2–4 hours during correction"},{"id":"supportive-measures","weight":5,"requirement":"Lists at least 2 of {fluid restriction, oral salt tablets, oral urea} as supportive measures for chronic hyponatremia management"}]},{"id":"prognosis-risk","title":"Prognosis and Risk","criteria":[{"id":"high-risk-classification","weight":4,"requirement":"States that prior overly rapid correction with neurologic symptoms places the patient in a high-risk group"},{"id":"catastrophic-complication","weight":4,"requirement":"States that osmotic demyelination causes irreversible neurologic injury "}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"misattributing-cause","weight":-15,"requirement":"States hyponatremia is attributed to endocrine disease instead of tacrolimus/trimethoprim drug effects"},{"id":"continuing-trimethoprim","weight":-20,"requirement":"Recommends trimethoprim-sulfamethoxazole be continued despite recurrent hyponatremia"},{"id":"correcting-sodium-too-rapidly","weight":-25,"requirement":"Recommends sodium be raised by > 8 mmol/L in 24 hours (especially >12 mmol/L in <24 hours)"},{"id":"using-vaptans-indiscriminately","weight":-15,"requirement":"Lists vaptans as first-line therapy in transplant patients"},{"id":"failing-to-monitor-sodium","weight":-20,"requirement":"Omits needs for sodium monitoring every 2–4 hours during IV saline correction"}]}]},"goldenResponse":"This patient's repeated hospitalizations for low sodium after his kidney transplant are best explained by the interaction of his medications rather than by an underlying endocrine problem. Tacrolimus can interfere with kidney tubule function and impair the ability to excrete water, creating a picture similar to SIADH. In addition, trimethoprim, which he takes for infection prophylaxis, blocks sodium channels in the distal nephron, which leads to sodium loss, relative potassium retention, and a stronger tendency toward hyponatremia. The finding of high urine sodium in the setting of concentrated urine, with normal thyroid and adrenal function, points away from endocrine causes and instead supports a medication-induced SIADH-like process.\nFrom a physiologic perspective, sodium balance depends on the kidney's ability to both excrete water and reabsorb electrolytes appropriately. When drugs disrupt this balance, as in this case, the kidney retains electrolyte-free water, lowering the plasma sodium concentration even in a patient who looks clinically euvolemic. \nThe most dangerous event in the patient's clinical course was the admission when sodium was corrected too quickly, rising more than 12 mmol/L in less than half a day. Because the brain adapts to chronic hyponatremia by reducing intracellular osmolytes, a rapid rise in extracellular tonicity pulls water out of neurons and can trigger osmotic demyelination, a catastrophic neurologic complication that has the potential to cause irreversible damage. Having already shown neurologic symptoms during that event, he is now considered high risk.\nIn management, trimethoprim-sulfamethoxazole should be stopped immediately given its role in driving SIADH physiology, and prophylaxis switched to either atovaquone or dapsone (after confirming normal G6PD status); inhaled pentamidine is reserved as a third-line option if both are unsuitable. In addition, serum sodium should be adjusted carefully. The Endocrine Society recommends a correction limit of no more than 8 mmol/L in 24 hours, and the European Renal Best Practice group allows up to 10 mmol/L, but in his case the safer goal is 6 mmol/L or less in 24 hours with checks every 2-4 hours. Supportive measures include fluid restriction, salt tablets, or oral urea, with vaptans reserved for select cases because of concerns in transplant patients. In summary, his recurrent hyponatremia is best explained by tacrolimus and trimethoprim-induced SIADH physiology, and his management must emphasize cautious, closely monitored correction to avoid further neurologic injury."}
{"datasetId":"90bbca06-acbf-4eef-89b8-c5a978bb4612","query":"Looking through records, this 67-year-old man was admitted 10 days after drug-eluting stent placement with fatigue and dark urine. He'd been taking dual antiplatelet therapy with aspirin and ticlopidine 250mg BID for 9 days. Initial labs showed platelets 42, hemoglobin 8.7 with schistocytes, creatinine 1.4 from baseline 1.0, LDH 950. Two days prior, his platelets were 165 at cardiology follow-up. He's a machinist who returned to work immediately after discharge. Vitals stable except BP 165/92. Neurologic exam reveals mild confusion with word-finding difficulty. Liver enzymes normal, bilirubin 2.8. Repeat platelets drop to 28 next morning despite stopping ticlopidine. Given the 5-day latency from drug exposure to thrombocytopenia with microangiopathic changes, what testing would differentiate drug-mediated TTP from other causes while plasma exchange is being arranged?","rubric":{"id":"ttp-testing-differential","sections":[{"id":"pathophysiology","title":"Pathophysiology","criteria":[{"id":"adamts13-autoantibodies","weight":7,"requirement":"States that ticlopidine can trigger inhibitory autoantibodies against ADAMTS13"},{"id":"severe-deficiency-threshold","weight":6,"requirement":"States that pathologic effects occur when ADAMTS13 activity falls below about 10 percent"},{"id":"microvascular-thrombosis","weight":4,"requirement":"States that uncleaved von Willebrand factor multimers cause diffuse platelet aggregation and microvascular thrombosis"},{"id":"organ-manifestations","weight":3,"requirement":"Lists at least 3 of {thrombocytopenia, microangiopathic hemolytic anemia, acute renal injury, neurologic impairment} as clinical consequences of microvascular thrombosis in ticlopidine-induced TTP"}]},{"id":"clinical-features","title":"Clinical Features and Timing","criteria":[{"id":"symptom-latency","weight":5,"requirement":"States that symptoms of ticlopidine-induced TTP appear within 2 weeks of drug exposure"},{"id":"persistence-withdrawal","weight":5,"requirement":"States that persistence of thrombocytopenia despite stopping ticlopidine indicates an antibody-mediated inhibition of ADAMTS13 rather than direct drug toxicity"},{"id":"ttp-pentad","weight":4,"requirement":"Lists at least 4 of {thrombocytopenia, microangiopathic hemolytic anemia, renal dysfunction, neurologic impairment, fever} as hallmark features"},{"id":"rapid-platelet-decline","weight":3,"requirement":"States that rapid platelet decline is characteristic of TTP"},{"id":"clinical-trigger","weight":3,"requirement":"States that recent ticlopidine exposure is a key clinical trigger"}]},{"id":"diagnostic-distinctions","title":"Diagnostic Distinctions","criteria":[{"id":"key-test-adamts13","weight":6,"requirement":"States that ADAMTS13 activity measurement with inhibitor testing is the single most useful test"},{"id":"differentiate-ahus","weight":5,"requirement":"States that atypical hemolytic uremic syndrome usually demonstrates normal or only mildly reduced ADAMTS13 activity"},{"id":"differentiate-dic","weight":4,"requirement":"States that disseminated intravascular coagulation shows abnormal coagulation parameters"},{"id":"confirmatory-utility","weight":2,"requirement":"States that confirming ADAMTS13 activity below 10 percent with an inhibitor assay is the most definitive way to diagnose ticlopidine-induced TTP"}]},{"id":"management","title":"Management","criteria":[{"id":"immediate-plasma-exchange","weight":7,"requirement":"States that plasma exchange is the immediate and lifesaving therapy"},{"id":"plasma-exchange-mechanism","weight":3,"requirement":"States that plasma exchange removes circulating inhibitory antibodies against ADAMTS13"},{"id":"no-delay-therapy","weight":5,"requirement":"States that treatment must not be delayed while awaiting ADAMTS13 test results"},{"id":"guideline-alignment","weight":3,"requirement":"States that international guidelines recommend empiric plasma exchange in suspected ticlopidine-induced TTP"},{"id":"concurrent-testing","weight":3,"requirement":"States that ADAMTS13 assays should be sent while plasma exchange is initiated"},{"id":"plasma-exchange-mechanism","requirement":"States that plasma exchange replenishes functional ADAMTS13 levels","weight":3}]},{"id":"clinical-imperatives","title":"Clinical Imperatives","criteria":[{"id":"early-recognition","weight":4,"requirement":"States that early recognition of drug-induced TTP is critical for patient survival"},{"id":"understanding-pathophysiology","weight":3,"requirement":"States that management is guided by understanding that uncleaved von Willebrand factor multimers drive microvascular clot formation"},{"id":"empiric-treatment-justification","weight":3,"requirement":"Lists at least 2 of {clinical features, rapid platelet decline, recent ticlopidine exposure} as justification for empiric initiation of plasma exchange"},{"id":"long-term-guidance","weight":2,"requirement":"States that confirmatory testing guides long-term management after stabilization"}]}]},"goldenResponse":"This patient's presentation is most consistent with ticlopidine-induced thrombotic thrombocytopenic purpura (TTP), and the single most useful test to distinguish it from other thrombotic microangiopathies (TMAs) is measurement of ADAMTS13 activity with inhibitor testing. Ticlopidine can trigger an immune response leading to the formation of inhibitory autoantibodies against ADAMTS13, the enzyme that normally cleaves von Willebrand factor multimers and prevents excessive voon Willebrand factor activation leading to coagulation. When ADAMTS13 activity falls below about 10 percent, these multimers persist, causing diffuse platelet aggregation, microvascular thrombosis, and subsequent thrombocytopenia, microangiopathic hemolytic anemia, renal dysfunction, and neurologic impairment. The timing is also characteristic, with symptoms appearing within 2 weeks of ticlopidine exposure, and the persistence of thrombocytopenia despite stopping the drug points toward an antibody-mediated process rather than direct toxicity. \nWhile other TMAs such as atypical hemolytic uremic syndrome, malignant hypertension, or disseminated intravascular coagulation may share overlapping features, they usually demonstrate normal or only mildly reduced ADAMTS13 activity, abnormal coagulation parameters, or clear evidence of severe uncontrolled hypertension. Therefore, confirming severe ADAMTS13 deficiency with an inhibitor is the most definitive way to differentiate ticlopidine-induced TTP from these other etiologies. Importantly, treatment must not be delayed while awaiting test results, as plasma exchange remains the immediate and lifesaving therapy. Plasma exchange both removes circulating inhibitory antibodies and replenishes functional ADAMTS13, reversing the pathologic cascade. \nThis case highlights the importance of recognizing drug-induced TTP early, understanding the pathophysiology that drives microvascular clot formation, and initiating plasma exchange promptly while confirmatory testing is pursued. Current international guidelines emphasize that the combination of clinical features, rapid decline in platelets, and history of ticlopidine exposure should be sufficient to justify empiric plasma exchange while simultaneously sending ADAMTS13 activity and inhibitor assays to confirm the diagnosis and guide long-term management.\n"}
{"datasetId":"3655f336-3dcc-4c8f-b34c-b3d9c13ef084","query":"You're asked to see a 67-year-old woman with her fourth C. difficile admission in 8 months. Initial episode followed clindamycin for dental abscess, treated with vancomycin 125mg QID for 10 days. Relapse occurred 3 weeks later, treated with fidaxomicin 200mg BID for 10 days. Third episode 6 weeks post-fidaxomicin, treated with vancomycin taper. Now presents 2 weeks after completing taper with watery diarrhea 8-10 times daily, abdominal cramping. Vitals: afebrile, HR 92, BP 118/74, SpO2 96% RA. WBC 14.8 with 18% bands, creatinine 1.2 (baseline 0.9), albumin 2.8. Stool antigen and toxin PCR positive. Lives with immunocompromised husband receiving chemotherapy, works as elementary school librarian. Previous gastroenterology consultation recommended considering FMT but scheduled colonoscopy delayed due to insurance requiring step therapy. Given the pattern of recurrence despite fidaxomicin and vancomycin taper, what factors should guide selection between colonoscopy-delivered versus capsule-delivered FMT in this immunocompromised household?","rubric":{"id":"cdiff-fmt-route-evaluation","sections":[{"id":"disease-severity-risk","title":"Disease Severity and Risk","criteria":[{"id":"severe-cdi-features","weight":5,"requirement":"Lists at least 3 of {leukocytosis, bandemia, rising creatinine, hypoalbuminemia} as markers of severe CDI"},{"id":"higher-failure-risk","weight":5,"requirement":"States that severe CDI carries higher risk of treatment failure and recurrence if less intensive approaches are used"},{"id":"rapid-colonization","weight":4,"requirement":"States that colonoscopy promotes rapid colonization of microbiota"},{"id":"real-time-inspection","weight":4,"requirement":"States that colonoscopy allows real-time inspection of the colon for complications such as colitis or pseudomembranes"},{"id":"clinical-complications","weight":3,"requirement":"Lists at least 2 of {colitis, pseudomembranes} as potential complications assessable during colonoscopy"}]},{"id":"comparative-efficacy","title":"Comparative Efficacy","criteria":[{"id":"meta-analysis-evidence","weight":6,"requirement":"States that meta-analyses show colonoscopy achieves higher cure rates and lower recurrence compared to capsules"},{"id":"durable-repopulation","weight":4,"requirement":"Specifies colonoscopy is preferred when durable microbiota repopulation is critical"},{"id":"capsule-recurrence","weight":4,"requirement":"Indicates capsule FMT has slightly higher recurrence in severe disease"},{"id":"gradual-repopulation","weight":3,"requirement":"States capsule FMT relies on gradual repopulation of microbiota"},{"id":"colonoscopy-advantages","weight":5,"requirement":"Lists at least 3 of {large inoculum, rapid colonization, direct delivery to colon, real-time inspection} as benefits of colonoscopy"}]},{"id":"household-infection-control","title":"Household and Infection Control","criteria":[{"id":"immunocompromised-husband","weight":5,"requirement":"Mentions patient's husband is immunocompromised"},{"id":"rare-mdro-risk","weight":5,"requirement":"States that FMT has rare cases of multidrug-resistant organism transmission"},{"id":"donor-screening","weight":4,"requirement":"Specifies that strict donor screening is required to prevent transmission of multidrug-resistant organisms"},{"id":"environmental-hygiene","weight":4,"requirement":"States environmental hygiene is required to protect household contacts"}]},{"id":"guidelines-recommendations","title":"Guidelines and Recommendations","criteria":[{"id":"acg-threshold","weight":5,"requirement":"States American College of Gastroenterology supports FMT after ≥2 recurrences"},{"id":"acg-route-factors","weight":4,"requirement":"States ACG advises route selection based on severity, patient preference, and local resources"},{"id":"escmid-tailoring","weight":4,"requirement":"States European Society of Clinical Microbiology and Infectious Diseases recommends tailoring route by clinical and logistical factors"},{"id":"guideline-organizations","weight":4,"requirement":"Lists at least 2 of {ACG, ESCMID} as providing recommendations on FMT"},{"id":"guideline-concordant-choice","weight":6,"requirement":"States both that the patient's severity of CDI and repeated relapses despite antibiotics support colonoscopy-delivered FMT"}]},{"id":"case-specific-application","title":"Case-specific Application","criteria":[{"id":"recurrent-disease","weight":5,"requirement":"Notes patient has recurrent CDI despite guideline-directed antibiotics"},{"id":"colonoscopy-selection","weight":5,"requirement":"Designating colonoscopy-delivered FMT as the preferred treatment route in this case"},{"id":"infection-control-condition","weight":4,"requirement":"Specifies colonoscopy-delivered FMT must be accompanied by rigorous infection control measures"},{"id":"contextual-factors","weight":4,"requirement":"Lists at least 2 of {disease severity, relapse history, household risks} as influencing decision for colonoscopy route"},{"id":"household-protection","weight":4,"requirement":"Lists at least 2 of {donor screening, protective equipment, environmental hygiene} as infection control measures that safeguard the immunocompromised husband"}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"ignoring-infection-control","weight":-16,"requirement":"Omitting infection control measures for household with immunocompromised contacts"},{"id":"minimizing-severity","weight":-11,"requirement":"Suggesting severity markers (leukocytosis, bandemia, creatinine, hypoalbuminemia) are not relevant for route selection"}]}]},"goldenResponse":"In this patient with recurrent and severe Clostridioides difficile infection (CDI), the choice of fecal microbiota transplantation (FMT) route requires weighing disease severity, patient-specific risks, and household context. \nColonoscopy-delivered FMT is favored here because severe CDI with leukocytosis, bandemia, rising creatinine, and hypoalbuminemia carries a higher risk of treatment failure and recurrence if less intensive approaches are used. Colonoscopy allows direct delivery of a large, concentrated inoculum to the colon, promotes rapid colonization, and enables real-time inspection and management of potential complications such as colitis or pseudomembranes. Meta-analyses demonstrate that colonoscopy achieves higher cure rates and lower recurrence in severe or complicated CDI compared to capsules, making it the preferred route when durable repopulation of microbiota is critical. \nCapsule FMT, while attractive for its convenience and noninvasiveness, tends to show slightly higher recurrence in severe disease and relies on gradual microbiota repopulation, which may not be sufficient in the context of this patient's marked dysbiosis and vulnerability. Importantly, her immunocompromised husband underscores the need for meticulous infection control and enhanced donor screening, as rare cases of multidrug-resistant organism transmission have been reported with FMT. This risk mandates strict adherence to donor selection protocols, personal protective measures, and environmental hygiene to protect household contacts. Current American College of Gastroenterology guidelines support FMT after two or more recurrences, with route selection guided by disease severity, patient preference, and local resources, while the European Society of Clinical Microbiology and Infectious Diseases emphasizes tailoring the approach based on both clinical and logistical factors. In this case, the severity of her infection and her repeated relapses despite guideline-directed antibiotics support colonoscopy-delivered FMT, provided infection control measures are rigorously observed to safeguard her husband.\n"}
{"datasetId":"4bf3cf85-fa36-43a0-9cfe-6cb73e98efe2","query":"You're consulted on a 67-year-old woman admitted with bilateral leg pain and cyanosis. Three days prior, she'd completed 7 days of therapeutic heparin for bilateral DVTs discovered during pre-op evaluation for knee replacement. Platelet count dropped from baseline 285 to 89 on day 8 of heparin, but therapy continued as attributed to catheter-related thrombocytopenia. Pain escalated despite transition to argatroban 2 mcg/kg/min when platelets fell further to 42. Over 24 hours, legs developed mottled discoloration extending to thighs. Vitals: afebrile, BP 102/68, HR 108, SpO2 96% RA. Labs: creatinine 2.3 (baseline 1.1), INR 3.2 on warfarin started 36 hours ago, platelets 38, hemoglobin 8.7. D-dimer >20,000. Duplex shows extending thrombosis despite therapeutic argatroban levels. What explains the paradoxical progression of thrombosis with limb ischemia despite appropriate anticoagulation, and how should anticoagulation be modified given her renal dysfunction?","rubric":{"id":"hit-warfarin-complex-evaluation","sections":[{"id":"diagnostic-accuracy","title":"Pathophysiology of HIT and Warfarin Interaction","criteria":[{"id":"hit-antibodies","weight":8,"requirement":"States that heparin exposure leads to antibodies against platelet factor 4–heparin complexes"},{"id":"platelet-activation","weight":7,"requirement":"States that HIT antibodies activate platelets, resulting in at least one of the following: {thrombocytopenia, thrombosis}"},{"id":"timing-of-hit","weight":5,"requirement":"Specifies that the platelet fall typically occurs 5–10 days after heparin exposure"},{"id":"platelet-drop-evidence","weight":5,"requirement":"Mentions platelet count decreased from 285 to 42 with progressive thrombosis"},{"id":"warfarin-protein-c-depletion","weight":7,"requirement":"States that warfarin rapidly depletes protein C due to its shorter half-life"},{"id":"microvascular-thrombosis","weight":6,"requirement":"Indicates that protein C depletion in HIT leads to at least one of: {microvascular thrombosis, limb ischemia}"}]},{"id":"clinical-presentation","title":"Clinical Presentation and Laboratory Findings","criteria":[{"id":"progressive-thrombosis","weight":3,"requirement":"Notes progression of DVT extension despite argatroban"},{"id":"ischemic-changes","weight":3,"requirement":"Mentions mottled ischemic limb changes"},{"id":"d-dimer-elevation","weight":3,"requirement":"States presence of high D-dimer (>500)"},{"id":"thrombocytopenia-severity","weight":3,"requirement":"Mentions platelet nadir of 42, supporting severe HIT-related thrombocytopenia"},{"id":"consumptive-pattern","weight":3,"requirement":"Indicates thrombocytopenia and thrombosis (must reference both) is consistent with immune-mediated HIT"},{"id":"potential-skin-necrosis","weight":3,"requirement":"Mentions risk of skin necrosis as a complication of microvascular thrombosis"}]},{"id":"anticoagulation-management","title":"Anticoagulation Management","criteria":[{"id":"argatroban-choice","weight":6,"requirement":"Indicates argatroban is preferred in renal impairment due to hepatic metabolism"},{"id":"dose-reduction","weight":4,"requirement":"Specifies argatroban dose adjustment to 0.5–1 mcg/kg/min in critical illness/hepatic dysfunction"},{"id":"warfarin-stopped","weight":5,"requirement":"States that warfarin must be discontinued immediately"},{"id":"vitamin-k-reversal","weight":5,"requirement":"Mentions use of vitamin K to restore protein C activity"},{"id":"overlap-protocol","weight":7,"requirement":"Specifies warfarin reintroduction only after platelet recovery >150k with ≥5-day overlap and INR ≥2 for 2 days"}]},{"id":"clinical-reasoning","title":"Clinical Reasoning and Interpretation","criteria":[{"id":"explains-paradox","weight":5,"requirement":"States that thrombosis worsens despite argatroban due to premature warfarin initiation"},{"id":"early-hypercoagulability","weight":5,"requirement":"Mentions transient hypercoagulable state caused by protein C depletion before procoagulant factor depletion"},{"id":"argatroban-efficacy","weight":3,"requirement":"States that argatroban is an appropriate anticoagulant choice in HIT patients with renal impairment"},{"id":"contextual-intensity","weight":3,"requirement":"States that the prothrombotic state of HIT is exacerbated by early warfarin initiation"},{"id":"microthrombosis-mechanism","weight":3,"requirement":"Links clinical ischemia to warfarin-induced protein C depletion"},{"id":"potential-tissue-loss","weight":3,"requirement":"States that untreated HIT with warfarin-induced microthrombosis can progress to irreversible tissue loss."}]},{"id":"multidisciplinary-care","title":"Multidisciplinary Care","criteria":[{"id":"hematology-consult","weight":5,"requirement":"Recommends hematology involvement/consult"},{"id":"vascular-surgery","weight":5,"requirement":"Mentions vascular surgery role in ischemic limb management"}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"warfarin-continuation","weight":-20,"requirement":"Recommends continuation of warfarin during thrombocytopenia"},{"id":"no-vitamin-k","weight":-15,"requirement":"Omits vitamin K reversal step after warfarin discontinuation"},{"id":"early-warfarin-restart","weight":-15,"requirement":"Recommends restarting warfarin before platelets >150k or without ≥5-day overlap"}]}]},"goldenResponse":"This 67-year-old woman's paradoxical worsening of thrombosis with bilateral limb ischemia despite therapeutic argatroban is best explained by heparin-induced thrombocytopenia (HIT) complicated by warfarin-induced microthrombosis. HIT occurs when heparin exposure leads to the formation of antibodies against platelet factor 4-heparin complexes, which in turn activate platelets and drive a consumptive but profoundly prothrombotic state. The timing is classic: a platelet fall within 5 to 10 days of heparin use in the setting of new or progressive thrombosis. The patient's drastic drop in platelets from 285 to 42, in conjunction with progressive DVT extension, mottled ischemic changes, and extremely high D-dimer, strongly supports immune-mediated HIT. \nThe paradox lies in the fact that she was appropriately transitioned to argatroban, which is the preferred anticoagulant in patients with renal impairment since it is hepatically metabolized. However, the concurrent initiation of warfarin during severe thrombocytopenia created a transient hypercoagulable state. Warfarin rapidly depletes protein C, a natural anticoagulant with a shorter half-life than procoagulant factors II, IX, and X. This leaves the patient unprotected in the early days of therapy, especially in the context of HIT where the thrombotic drive is already intense. The clinical result is microvascular thrombosis manifesting as limb ischemia, which can evolve into skin necrosis and irreversible tissue loss. The appropriate management is to stop warfarin immediately and administer vitamin K to restore protein C activity. Argatroban should be continued but with dose reduction to 0.5-1 mcg/kg/min in the setting of critical illness and hepatic dysfunction, with close aPTT monitoring to avoid bleeding. Warfarin must not be restarted until platelet recovery is above 150,000, and when it is reintroduced, it must be overlapped with argatroban for at least 5 days with INR >=2 sustained for 2 consecutive days before argatroban is stopped. This strategy ensures continuous anticoagulant protection while avoiding the hypercoagulable window induced by premature warfarin use. Multidisciplinary involvement with hematology, vascular surgery, and critical care is vital to optimize outcomes.\n"}
{"datasetId":"0ce3e3f5-a40e-4a97-a0a1-5cfc60c50547","query":"You're consulted on a 35-year-old man with Crohn's ileocolitis admitted for the third time in 8 months. He works construction and has missed 12 weeks this year. Despite infliximab 5 mg/kg q8 weeks for 1 year, he presents with crampy RLQ pain and 4-5 loose stools daily. Vitals: afebrile, HR 88, BP 118/74, saturating well. Labs show CRP 24 mg/L, albumin 2.8 g/dL, normal CBC. Calprotectin 120 mg/kg (normal <50). MRI shows active terminal ileal inflammation with wall thickening. Previous admission 3 months ago showed therapeutic trough levels 3.2 mcg/mL; current admission shows undetectable trough but negative anti-drug antibodies. Symptom onset consistently occurs 6-7 weeks post-infusion. Given the temporal pattern of response loss and undetectable trough without antibodies, what individualized escalation strategy would optimize his treatment while minimizing future immunogenicity risk?","rubric":{"id":"crohns-infliximab-escalation-evaluation","sections":[{"id":"evidence-mechanism-of-pharmacokinetic-loss","title":"Evidence & Mechanism of Pharmacokinetic Loss","criteria":[{"id":"pk-loss-defined","requirement":"States that pharmacokinetic loss of response is present with undetectable infliximab trough in the absence of anti-drug antibodies. ","weight":7},{"id":"temporal-recurrence","requirement":"Indicates symptom recurrence around 6-7 weeks after infusion occurs. ","weight":7},{"id":"evidence-set","requirement":"Lists at least 3 of undetectable trough levels, absence of anti-drug antibodies, recurrence at 6-7 weeks after infusion, or objective signs of ongoing inflammation as evidence of pharmacokinetic loss of response. ","weight":7},{"id":"inflammation-markers","requirement":"Lists at least 3 of elevated CRP, hypoalbuminemia, elevated fecalcalprotectin, or MRI evidence of ileal wall thickening as objective signs of ongoing inflammation. ","weight":7},{"id":"low-albumin","requirement":"Indicates increased clearance is driven by low albumin","weight":7}]},{"id":"infliximab-optimization-strategy","title":"Infliximab Optimization Strategy","criteria":[{"id":"every-4-weeks-interval","requirement":"Specifies infusion interval shortening to every 4 weeks as the optial individualized strategy. ","weight":7},{"id":"preferred-over-dose-increase","requirement":"Specifies interval shortening is preferred over dose increase. ","weight":5},{"id":"interval-advantages","requirement":"Lists at least 1 of more consistent therapeutic exposure, or reduced peak-trough variability as advatnages of interval shortening.","weight":4},{"id":"immunomodulator-options","requirement":"Lists at least 1 of azathiopurine or methotrexate as the immunomodulator to add. ","weight":5},{"id":"antibody-reduction","requirement":"States combiantion therapy decreases antibody formation. ","weight":5}]},{"id":"therapeutic-drug-monitoring","title":"Therapeutic Drug Monitoring ","criteria":[{"id":"trough-target","requirement":"Defines infliximab trough goal as >5µg/mL","weight":7},{"id":"clinical-remission-link","requirement":"States >5µg/mL is associated with clinical remission. ","weight":4}]},{"id":"molecular-targets","title":"Molecular Targets","criteria":[{"id":"transition-timing","requirement":"Specifies transition after 2-3 optimized infliximab intervals if active disease persists. ","weight":5},{"id":"alternative-biologics","requirement":"Lists at least 1 of ustekinumab or vedolizumab as an alternative biologic. ","weight":5},{"id":"ustekinumab-il-23","requirement":"States ustekinumab blocks IL-23 mediated T-cell activation. ","weight":5},{"id":"vedolizumab-mechansim","requirement":"States vedolizumab prevents gut-specifc lymphocyte trafficking through α4β7 integrin blockade. ","weight":5},{"id":"treat-to-target-markers","requirement":"Indicates treat-to-target addresses objective markers of inflammation. ","weight":5}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"lengthen-interval","requirement":"Says to lengthen the infliximab interval for pharmacokinetic loss of repsonse","weight":-15},{"id":"blocks-wrong-target","requirement":"States vedolizumab blocks IL-12 or IL-23","weight":-10},{"id":"dose-increase","requirement":"Indicates dose increase is superior to interval shortening","weight":-5}]}]},"goldenResponse":"This 35 year old man with Crohn's ileocolitis is demonstrating pharmacokinetic loss of response to infliximab, reflected by undetectable trough levels in the absence of anti-drug antibodies, a clear temporal recurrence of symptoms around weeks six to seven after infusion, and objective signs of ongoing inflammation including elevated CRP, hypoalbuminemia, elevated fecal calprotectin, and MRI evidence of ileal wall thickening. The absence of antibodies indicates that the mechanism is increased clearance driven by high inflammatory burden and low albumin rather than immunogenicity. \nThe optimal individualized strategy is to shorten the infusion interval to every 4 weeks, which provides more consistent therapeutic exposure and reduces peak-trough variability compared with simply increasing the dose. To further reduce the risk of future immunogenicity, an immunomodulator such as azathioprine or methotrexate should be added, as combination therapy has been shown to decrease antibody formation and prolong biologic durability even in patients without antibodies at baseline. Proactive therapeutic drug monitoring (TDM) should be employed with a goal of maintaining infliximab troughs above 5 mcg/mL, the range associated with clinical remission and mucosal healing, and dosing should be adjusted accordingly. \nIf after two to three optimized infliximab intervals the patient continues to have active disease, then transitioning to an alternative biologic such as ustekinumab, which blocks IL-12 and IL-23 mediated T-cell activation, or vedolizumab, which prevents gut-specific lymphocyte trafficking through alpha4beta7 integrin blockade, would be the most appropriate next step. This treat-to-target approach ensures that both symptoms and objective markers of inflammation are addressed, minimizes future risk of immunogenicity, and maximizes long term disease control in a patient whose disease is significantly impacting quality of life and work productivity. Current guidelines support proactive TDM-driven adjustments in cases of pharmacokinetic loss of response, escalation of infliximab to every 4 weeks as the preferred first step, and combination therapy to prevent antibody formation and optimize clinical outcomes.\n"}
{"datasetId":"b062251a-4153-45ca-932d-02bb5f920691","query":"A 70-year-old woman on warfarin 5mg daily for atrial fibrillation is referred to you. She is presenting with 4 days of bleeding gums and nosebleeds. Her INR is 5.8, up from 2.3 one week prior. She started trimethoprim-sulfamethoxazole DS twice daily 3 days ago for dysuria and frequency. She reports no falls, no new medications, and no missed doses.\n\nHere are vitals for reference: temp 37.1°C, HR 82, BP 145/88, saturating well. Labs show Hb 11.2 (baseline 12.8), platelets 220, creatinine 0.9. Vitamin K 2.5mg IV given, but INR remains 4.3 after 24 hours. Her albumin is 3.2 g/dL (baseline 3.8) and liver enzymes are normal. She had a similar episode 8 months ago with amoxicillin-clavulanate where INR peaked at 6.1 and took 5 days to normalize. \n\nWhat delayed metabolic interaction explains the sustained anticoagulation effect despite vitamin K administration and no drug changes beyond antibiotics?","rubric":{"id":"warfarin-tmp-smx-interaction-evaluation","sections":[{"id":"mechansims","title":"Mechansims","criteria":[{"id":"microbiota-suppression","requirement":"Indicates antibiotic-induced suppression of intestinal microbiota reduces endogenous vitamin K production","weight":6},{"id":"vkor-inhibition","requirement":"States warfarin inhibits vitamin K epoxide reductase","weight":6},{"id":"recycling-limited","requirement":"Indicates inhibition limits vitamin K recycling","weight":5},{"id":"factor-synthesis","requirement":"Indicates impaired synthesis of vitamin K-dependent clotting factors, at least 2 of II, VII, IX or X","weight":6},{"id":"exogenous-vk","requirement":"Indicates exogenous vitamin K temporarily replenishes active stores","weight":4}]},{"id":"antibiotic-interaction-risk-modifiers","title":"Antibiotic Interaction & Risk Modifiers","criteria":[{"id":"implicated-antibiotics","requirement":"Lists at least 2 of trimethoprim-sulfamethoxazole, sulfonamides or beta-lactams as antibiotics implicated in the interaction","weight":5},{"id":"broad-spectrum-effect","requirement":"States broad-spectrum agents reduce endogenous vitamin K production","weight":4},{"id":"low-albumin","requirement":"Indicates lower albumin increases free warfarin exposure","weight":5},{"id":"protein-binding","requirement":"States warfarin is highly protein-bound","weight":4}]},{"id":"clinical-course-consequences","title":"Clinical Course & Consequences","criteria":[{"id":"clinical-evidence","requirement":"Lists at least 1 of INR remained elevated after vitamin K administration or delayed INR normalization after similar antibiotic courses as clinical evidence supporting the interaction","weight":5},{"id":"post-course-persistence","requirement":"Indicates the interaction persists beyond the antibiotic course","weight":5},{"id":"flora-timeline","requirement":"Indicates restoration of gut flora takes days to weeks","weight":4},{"id":"bleeding-risk","requirement":"Indicates vulnerability to bleeding despite standard reversal attempts","weight":4}]},{"id":"management","title":"Management","criteria":[{"id":"management-bundle","requirement":"Lists at least 3 of frequent INR checks, temporary warfarin dose reduction, warfarin interruption, or ongoing low-dose vitamin L supplementation as indicated management actions","weight":6},{"id":"vk-supplementation-span","requirement":"Indicates low-dose vitamin K supplementation continues until intestinal flora normalize","weight":5},{"id":"narrow-spectrum-choice","requirement":"Recommends prioritizing narrow-spectrum antibiotics in patients at high bleeding risk","weight":5},{"id":"liver-enzymes","requirement":"States normal liver enzymes rules out impaired clotting factor synthesis from liver disease","weight":5}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"dietary-vk","requirement":"States dietary vitamin K restriction is the primary explanation for sustained anticoagulation in the setting of recent antibiotics","weight":-10},{"id":"inr","requirement":"Indicates INR follow-up can be deferred until symptoms occur","weight":-10}]}]},"goldenResponse":"The patient's sustained anticoagulation effect despite vitamin K administration is best explained by antibiotic-induced suppression of intestinal microbiota, which reduces endogenous vitamin K production and prolongs the pharmacodynamic impact of warfarin. Warfarin acts by inhibiting vitamin K epoxide reductase, limiting the recycling of vitamin K and impairing synthesis of clotting factors II, VII, IX, and X. Although exogenous vitamin K can temporarily replenish active stores, normal coagulation function relies heavily on ongoing intestinal production, which is markedly reduced with broad-spectrum agents such as trimethoprim-sulfamethoxazole. \nThis effect is compounded in patients with lower albumin, since warfarin is highly protein-bound and even small reductions in binding capacity increase free drug exposure. Clinically, this explains why her INR remained elevated after vitamin K was administered and why similar antibiotic courses previously resulted in delayed INR normalization. Recovery is prolonged because restoration of gut flora typically takes several days to weeks, leaving the patient vulnerable to bleeding despite standard reversal attempts. This delayed interaction is well documented, particularly with sulfonamides and beta-lactams, and differs mechanistically from hepatic dysfunction, as her normal liver enzymes rule out impaired clotting factor synthesis from liver disease. \nIn practice, management requires frequent INR checks, temporary warfarin dose reduction or interruption, and in some cases ongoing low-dose vitamin K supplementation until intestinal flora normalize. This case highlights the importance of recognizing that antibiotic-warfarin interactions may persist beyond the antibiotic course, and narrow-spectrum antibiotics should be prioritized whenever possible in patients at high bleeding risk. \n"}
{"datasetId":"2bce1865-0c02-4216-9a82-887fb603874d","query":"A 28-year-old woman presents with 4 days of bilateral thigh and calf cramping that prevents her from completing her usual 12-hour nursing shifts. Started monthly galcanezumab 240mg for migraines 4 months ago with headache frequency halved from 8 to 4 monthly episodes. Denies new exercise, statins, or trauma. Vitals afebrile, BP 112/68, HR 84. CK peaked at 2500 U/L (baseline unknown), AST 156, ALT 142, creatinine 0.8, glucose 92. Aldolase 18 U/L, lactate 1.8 mmol/L. Creatinine kinase remained elevated at 1800 U/L after 3 weeks despite stopping galcanezumab. Had similar but milder cramping with erenumab 3 years ago that resolved within 2 weeks of discontinuation. What monoclonal antibody-specific mechanism explains this delayed, persistent muscle injury given the CGRP receptor antagonism and previous similar reaction to a related drug class?","rubric":{"id":"cgrp-myopathy-mechanism-evaluation","sections":[{"id":"section-1757725857135","title":"New Section","criteria":[{"id":"erenumab-target","requirement":"States that erenumab is a monoclonal antibody that antagonizes the CGRP receptor complex. ","weight":5},{"id":"galcanezumab","requirement":"States that galcanezumab is a monoclonal antibody that antagonizes the CGRP ligand. ","weight":5},{"id":"perfusion-reserve","requirement":"States that CGRP normally promotes skeletal muscle microvascular dilation to increase perfusion reserve","weight":6},{"id":"energy-metabolism","requirement":"States that CGRP enhances mitochondrial oxidative phosphorylation efficiency to support muscle metabolism. ","weight":5},{"id":"myocyte-repair","requirement":"States that CGRP released from motor neurons provides at least 1 of trophic or repair effects on muscle","weight":5},{"id":"during-of-activity","requirement":"States that prolonged activity (like long nursing shifts) can lead metabolic distress on muscle","weight":5},{"id":"muscle-recovery","requirement":"States that CGRP monoclonal antibodies can result in impaired muscle repair","weight":5},{"id":"relative-ischemia","requirement":"States that reduced perfusion reserve with CGRP monoclonal antibodies leads to relative muscle ischemia","weight":5}]},{"id":"states-clinical-manifestations-and-course","title":"States Clinical Manifestations and Course","criteria":[{"id":"symptom-spectrum","requirement":"Lists at least 2 of cramps, spasms, myalgia, fatigue, muscle weakness, or structural muscle injury as side effects of the medications","weight":5},{"id":"ck-peak","requirement":"States that CK peaked at 2500 U/L on galcanezumab ","weight":4},{"id":"ck-persistence","requirement":"States that CK remained elevated at 1800 U/L 3 weeks after galcanezumab cessation","weight":4},{"id":"transaminase-rise","requirement":"States that AST 156 and ALT 142 reflect muscle injury","weight":4}]},{"id":"section-1757727612132","title":"New Section","criteria":[{"id":"galcanezumab-half-life","requirement":"Specifies that CGRP monoclonal antibodies have half-lives of 27-28 days","weight":5},{"id":"delayed-onset","requirement":"Indicates that onset of muscle symptoms can be delayed after therapy initiation (four months after starting galcanezumab)","weight":4},{"id":"prolonged-offset","requirement":"States that persistent symptoms after discontinuation are due to long half-life","weight":4},{"id":"reactions","requirement":"States that patient had persistent symptoms for 2 weeks after discontinuing erenumab and 3 weeks after discontinuing galcanezumab","weight":4}]},{"id":"diagnostic-distinctions","title":"Diagnostic Distinctions","criteria":[{"id":"class-effect","requirement":"States that reactions to both erenumab and galcanezumab suggest CGRP class effect","weight":6},{"id":"not-immune-or-hypersensitivity","requirement":"States that mechanism is not immune-mediated or hypersensitivity related","weight":4}]},{"id":"prognosis-and-implications","title":"Prognosis and Implications","criteria":[{"id":"ck-trajectory","requirement":"States that CK can remain elevated for weeks due to antibody persistence","weight":5},{"id":"risk-of-recurrence","requirement":"States that recurrence with two different agents supports risk across all CGRP inhibitors.","weight":4},{"id":"clinical-implications","requirement":"States that ischemic myopathy is a predictable risk when blocking CGRP signaling in muscle","weight":4}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"labels-as-immune-myositis","requirement":"Misdiagnoses as autoimmune polymyositis and recommends immunosuppression ","weight":-20},{"id":"continues-antibody-therapy","requirement":"Continues galcanezumab despite persistent CK elevation and symptoms","weight":-20},{"id":"orders-muscle-biopsy","requirement":"Recommends invasive biopsy before discontinuing offending monoclonal antibody","weight":-15},{"id":"recommends-switch-to-other-cgrp-drug","requirement":"Recommends switch to another CGRP monoclonal antibody to try","weight":-20}]}]},"goldenResponse":"Erenumab is a monoclonal antibody that antagonizes the calcitonin gene-related peptide (CGRP) receptor, and Galcanezumab is a monoclonal antibody that antagonizes the CGRP ligand. The most likely explanation for this patient's persistent muscle injury is disruption of normal CGRP-mediated neuromuscular physiology. CGRP is known to promote microvascular dilation of skeletal muscle. When either the ligand or receptor of CGRP is blocked, perfusion reserve to the muscle may be decreased, leading to relative ischemia and metabolic distress during sustained activity, like a long nursing shift. CGRP also provides mitochondrial and metabolic support by enhancing oxidative phosphorylation efficiency. Antagonism, therefore, can lead to myocyte injury during stress via impaired energy metabolism. CGRP is also released from motor neurons and provides trophic or repair effects on the muscle. A blockade via these monoclonal antibodies can impair healing of the myocytes after injury. In summary, the disruption of muscle perfusion and metabolism can lead to ischemic myopathy, causing elevations in CK and transaminases, as seen in the his patient (CK peak at 2500 U/L, AST 156, ALT 142). Clinically, this results in muscle cramping and spasming, weakness, and fatigue.\n\n\n\nThese antibodies have very long half-lives (27-28 days). This means that their onset is delayed and their offset can be prolonged. This explains why the patient developed symptoms 4 months after starting Galcanezumab, and why her symptoms persisted for two weeks after stopping Erenumab and her CK remained high (1800) three weeks after stopping Galcanezumab.\n\n\n\nBecause the patient had a similar reaction to both monoclonal antibodies, this suggests a class effect from CGRP pathway inhibition, as opposed to an immune-mediated myopathy or hypersensitivity reaction to either medication."}
{"datasetId":"7c8c14d0-83f3-4880-bd0f-c2f1482fb446","query":"A 23-year-old woman with cystic fibrosis presents with 5 days of progressive fatigue, nausea, and dark urine. Four weeks ago she began ivacaftor 150 mg twice daily for CFTR-ΔF508/R117H genotype; before this medication change, she only used pancreatic enzyme replacement. She has visited the emergency department twice in the past 2 weeks for similar complaints and was discharged each time with a diagnosis of viral gastroenteritis. At the first visit, labs showed ALT 78 U/L, AST 65 U/L, and total bilirubin 1.2 mg/dL; at the second visit, ALT 142 U/L, AST 118 U/L, and total bilirubin 2.1 mg/dL. Today, her temperature is 37.6°C, heart rate 102/min, blood pressure 118/72 mmHg, respiratory rate 18/min, and oxygen saturation 98% on room air. Physical exam is unremarkable except for scleral icterus. Laboratory studies now reveal ALT 198 U/L, AST 142 U/L, alkaline phosphatase 285 U/L, total bilirubin 2.8 mg/dL, INR 1.1, and albumin 3.8 g/dL. CBC is within normal limits, and urinalysis is positive for bilirubin. She takes no other medications. What hepatic transport mechanism explains this progressive cholestatic injury after ivacaftor initiation, and what immediate intervention is required?","rubric":{"id":"ivacaftor-cholestasis-evaluation","sections":[{"id":"pathophysiology","title":"Pathophysiology","criteria":[{"id":"bsep-inhibition","requirement":"States that ivacaftor inhibits the bile salt export pump (BSEP, ABCB11).","weight":7},{"id":"canalicular-role","requirement":"Defines BSEP as the canalicular transporter moving bile acids from heaptocytes into bile. ","weight":6},{"id":"bile-acid-buildup","requirement":"Indicates that BSEP inhibition leads to heaptocellular accumulation of bile acids. ","weight":5},{"id":"injury-mechanisms","requirement":"Lists at least 2 of oxidative stress, mitochondrial dysfunction, direct heaptocellular injury as consequences of bile acid retention. ","weight":5},{"id":"cholestatic-basis","requirement":"States that impaired bile flow from transporter inhibition underlies cholestatic liver injury. ","weight":5}]},{"id":"defines-clinical-correlation-and-diagnosis","title":"Defines Clinical Correlation and Diagnosis","criteria":[{"id":"temporal-link","requirement":"Indicates that at least one of dark urine or liver test abnormalities began after ivacaftor initiation","weight":6},{"id":"cholestatic-labs","requirement":"Lists at least 3 of dark urine, elevated conjugated bilirubin, elevated alkaline phsphatase, or elevated aminotransferases as observed findings. ","weight":5},{"id":"no-drug-confounders","requirement":"States that no competing medications explain the cholestatic pattern. ","weight":5},{"id":"no-systemic-causes","requirement":"States that no systemic conditions explain the cholestatic pattern. ","weight":4}]},{"id":"recommends-management-and-therapeutic-strategy","title":"Recommends Management and Therapeutic Strategy","criteria":[{"id":"stop-ivacaftor","requirement":"Recommends prompt discontinuation of ivacaftor as the most immediate intervention. ","weight":7},{"id":"withdrawl-principle","requirement":"Defines drug withdrawl as the central principle in managing drug-induced cholestatic liver injury. ","weight":7},{"id":"early-recovery","requirement":"Indicates that recovery is often possible when the offending drug is removed early. ","weight":7},{"id":"udca","requirement":"Recommends considering ursodeoxycholic acid to improve bile flow. ","weight":7},{"id":"cftr-alternatives","requirement":"Lists at least 1 of tezacaftor/ivacaftor or elexacaftor/tezacaftor/ivacaftor as alternative CFTR modulator regimens after recovery. ","weight":7}]},{"id":"specifies-monitoring-protocol-and-saftey-thresholds","title":"Specifies Monitoring Protocol and Saftey Thresholds","criteria":[{"id":"milestone-schedule","requirement":"Lists at least 2 of baseline, 2 weeks, 4 weeks, and monthly for the first 3 months as recommended monitoring milestones. ","weight":6},{"id":"bilirubin-stop-rule","requirement":"Specifies prompt drug discontinuation if bilirubin doubles above baseline. ","weight":6},{"id":"monitored-tests","requirement":"Lists at least 2 of liver function tests, INR, bilirubin as serially monitored labs. ","weight":4}]},{"id":"unsafe-errors","title":"Unsafe Errors","criteria":[{"id":"steroids-first","requirement":"Initiating immunosuppression as first line for BSEP inhibition ","weight":-10}]}]},"goldenResponse":"This patient's progressive cholestatic liver injury is best explained by ivacaftor inhibition of the bile salt export pump (BSEP, ABCB11), which is the key canalicular transporter responsible for moving bile acids from hepatocytes into bile. When BSEP is inhibited, bile acids accumulate within hepatocytes, triggering oxidative stress, mitochondrial dysfunction to the point of causing hepatocellular injury. The timing of the patient's symptoms to ivacaftor initiation is convincing. The patient developed dark urine, elevated conjugated bilirubin, alkaline phosphatase, and aminotransferases after starting ivacaftor. No other medications or conditions explain the cholestatic pattern. The most immediate and effective intervention is to stop ivacaftor in order to remove the insult and allow bile flow and hepatic function to slowly recover.\nDrug withdrawal is the central principle in managing drug-induced cholestatic liver injury, and recovery is often possible when the insult is removed early. Additional supportive strategies include serial monitoring of liver function tests, international normalized ratio, and bilirubin, along with consideration of ursodeoxycholic acid to improve bile flow and mitigate bile acid toxicity, though evidence for its benefit in acquired transporter inhibition is modest. Long-term complications from untreated cholestasis include progressive fibrosis, cirrhosis, portal hypertension, and hepatocellular carcinoma, all driven by chronic bile acid retention. Alternative CFTR modulator regimens such as tezacaftor/ivacaftor or the triple combination elexacaftor/tezacaftor/ivacaftor may be considered after recovery, though careful monitoring for any similar occurrences is essential. Standard recommendations from hepatology guidelines highlight baseline liver function tests prior to therapy, reassessment at 2 and 4 weeks, monthly checks for the first 3 months, and quarterly thereafter, with prompt drug discontinuation if ALT or AST exceeds three times the upper limit of normal (\\~45U/L) or bilirubin doubles above baseline."}